--
-- Created by IntelliJ IDEA.
-- User: admin
-- Date: 15/8/10
-- Time: 下午3:54
-- To change this template use File | Settings | File Templates.
--

local language = {
    gamename = "神将道",

    sensitiveWordForSetName = {"爸爸","父亲","妈妈","母亲","爷爷","奶奶","姥姥","姥爷","孙子","儿子"," ","吾儿","吾子","吾孙","吾崽"},

    exclusiveArtifactNew = {
        [1] = "(强化 +%s)",
        [2] = "强化成功率：%d%%",
        [3] = "未镶嵌器灵",
        [4] = "已达到强化等级上限",
        [5] = "强 化",
        [6] = "镶 嵌",
        [7] = "已强化至最高等级",
        [8] = "【洗礼+%d解锁】",
        [9] = "未镶嵌器灵",
        [10] = "专属神器",
        [11] = "未镶嵌器灵",
        [12] = "基础属性：",
        [13] = "已选择：",
        [14] = "今日剩余次数不足",
        [15] = "【%s】彩金后开启专属副本",
        [16] = "彩金伙伴可使用专属神器",
        [17] = "器灵锁定后无法熔炼",
        [18] = "激活%s专属神器%s",
        [19] = "需上阵【%s】可进行挑战",
        [20] = "暂无可熔炼器灵",
        [21] = "请放入需要熔炼的器灵",
        [22] = "%s品质低于彩金专属神器则不再生效是否进行转移",
        [23] = "%s品质低于彩金专属神器则不再生效是否进行互换",
        [24] = "强化成功",
        [25] = "强化失败",
        [26] = "镶嵌神器：",
        [27] = "没有可镶嵌专属神器"
    },

    sculpture = {
        [1] = "等级奖励",
        [2] = "每日任务",
        [3] = "挑战商店",
        [4] = "雕塑商店",
        [5] = "激活雕塑后可兑换",
        [6] = "雕像作者：",
        [7] = "雕像完成时间：",
        [8] = "%d年%d月%d日%d时%d分",
        [9] = "雕塑%d级可兑换",
        [10] = "可兑换%d次"
    },

    huanhua = {
        [1] = "幻 化",
        [2] = "不能幻化自身",
        [3] = "该伙伴已存在幻化关系",
        [4] = "上阵和助阵中不能出现相同伙伴",
        [5] = "选择一个伙伴幻化为",
        [6] = "由%s幻化",
        [7] = "属性-",
        [8] = "解 除",
        [9] = "有效期至:%d月%d日%d时",
        [10] = "(幻化)",
        [11] = "已幻化",
        [12] = "阵容冲突",
        [13] = "%s幻化为%s",
        [14] = "(修改幻化%s的突破技不消耗大还丹)",
        [15] = "请先解除该幻影对应伙伴的幻化",
        [16] = "可领取次数：",
        [17] = "可购买次数：",
        [18] = "领取次数不足",
        [19] = "购买次数不足",
    },

    weekfund = {
        [1] = "活动结束充值倒计时：",
        [2] = "活动结束倒计时：",
        [3] = "请激活后领取",
        [4] = "第%d天可领取",
    },

    dewPool = {
        [1] = "完成任务可获得海量记忆碎片奖励",
        [2] = "任务只能完成一次,完成后激活下一个任务",
        [3] = "完成指定任务并领取奖励后可解锁露水收集任务",
        [4] = "完成任务可获得记忆碎片奖励",
        [5] = "完成封神之路任务可以解锁露水收集任务",
        [6] = "任务进度在每周一零点重置",
        [7] = "使用记忆碎片兑换稀有道具",
        [8] = "兑换次数每周一零点重置",
        [9] = "（记忆碎片数量不会重置消失）",

    },

    gameHelper = {
        [1] = "活动未开启",
        [2] = "当前挑战:",
        [3] = "达到今日购买次数上限",
        [4] = "(今日可重置次数%d/%d)",
        [5] = "第%d层",
        [6] = "超过最大重置次数",
        [7] = "(今日可点亮次数%d/%d)",
        [8] = "(今日可开启次数%d/%d)",
        [9] = "(今日可购次数%d/%d)",
        [10] = "超过最大点亮次数",
        [11] = "超过最大开启次数",
        [12] = "超过最大购买次数",
        [13] = "未加入公会",
        [14] = "公会%d级开启",
        [15] = "今日可挑战次数:",
        [16] = "超过最大可挑战次数",
        [17] = "未到活动开启时间",
        [18] = "未达到开启等级",
        [19] = "没有可执行任务",
        [20] = "当前没有日志，请先执行",
        [21] = "已达到今日扫荡上限",
        [22] = "元宝鼓舞:(可鼓舞次数%d/%d)",
        [23] = "元宝鼓舞",
        [24] = "贵族%d及以上开启该功能",
        [25] = "已达到今日可鼓舞上限",
        [26] = "已达今日扫荡上限",
        [27] = "没有任务满足可执行条件",
        [28] = "入会时间不足24小时，不可挑战",
        [29] = "剩余元宝不足",
        [30] = "(最多%d次)",
        [31] = "没有获得奖励",
        [32] = "未执行",
        [33] = "当前不可添加伙伴，请先挑战",
        [34] = "请先前往挑战王的男人",
        [35] = "已完成",
        [36] = "完成日常任务",
        [37] = "贵族%d开启",
        [38] = "请在设置页面修改",
        [39] = "挑战难度：",
        [40] = "可扫荡层数：",
        [41] = "简单",
        [42] = "普通",
        [43] = "困难",
        [44] = "噩梦",
        [45] = "未开启%d层天宫",
        [46] = "不满足开启条件",
        [47] = "需成功通关第一关后可使用一键挑战",
    },

    sangumaolu = {
        [1] = "已拜访",
        [2] = "拜 访",
        [3] = "今日拜访完成，请明日再来。",
        [4] = "将军好意，不胜感激。孔明才疏学浅，恐难以担当大任。将军请回吧。",
        [5] = "天下战乱，百姓深受其苦，承蒙将军不弃，孔明愿意为您效力。",
        [6] = "%d分%d秒后可继续拜访",

        dialog = {
            [1] = "三顾频烦天下计，两朝开济老臣心。",
            [2] = "先帝不以臣卑鄙，猥自枉屈，三顾臣于草庐之中。",
            [3] = "大梦谁先觉，平生我自知。草堂春睡足，窗外日迟迟。",
        }
    },

    intensifyMaster = {
        [1] = "当前等级",
        [2] = "下一等级",
        [3] = "强化大师%d级",
        [4] = "已达到最大等级",
        [5] = "升级条件：",
        [6] = "全阵基础属性加成：",
        [7] = "强化大师",
        [8] = "未上阵",
        [9] = "未镶嵌",
    },

    ancientRuins = {
        [1] = "当前累计英魂：",
        [2] = "剩余挑战次数：",
        [3] = "可领取",
        [4] = "需要击杀本层小怪：",
        [5] = "今日挑战次数已用完",
        [6] = "需要击杀%d个本层小怪",

        monster_dialog = {
            [1] = "想获得“英魂”吗？击败我，都是你的",
            [2] = "遗迹深处的怪物可以获得更多的“英魂”，击败BOSS才可以进入",
            [3] = "想挑战BOSS么，你需要先打败我们这些不成器的小怪",
        },
        boss_dialog = {
            [1] = "再击杀%d个小怪可挑战我，获胜后可进入下一层",
            [2] = "击败我，就可以进入下一层遗迹，获得更高奖励",
        },

    },

    xuanyueTreasures = {
        [1] = "可领取",
        [2] = "已领取",
        [3] = "领 取",
        [4] = "继续领取",
        [5] = "祝福值不足，无法领取奖励",
        [6] = "当前祝福值：",
        [7] = "祝福值通过活跃宝箱获得",
        [8] = "立即前往",
        [9] = "活动结束：",
        [10] = "解锁高级玄月秘宝总计可获得",
        [11] = "当前解锁玄月秘宝可获得",
        [12] = "前往领取",
        [13] = "玄月秘宝奖励激活",
        [14] = "结束：",
        [15] = "已结束",
    },

    mobileShop = {
        [1] = "今日可购买%d次(每日0点刷新)",
        [2] = "总价：",
    },

    tradingShop = {
        [1] = "已过期",
        [2] = "公示期",
        [3] = "保护期",
        [4] = "超过上架最大数量",
        [5] = "上架成功!",
        [6] = "上架失败,请重试!",
        [7] = "购买成功!",
        [8] = "购买失败!",
        [9] = "下架成功!",
        [10] = "下架失败!",
        [11] = "确定按原定价格重新上架吗？",
        [12] = "我的货架显示已上架未卖出的道具",
        [13] = "宝石属性（%d/%d）：",
        [14] = "上架",
        [15] = "出售道具",
        [16] = "购买道具",
        [17] = "购买",

        [18] = "下架道具",
        [19] = "下架",
        [20] = "取回",
        [21] = "重新上架",

        [22] = "订单号：",
        [23] = "关注数量达到上限",
        [24] = "出售数量达到上限",
        [25] = "货币不足",
        [26] = "已关注",
        [27] = "关注成功",
        [28] = "无筛选",
        [29] = "未选中要购买道具！",
        [30] = "剩余时间：",
        [31] = "自己出售的不能关注",
        [32] = "商品在上架前15分钟公示期内不可购买",

        [33] = "物品不能被交易",
        [34] = "物品数量不足",
        [35] = "物品正在使用中",
        [36] = "不满足交易条件",
        [37] = "请输入搜索内容",
        [38] = "未搜索到相关数据",
        [39] = "查询失败,请重试!",
    },

    nightclub = {
        [1] = "%s小时",
        [2] = "低 级",
        [3] = "中 级",
        [4] = "高 级",
        [5] = "开始消费",
        [6] = "下次收益时间：",
        [7] = "消费中：%s",
        [8] = "选择档次",
        [9] = "简介：",
        [10]= "消费剩余:",
        [11]= "必掉",
        [12]= "每%s分钟收益一次!!",
        [13]= "点击屏幕继续",
        [14]= "天庭银座",
        [15]= "达到%s级解锁",
        [16]= "通过%s解锁",
        [17]= "需要",
        [18]= "小伙伴",
        [19]= "队列中",
        [20]= "魂魄数量:",
        [21]= "灵光一闪，%s闪亮登场，获得%s",
        [22]= "档次:",
        [23]= "当前不可灌溉",
        [24]= "帮助灌溉",
        [25]= "同一好友每日只可灌溉一次哦！",
        [26] = "当前位置已有伙伴",
        [27] = "可领取",
        [28] = "当前没有选择伙伴",
        [29] = "当前没有选择伙伴",
        [30] = "当前没有可消费的",
        [31] = "确 定",
        [32] = "全部清空",
        [33] = "当前不可添加伙伴,返回后才能添加伙伴",
        [34] = "当前不可添加伙伴",
        [35] = "好友还未开始该位置的培养",
        [36] = "该伙伴培养已完成，不可灌溉",
        [37] = "灌溉已满",
        [38] = "已为你灌溉",
        [39] = "好友剩余灌溉次数:",
        [40] = "好友还未开启该位置",
        [41]= "剩余:",
        [42]= "该好友被灌溉次数已满",
        [43]= "灌溉积分",
        [44]= "橙色魂魄数量:",
        [45] = "自动添加",
        [46] = "当前没有选择伙伴",
    },
    
    gamestar = {
        [1] = "第%s关",
        [2] = "吃 豆",
        [3] = "道具不足",
        [4] = "爆 豆",
        [5] = "主角进阶等级达到%s",
        [6] = "主角进阶等级不足",
        [7] = "游戏结束\n敬请期待",
        [8] = "下级",
    },
    notifications = {
        [1] = "快来蟠桃宴吃王母娘娘的蟠桃咯（30点体力），柔软多汁,甜津津！！！",
        [2] = "魔龙降世送元宝，小伙伴们抄起家伙撸呀撸！",
    },
    download = {
        [1] = "下载配置文件出错，请重试",
    },
    loading = {
        [1] = "下载配置文件出错，请退出游戏重进",
    },
    region = {
        xian = "仙",
        mo = "魔",
        ren = "人",
        yao = "妖",
        di = "地",
    },
    skill_Range = {
        single = "单体",
        single2 = "单体后排",
        first = "前排",
        second = "后排",
        three = "三行",
        random = "随机",
        all = "全体",
    },
    skill_Effect = {
        once = "无",
        weaken = "削弱",
        dizzy = "控制",
        frozen = "冰冻",
        dot = "持续掉血",
        dot2 = "持续掉血",
        suck = "吸血",
        promote = "提升",
    },

    equipType = {
        weapon = "武器",
        armor = "防具",
        head = "头盔",
        accessory = "饰品",
        horse = "坐骑",
        treasure = "典籍",
        shoe = "头盔",
        accessories = "饰品",
        equip = "装备",
    },
    attr_type = {
        atk = "攻击",
        g_atk = "仙攻",
        def = "防御",
        g_def = "仙防",
        hp = "生命",
        g_hp = "仙命",
        speed = "速度",
        critical = "暴击",
        g_critical = "仙暴",
        dodge = "闪避",
        g_dodge = "仙避",
        parry = "反击",
        g_parry = "仙反",
        subdmg = "减少伤害",
        adddmg = "增加伤害",
        g_adddmg = "仙增伤",
        g_subdmg ="仙减伤",
        adddmgpct = "增伤",
        subdmgpct = "减伤",
        hit = "命中",
        g_hit = "仙命中",
        criticaldmg = "暴击伤害",
        g_criticaldmg = "仙暴伤",
        resilience = "抗暴击",
        g_resilience = "仙抗暴",
        arp = "抗反击",
        g_arp = "仙抗反",
        ap = "怒气",
        ap_atk_p = "恢复怒气",
        heal = "治疗效果",
        antiblew = "自爆减伤",
        skill_resilience = "技能减伤",
        mozhao_resilience = "魔罩增伤",
    },
    encounterType = {
        exp = "仙人下凡",
        search = "打扫战场",
        battle = "行侠仗义",
        general = "求贤若渴",
        shop = "仙山寻宝",
    },
    encounter= {
        [1] = "知道了",        
    },
    quality = {
        [2] = "绿色",
        [3] = "蓝色",
        [4] = "紫色",
        [5] = "橙色",
        [6] = "红色",
        [7] = "彩金色",
    },

    fragmentnum = {
        [3] = "1,2,3",
        [4] = "1,2,3,4",
        [5] = "1,2,3,4,5",
        [6] = "1,2,3,4,5,6",
    },
    wdayNum = {
        [1] = "日",
        [2] = "一",
        [3] = "二",
        [4] = "三",
        [5] = "四",
        [6] = "五",
        [7] = "六",
    },
    bigNum = {
        [1] = "一",
        [2] = "二",
        [3] = "三",
        [4] = "四",
        [5] = "五",
        [6] = "六",
        [7] = "七",
        [8] = "八",
        [9] = "九",
        [10] = "十",
        [11] = "十一",
        [12] = "十二",
        [13] = "十三",
        [14] = "十四",
        [15] = "十五",
        [16] = "十六",
        [17] = "十七",
        [18] = "十八",
        [19] = "十九",
        [20] = "二十",
        [21] = "二十一",
        [22] = "二十二",
        [23] = "二十三",
        [24] = "二十四",
        [25] = "二十五",
        [26] = "二十六",
        [27] = "二十七",
        [28] = "二十八",
        [29] = "二十九",
        [30] = "三十",
        [31] = "三十一",
        [32] = "三十二",
        [33] = "三十三",
        [34] = "三十四",
        [35] = "三十五",
        [36] = "三十六",
        [37] = "三十七",
        [38] = "三十八",
        [39] = "三十九",
        [40] = "四十",
        [41] = "四十一",
        [42] = "四十二",
        [43] = "四十三",
        [44] = "四十四",
        [45] = "四十五",
        [46] = "四十六",
        [47] = "四十七",
        [48] = "四十八",
        [49] = "四十九",
        [50] = "五十",
        [51] = "五十一",
        [52] = "五十二",
        [53] = "五十三",
        [54] = "五十四",
        [55] = "五十五",
        [56] = "五十六",
        [57] = "五十七",
        [58] = "五十八",
        [59] = "五十九",
        [60] = "六十",
        [61] = "六十一",
        [62] = "六十二",
        [63] = "六十三",
        [64] = "六十四",
        [65] = "六十五",
        [66] = "六十六",
        [67] = "六十七",
        [68] = "六十八",
        [69] = "六十九",
        [70] = "七十",
    },
    activity = {
        [1] = "活动关闭!!",
        [2] = "规则说明",
        [3] = "点击大蟠即可领取奖励！",
        [4] = "奖励物品,每日零点更换",
        [5] = "领取全部奖励后才可以重置奖励哦!",
        [6] = "消耗%s枚蟠桃币,领取奖励",
        [7] = "战力成长排行榜",
        [8] = "魔符战力排行榜",
        [9] = "战力成长: ",
        [10] = "魔符战力: ",
        [11] = "已经领取",
        [12] = "请先激活周卡",
        [13] = "双倍产出",
        [14] = "双倍银币",
        [15] = "剩余天数：%s天",
        [16] = "点击激活",
        [17] = "激活后双倍特权即生效，且激活当天为第1天，确认激活吗?",

        [21] = "活动",
        [22] = "福利",
        [23] = "商店",
        [24] = "冲榜活动",
        [25] = "充值活动",
    },
    activity_peace = {
        [0] = "蟠桃熟了",
        [1] = "时辰未到",
        [2] = "已经品尝",
        [3] = "时辰已过",

        [4] = "蟠桃准备好了！一起来享用吧！",
        [5] = "蟠桃还没准备好，过会儿再来吧！",
        [6] = "王母的蟠桃嘎嘣甜，我又充满了力量！",
        [7] = "美味的蟠桃能补充50点体力和",
        [8] = "元宝",
        [9] = "",
    },

    activity_babelTower = {
        [1] = "通天币不足",
        [2] = "通天塔",
        [3] = "需进入%s",
        [4] = "每天0点重置购买次数",
    },

    activity_zhounian = {
        [1] = "活动期间内，在本页面多次购买礼包可获得累计购买礼包！",
        [2] = "剩余购买次数:",
        [3] = "当前祈福值",
        [4] = "完成任务可提升祈福值！",
        [5] = "祈福结束时间:2018年5月5日24时",
        [6] = "发奖时间:2018年5月6日0时-2018年5月6日24时",
        [7] = "今日剩余可完成次数:",
        [8] = "祈福值+",
        [9] = "接任务",
        [10] = "您已买完该礼包",
        [11] = "产出x",
        [12] = "确认选择",
        [13] = "请先选择奖励",
        [14] = "当前拥有",
        [15] = "活动结束时间:",
        [16] = "没有可刷新的任务",
        [17] = "请先祈福",
        [18] = "取 消",
        [19] = "今日次数已用完",
        [20] = "祈福已结束",
        [21] = "活动已结束",
    },

    activity_shop = {
        [1] = "魔王大人请稍等，商店马上要自动刷新了",
        [2] = "点刷新",
    },
    activity_fashion = {
        [1] = "折",
        [2] = "已拥有该时装",
        [3] = "时 装",
        [4] = "已装备该时装",
        [5] = "没有获得该时装",
        [6] = "强化材料",
        [7] = "强化道具不足",
        [8] = "结束时间: ",
    },
    activityLg = {
        [1] = "月卡用户立即获得",
        [2] = "剩余次数：0/1",
        [3] = "剩余次数：1/1",
        [4] = "元",
    },

    activity_goddown = {
        [1] = "可领取",
        [2] = "圆 梦",
        [3] = "领 取",
        [4] = "立即完成",
        [5] = "冷却时间: ",
        [6] = "免费",
        [7] = "已领取",
    },

    buttontext = {
        lingqu = "领 取",
        yilingqu = "已领取",
        goumai = "购 买",
        yigoumai = "已购买",
        xinyunzhi = "幸运值",
        shangpinyulan = "商品预览",
        shuaxin = "刷 新",
        weigoumai = "未购买",
        weiwancheng = "未完成",
        fanhui = "返 回",
        queding = "确 定",
        hecheng = "合 成",
        duihuan = "兑 换",
        shouqing = "已售磬",
        gobuy = "去消费",
        qianwang = "前 往",
        shifoutuichu = "确定退出游戏？",
        chongzhi = "充 值",
    },

    damageConfig = {
         loseblood_normal = "",
         loseblood_critical = "暴击",
         dot = "中毒",
         dot2 = "中毒",
         dodge = "",
         parry = "格挡",
         defense = "招架",
         addblood_normal = "",
         addblood_critical = "暴击",
         manxue = "满血"
    },

    fairycave ={
        [1] = "点 星",
        [2] = "每日0点刷新观星次数:",
        [3] = "已经全部点亮",
        [4] = "观 星",
        [5] = "观星次数不足",
        [6] = "请先观星",
        [7] = "本次观星已全部点亮",
        [8] = "今日观星次数已用完",
        [9] = "一键观星",
        [10]= "贵族%s开启",
        [11] = "贵族等级不足",
        [12] = "是否花费%s元宝一键观星?",
    },

    mammon = {
        [1] = "恭喜崔千凝，迎财神得354元宝!",
        [2] = "恭喜潘碧萱，迎财神得420元宝!",
        [3] = "恭喜幻莲颜，迎财神得365元宝!",
        [4] = "恭喜吉含之，迎财神得3212元宝!",
        [5] = "恭喜夜天寒凝，迎财神得376元宝!",
        [6] = "恭喜冰旋昊焱，迎财神得412元宝!",
        [7] = "恭喜凌寒香萱，迎财神得456元宝!",
        [8] = "恭喜一曲寄云，迎财神得548元宝!",
        [9] = "恭喜弼半梅，迎财神得361元宝!",
        [10] = "恭喜寄容安双，迎财神得382元宝!",
    },

    chat = {
        [0] = "世界",
        [1] = "公会",
        [2] = "点击输入内容，最多发送50字",
        [3] = "请输入发言",
        [4] = "传音符不够,无法发言",
        [5] = "未加入公会",
        [6] = "[世界]",
        [7] = "[公会]",
        [8] = " 玩家未达到10级，暂不能发言",
        [9] = " 您发送信息过于频繁",
        [10] = "系统",
        [11] = "[系统]",
    },

    collect = {
        [0] = "伙伴",
        [1] = "装备",
        [2] = "宝物",
        [3] = "阵容说明：",
        [4] = "温馨提示：所有彩金色伙伴均通过橙色伙伴突破到+14而成",
        [5] = "温馨提示：所有红色伙伴均通过橙色伙伴突破到+11而成",
    },

    copyChapter = {
        [0] = "普通",
        [1] = "精英",
        [2] = "本关全三星通过即可领取奖励",
        [3] = "活动",
        [4] = "掉落预览",
        [5] = "名将",

        [6] = "每周",
        [7] = "一、",
        [8] = "二、",
        [9] = "三、",
        [10] = "四、",
        [11] = "五、",
        [12] = "六、",
        [13] = "日",
        [14] = "开启",
        [15] = "您没有挑战次数了！",
        [16] = "等级不足",
        [17] = "本关卡今日次数已用完",
        [18] = "领取失败",

    },

    copymap = {
        [0] = "可能掉落",
        [1] = "扫 荡",
        [2] = "探 索",
        [3] = "通关奖励",
    },

    cup = {
        [0] = "赛场",
        [1] = "比赛",
        [2] = "比赛中......",
        [3] = "开赛倒计时: ",
        [4] = "主角",
        [5] = "每天9：00-23:00可报名参加次日杯赛",
        [6] = "每天0：00-8：59为停止报名时间",
        [7] = "呦呦，快来参加比赛啊，\n        自动报名明日杯赛",
        [8] = "贵族5自动报名明日杯赛",
        [9] = "呦呦，快来参加比赛啊!",
    },

    devour = {
        [0] = "零",
        [1] = "一",
        [2] = "二",
        [3] = "三",
        [4] = "四",
        [5] = "五",
        [6] = "六",
        [7] = "七",
        [8] = "八",
        [9] = "九",
        [10] = "十",
        [11] = "进阶后可喂养",
        [12] = "进 阶",
        [13] = "已达到最高阶",
        [14] = "消耗道具数量不够",
        [15] = "喂 养",
        [16] = "已达到最高级",
        [17] = "请选择伙伴或魂魄",
        [18] = "进阶",
        [19] = "上阵",
        [20] = "已上阵",
        [21] = "魔宠",
        [22] = "升级",
        [23] = "进阶",
        [24] = "吞噬",
    },

    equipResolve = {
        [0] = "绿色",
        [1] = "蓝色",
        [2] = "紫色",
        [3] = "橙色",
        [4] = "全选",
        [5] = "请选择需要分解的装备",
        [6] = "无装备可分解",
    },

    equips = {
        [0] = "装 备",
        [1] = "宝 物",
        [2] = "碎 片",
        [3] = "道 具",
        [4] = "批量分解",
        [5] = "主角",
        [6] = "精炼",
        [7] = "升级",
        [8] = "强化",
        [9] = "碎片不足",
        [10] = "去挑战",
        [11] = "无钥匙",
        [12] = "无对应的钥匙",
        [13] = "打开",
        [14] = "十连开",
        [15] = "使用",
        [16] = "您还没有装备！",
        [17] = "您还没有宝物！",
        [18] = "升华",
        [19] = "钥匙不足，是否去商城购买？",
        [20] = "最大",
        [21] = "洗炼",
        [22] = "炼 化",
        [23] = "已装备的物品无法炼化",
        [24] = "精 炼",
        [25] = "洗 炼",
        [26] = "该装备无法洗炼",
        [27] = "一键强化消耗大量银币,是否继续？",
        [28] = "注 灵",
        [29] = "该装备无法注灵",
        [30] = "注灵等级:",
        [31] = "注灵材料",
        [32] = "已达到注灵最高等级",
        [33] = "注灵材料不足",
        [34] = "注灵上限:",
        [35] = "注灵十次",
        [36] = "蓝色装备品质以下无法注灵",
    },

    ly_first = {
        [1] = "攻击型",
        [2] = "攻防一体",
        [3] = "防御型",
        [4] = "请输入昵称",
    },

    layer_first = {
        [0] = "额~~~我这是在哪~~我的身体呢？",
        [1] = "你终于醒了，魔王军团全军覆没，你已经战死，肉身被毁，我趁乱截走了你的魂魄，不然你早就被他们打的魂飞魄散了。",
        [2] = "你到底是谁？为什么要帮我？",
        [3] = "我会用法力重塑你的魔身，你挑选一下你想要的形象吧!",
        [4] = "哇！屌爆了！",
        [5] = "现在当务之急我们要先去地府复活之前被你收服的伙伴和魔将。哦，no！再次获得后，就应该叫做伙伴了！",
        [6] = "走你（总有一种被忽悠的感觉呢）！",
        [7] = "请选择形象",
        [8] = "请输入昵称",
    },

    layer_copy = {
        [1] = "3星通过后可扫荡",
        [2] = "挑战",
        [3] = "奖励预览",
        [4] = "已领取",
    },

    layer_devour = {
        [1] = "下一阶",
        [2] = "下一级",
        [3] = "前排伙伴：",
        [4] = "后排伙伴：",
        [5] = "出战中",
        [6] = "出 战",
        [7] = "已到达最高阶",
        [8] = "满级",
        [9] = "请选择伙伴或魂魄",

    },

    activity_invent = {
        [1] = "复制",
        [2] = "复制成功",
        [3] = "等级",
    },

    friendcopy = {
        [0] = "挑 战",
        [1] = "请选择伙伴",
        [2] = "道具不足",
        [3] = "查看掉落",
        [4] = "可能掉落",
        [5] = "主角",
        [6] = "宝物不足",
        [7] = "请选择好友参加战斗",
    },

    friends = {
        [0] = "当前好友",
        [1] = "好友推荐",
        [2] = "好友申请",
        [3] = "一键送礼",
        [4] = "已全部送完",
        [5] = "添加好友后才可以送礼",
        [6] = "一键收礼",
        [7] = "没有可领取的礼物",
        [8] = "刷新好友",
        [9] = "精确查找",
        [10] = "在线",
        [11] = "很久未上线",
        [12] = "离线: ",
        [13] = "收 礼",
        [14] = "送 礼",
        [15] = "查 看",
        [16] = "删 除",
        [17] = "传 书",
        [18] = "已通过",
        [19] = "好友已满！！",
        [20] = "对方好友已满！！",
        [21] = "没有好友申请",
        [22] = "申请成功",
        [23] = "自己好友已满",
        [24] =  "对方好友已满",
        [25] = "申请失败",
        [26] = "无好友可助阵",
        [27] = "屏蔽列表",
        [28] = "屏蔽成功",
        [29] = "屏蔽失败",
        [30] = "取消屏蔽成功",
        [31] = "取消屏蔽失败",
        [32] = "取消屏蔽",
        [33] = "切 磋",
        [40] = "已经没有可以添加的好友了",
    },

    general = {
        [0] = "伙 伴",
        [1] = "魂 魄",
        [2] = "兑 换",
        [3] = "升 级",
        [4] = "培 养",
        [5] = "突 破",
        [6] = "绿色伙伴无法突破",
        [7] = "魂魄不足",
        [8] = "招 募",
        [9] = "银币不足",
        [10] = "所需伙伴不足",
        [11] = "兑 换",
        [12] = "数量: ",
        [13] = "已达最高阶",
        [14] = "伙伴等级: ",
        [15] = "伙伴等级不足",
        [16] = "等级：",
        [17] = "资质：",
        [18] = "52级开启",
        [19] = "突破丹不足",
        [20] = "银币不足",
        [21] = "已达最高阶",
        [22] = "绿色伙伴无法通过经验丹升级",
        [23] = "绿色伙伴无法培养",
        [24] = "1级伙伴无法培养",
        [25] = "突破后解锁: ",
        [26] = "突破材料",
        [27] = "经验值已满",
        [28] = "一键添加",
        [29] = "获取经验丹",
        [30] = "一起上阵",
        [31] = "此伙伴不能觉醒",
        [32] = "伙伴等级不足",
        [33] = "觉醒材料不足",
        [34] = "伙伴突破等级不足",
        [35] = "已经觉醒满级",
        [36] = "觉醒材料",
        [37] = "觉 醒",
        [38] = "精 华",
        [39] = "绿色伙伴无法修炼",
        [40] = "进 修",
        [41] = "理科",
        [42] = "文科",
        [43] = "进修值",
        [44] = "增伤百分比:",
        [45] = "减伤百分比:",
        [46] = "道具消耗",
        [47] = "生命:",
        [48] = "飞 升",
        [49] = "数量不足",
        [50] = "伙伴进修等级不足",
        [51] = "仙属性转换",
        [52] = "凡属性转换",
        [53] = "该伙伴无法飞升",
        [54] = "主角进阶等级不足",
        [55] = "升五级",
        [56] = "升一级",
        [57] = "一键添加",
        [58] = "确 定",
        [59] = "技能升级",
        [60] = "需要角色等级：",
        [61] = "需要突破等级：",
        [62] = "需要所有触发伙伴个人技等级：",
        [63] = "请选择保留属性",
        [64] = "培养属性",
        [65] = "次数",
        [66] = "所选次数需花费：",
        [67] = "现有：",
        [68] = "开始培养",
        [69] = "请先选择要保存的属性",
        [70] = "请选择次数",
        [71] = "潜力点不足，最多培养两个属性点",
        [72] = "自动培养完成",
        [73] = "潜力点：",
        [74] = "飞升等级不足",
        [75] = "升 星"
    }, 

    babelTower = {
        [1] = "通天塔%d层",
        [2] = "仙元不足",
        [3] = "当前正在第%d层挑战中",
        [4] = "进 入",
        [5] = "通关%s",
        [6] = "上阵武将中至少有%d个彩金+%d武将",
        [7] = "未通关上层通天塔",
        [8] = "彩金将数量不满足要求",
        [9] = "上一层",
        [10] = "下一层",
        [11] = "一键扫荡",
        [12] = "开始战斗",
        [13] = "推荐战斗力：",
        [14] = "挑 战",
        [15] = "当前层未挑战成功",
        [16] = "第%d层",
        [17] = "不满足扫荡条件",
        [18] = "挑战次数已用完",
        [19] = "结束挑战",
        [20] = "购买次数成功",
        [21] = "战斗力：",
        [22] = "放弃后无法继续挑战，是否确认？",
        [23] = "通天塔次数已经重置，请重新开始挑战",
        [24] = "请选择购买次数",
        [25] = "当前已是第一层",
        [26] = "当前已是最后一层",
        [27] = "排行榜",
        [28] = "本日",
        [29] = "历史",
        [30] = "我的排行：",
        [31] = "未上榜"
    },

    blessingCave = {
        [1] = "仙窟%d层",
    },

    guild_list = {
        [0] = "公会列表",
        [1] = "点击输入公会名字",
        [2] = "输入公会名字",
        [3] = "查无此公会！",
        [4] = "只有会长和副会长可编辑公告",
        [5] = "人数已满，无法加入",
    },

    guild_manager = {
        [0] = "公会成员",
        [1] = "申 请",
        [2] = "解 散",
        [3] = "传 功",
        [4] = "传 位",
        [5] = "降 职",
        [6] = "升 职",
        [7] = "开 除",
        [8] = "查 看",
        [9] = "退 出",
        [10] = "只有会长和副会长可处理请求",
        [11] = "公会信息",
        [12] = "审 核",
        [13] = "只有会长和副会长可处理请求",
        [14] = "传位后可退出公会",
        [15] = "弹 劾",
        [16] = "很久未上线",
        [17] = "只有会长和副会长可修改",
        [18] = "只有会长和副会长可修改公告",
        [19] = "只有会长和副会长可修改宣言",
        [20] = "今日已领取过",
        [21] = "管理员太懒了，没有编辑公告",
        [22] = "确定传位给 ",
        [23] = "公会名重复，创建失败",
        [24] = "公会创建失败",
        [25] = "请不要重复申请",
        [26] = "公会人员已满",
        [27] = "已加入其他的公会",
        [28] = "会长已拒绝你加入该公会",
        [29] = "操作成功，同意该玩家的申请",
        [30] = "本公会人数已满，无法通过该申请",
        [31] = "对方已有公会，无法通过该申请",
        [32] = "操作成功，拒绝该玩家的申请",
        [33] = "修改成功",
        [34] = "修改失败",
        [35] = "弹劾成功",
        [36] = "会长离线未超过7天，不可弹劾",
        [37] = "已有人提出弹劾",
        [38] = "改名成功！！",
        [39] = "名字已被占用，请重新输入",
        [40] = "操作失败，请重新输入",
        [41] = "公会创建成功",
        [42] = "操作失败，请重试",
        [43] = "您还没有加入公会",
    },

    guild_guard = {
        [1] = "本次分数：",
        [2] = "挑战次数已用完",
        [3] = "开始",
        [4] = "历史最佳：",
        [5] = "公会挑战",
        [6] = "返 回",
        [7] = "累计积分：",
        [8] = "生命：",
        [9] = "开 始",
        [10] = "特权开始",
        [11] = "剩余挑战次数：",
        [12] = "历史最高分：",
        [13] = "公会排名",
        [14] = "本服排名",
        [15] = "公会挑战排行榜",
        [16] = "免费",
        [17] = "点击打开",
        [18] = "奖励预览",
        [19] = "当前累计积分：",
        [20] = "每日零点刷新领取状态",
        [21] = "领 取",
        [22] = "未达成",
        [23] = "已领取",
        [24] = "领取本档奖励需要积分：",
    },

    guild_legion = {
        [1] = "  玩家《 ",
        [2] = " 》通过",
        [3] = "会长",
        [4] = "《 ",
        [5] = "》的审核，加入了公会。",
        [6] = "  成员《 ",
        [7] = " 》退出了公会。",
        [8] = " 》使用了《 ",
        [9] = " 》拜神,公会增加了 ",
        [10] = "点经验。",
        [11] = "  会长",
        [12] = "下达命令,封《 ",
        [13] = " 》为",
        [14] = "副会长",
        [15] = "下达命令,撤消了《 ",
        [16] = " 》",
        [17] = "的职务。",
        [18] = " 》很有管理经验",
        [19] = "经过斟酌后,将",
        [20] = "转让给《 ",
        [21] = " 》。",
        [22] = "长期不在线,公会不可一日无主,《",
        [23] = " 》发起弹劾，24小时后《 ",
        [24] = "》将成为",
        [25] = "新会长",
        [26] = "。",
        [27] = "  经过大家齐心协力的努力，公会提升到了",
        [28] = "级。",
        [29] = "》使用了(",
        [30] = " )肥皂供大恐龙洗澡,",
        [31] = "公会",
        [32] = "增加了",
        [33] = "下达命令，把成员《",
        [34] = "》踢出了公会。",
    },
    guild_shangxiang = {
        [1] = "今日已贡献，请明日再来",
        [2] = "银币不足",
        [3] = "元宝不足",
        [4] = "已贡献",


    },

    guild_xianchi = {
        [1] = "未放肥皂",
        [2] = "仙池等级不足，无法领取",
        [3] = "肥皂不足",
        [4] = "今日可用肥皂数，已到最大",
        [5] = "一键肥皂",
        [6] = "获得公会经验:",
        [7] = ",获得个人贡献值:",
        [8] = ",进度增加：",
    },

    guild_shop = {
        [1] = "今日可兑换",
        [2] = "本周可兑换",
        [3] = "这月可兑换",
        [4] = "公会等级不足",
        [5] = "贡献度不足",
        [6] = "兑换次数已用完",
        [7] = "无公会",
        [8] = "公会", --公会3级开启
        [9] = "级开放",
        [10] = "级可兑换",
    },
    guild_treasureinfo = {
        [1] = "报名时间：周四10:00:00 到 周六00:00:00",
        [2] = "夺宝战进入战场时间：周六20:00:00",
        [3] = "报名已经开始，截止倒计时：",
        [4] = "报名结束，进入战场倒计时：",
        [5] = "战斗准备开始，结束倒计时：", 
        [6] = "（周六22:00:00发放奖励）",
        [7] = "无人占领",
        [8] = "前三",
        [9] = "前四",
        [10] = "攻打资格",
        [11] = "确定报名攻打（           ）吗？", --76
        [12] = "确定报名攻打（               ）吗？", --114
        [13] = "确定报名攻打（                  ）吗？",   --152   
        [14] = "攻打资格",
        [15] = "确定", 
        [16] = "取消",
        [17] = "上轮战报", 
        [18] = "查看报名",  
        [19] = "战斗开启，战斗结束倒计时：",        
        [20] = "有公会占领，本轮贡献         公会获得攻打资格",
        [21] = "无公会占领，本轮贡献         公会获得攻打资格",
        [22] = "战前准备，正式开战倒计时：",
        [23] = "战场准备时间已过,不可鼓舞",
        [24] = "银币鼓舞已达次数上限",
        [25] = "元宝鼓舞已达次数上限",
        [26] = "战场准备时间已过,不可参战或取消",
        [27] = "战场准备倒计时: ",
        [28] = "开战倒计时: ",
        [29] = "攻击: ",
        [30] = "防御: ",
        [31] = "连胜场次: ",
        [32] = "报名已开始，截止倒计时：",
        [33] = "报名已结束，开战倒计时：",
        [34] = "夺宝战入场，截止倒计时：",
        [35] = "夺宝战战斗中,结束倒计时：",
        [36] = "夺宝战报名时间：每周四早10点 到 周五晚24点",
        [37] = "没有战报",
        [38] = "请让公会会长或副会长前来报名参加",
        [39] = "您的公会已报满",
        [40] = "正在攻打中，请稍后",
        [41] = "没有公会参战",
        [42] = "没有公会报名",
        [43] = "夺宝战结束,领奖截止：",
        [44] = "下一场战斗开启，倒计时：",
    },

    guild_skill = {
        [1] = "学习",
        [2] = "升级",
        [3] = "满级",
        [4] = "未学习",
        [5] = "级公会开启",
        [6] = "级开启",
        [7] = "队伍",
        [8] = "当前贡献：",
        [9] = "当前公会等级：",
        [10] = "此技能已满级",
        [11] = "您的个人贡献不足，不可升级",
        [12] = "您的个人贡献不足，不可学习",
        [13] = "级公会",--(XXX)级公会
    },
    
    guild_boss = {
        [1] = "BOSS复活倒计时：",
        [2] = "今日公会伤害加成：",
        [3] = "挑 战",
        [4] = "元宝鼓舞",
        [5] = "鼓舞成功",
        [6] = "需要贵族等级",
        [7] = "可鼓舞次数：",
        [8] = "今日鼓舞次数已用完",
        [9] = "可挑战次数：",
        [10] = "公会BOSS已被击杀",
        [11] = "可挑战次数不足",
        [12] = "伤害排名",
        [13] = "排名奖励",
        [14] = "等级：",
        [15] = "获得个人贡献",
    },

    guild_boss_rule = {
        [1] = "1.公会等级大于等于2级，且入会时间大于24小时的公会成员可以挑战公会BOSS。",
        [2] = "2.贵族2以上的公会成员可以消耗元宝进行鼓舞，鼓舞提升全体公会成员对BOSS的伤害，每日0点重置鼓舞效果。",
        [3] = "3.玩家挑战公会BOSS会根据伤害获得相应的个人贡献，并获得随机奖励。击杀者将额外获得一次挑战次数。",
        [4] = "4.公会BOSS如果存活时间不足24小时，公会BOSS等级便会提升一级，BOSS等级越高奖励越丰厚。",
        [5] = "5.公会BOSS伤害排行榜每周一0点会重置，排名奖励以邮件形式发放。",
    },


    lead = {
        [0] = "将一项属性培养满后才可进阶",
        [1] = "已到达最高阶",
        [2] = "该属性已培养满",
        [3] = "没有足够的培养点",
        [4] = "贵族 1 以上才可购买",
        [5] = "今日购买次数已用完",
        [6] = "培养点使用完后才可购买",
        [7] = "(培养点已满)",
        [8] = "不可超过属性上限",
        [9] = "消耗道具不够",
        [10] = "消耗",
        [11] = "满阶无法消耗",
        [12] = "魔宫",
        [13] = "时装",
        [14] = "游戏厅",
        [15] = "翅膀",
        [16] = "飞升",
        [17] = "觉醒",
        [18] = "主角到%d级才能觉醒",
        [19] = "主角进阶到%s阶才能觉醒",
    },

    leadStageLevel = {
        [1] = "绿",
        [2] = "蓝",
        [3] = "蓝+1",
        [4] = "蓝+2",
        [5] = "紫",
        [6] = "紫+1",
        [7] = "紫+2",
        [8] = "紫+3",
        [9] = "紫+4",
        [10] = "紫+5",
        [11] = "橙",
        [12] = "橙+1",
        [13] = "橙+2",
        [14] = "橙+3",
        [15] = "橙+4",
        [16] = "橙+5",
        [17] = "橙+6",
        [18] = "橙+7",
        [19] = "橙+8",
        [20] = "橙(魔)",
        [21] = "红(魔)+1",
        [22] = "红(魔)+2",
        [23] = "红(魔)+3",
        [24] = "彩金(仙)+1",
        [25] = "彩金(仙)+2",
        [26] = "彩金(仙)+3",
    },

    mail = {
        [0] = "系 统",
        [1] = "战 斗",
        [2] = "玩 家",
        [3] = "领取",
        [4] = "批阅",
        [5] = "查看",
        [6] = "全部删除",
        [7] = "删 除",
        [8] = "领 取",
        [9] = "去复仇",
        [10] = "回 复",
        [11] = "留言成功",
        [12] = "发送成功",
        [13] = "发送失败",
        [14] = "奖励：",
    },

    main = {
        [0] = "欢迎进入神将道",
        [1] = "这里有最逗比的伙伴",
        [2] = "这里有最酷炫的技能",
        [3] = "这里有最欢乐的剧情",
        [4] = "12点开启挑战",
        [5] = "策划还没配我说的话呢！！！！！",
        [6] = "已被击杀！",
        [7] = "已经开始啦！",
        [8] = "21点开启挑战",
        [9] = "结束：",
        [10] = "已结束",
    },

    penglai = {
        [0] = "已领取今日奖励",
        [1] = "重置次数已用完",
        [2] = "提高贵族可以增加重置次数",
        [3] = "星星奖励未领取，确定要重置吗？",
        [4] = "可重置次数: ",
        [5] = "免费",
        [6] = "花费 "
    },

    rank = {
        [0] = "总战力",
        [1] = "等 级",
        [2] = "等级:",
        [3] = "总战力:",
        [4] = "翅 膀",
        [5] = "魔 罩",
        [6] = "充 值",
        [7] = "伙伴:",
        [8] = "公会:",
        [9] = "玩家:",
        [10] = "副 本",
        [11] = "伙 伴",
        [12] = "神 器",
        [13] = "神器:",
        [14] = "仙战力",
        [15] = "仙战力:",
    },

    rankext = {
        [0] = "总战力",
        [1] = "等 级",
        [2] = "伙伴总战斗力",
        [3] = "副本进度",
        [4] = "魔罩等级",
        [5] = "翅膀等级",
        [6] = "充值金额",
        [7] = "评 分",
        [8] = "仙战力",
    },

    rob = {
        [0] = "典籍挑战",
        [1] = "坐骑挑战",
        [2] = "材料挑战",
        [3] = "护符不足",
        [4] = "当前未受保护！！",
        [5] = "您已拥有该碎片，不能再挑战！",
        [6] = "合 成",
        [7] = "碎片不足！",
        [8] = "无可挑战的玩家",
        [9] = "挑战会使保护时间马上结束，是否继续？",
        [10] = "一键合成",
        [11] = "一键挑战",
    },

    shop_list = {
        [0] = "招 募",
        [1] = "道 具",
        [2] = "礼 包",
        [3] = "购 买",
        [4] = "今日购买个数已用完",
        [5] = "",
    },

    slotsInfo = {
        [0] = "命格",
        [1] = "装备",
        [2] = "请先上阵伙伴",
        [3] = "以上可使用一键强化",
        [4] = "不能一键强化",
        [5] = "请先上阵伙伴",
        [6] = "无装备可更换",
        [7] = "无命格可更换",
        [8] = "阵上无伙伴，无法进攻",
        [9] = "一键装备",
        [10] = "一键强化",
        [11] = "一键激活",
        [12] = "请先上阵新伙伴",
        [13] = "伙伴缘分效果",
        [14] = "小伙伴加成",
        [15] = "当前界面。",
        [16] = "未到达开启等级",
        [17] = "伙伴等级",
    },
    godStoneInfo = {
        [1] = "神石详情",
        [2] = "当前属性：",
        [3] = "强化等级：",
        [4] = "(属性未激活)",
        [5] = "下级属性：",
        [6] = "激活属性：",
        [7] = "已经强化到满级",
    },
    soul = {
        [0] = "猎 命",
        [1] = "命 格",
        [2] = "兑 换",
        [3] = "批量分解",
        [4] = "无命格可分解",
        [5] = "猎十次",
        [6] = "主角",
        [7] = "强 化",
        [8] = "兑 换",
        [9] = "元命不足",
        [10] = "本次免费",
        [11] = "已最大级",
        [12] = "已强化满",
        [13] = "洗 炼",
        [14] = "已强化到最高级",
        [15] = "该命格未装备",
        [16] = "未满足合成条件",
        [17] = "快速猎命",
        [18] = "勾选后快速猎命时自动分解",
        [19] = "猎十次",
        [20] = "猎百次",
        [21] = "猎千次",
    },

    soulResolve = {
        [0] = "绿色",
        [1] = "蓝色",
        [2] = "紫色",
        [3] = "橙色",
        [4] = "请选择需要分解的命格",
        [5] = "无命格可分解",
    },

    soulName = {
        [0] = "超凡入圣",
        [1] = "初窥门径",
        [2] = "登堂入室",
        [3] = "融会贯通",
        [4] = "天人合一",
        [5] = "出神入化",
    },

    sports = {
        [0] = "竞技",
        [1] = "前十",
        [2] = "兑 换",
        [3] = "查看",
        [4] = "挑战",
        [5] = "反击",
        [6] = "刷新",
        [7] = "领 取",
        [8] = "兑换",
        [9] = "需要消耗积分",
        [10] = "需要达到排名",
        [11] = "积分不足",
        [12] = "超出兑换次数限制",
        [13] = "未达到领取条件",
        [14] = "积分不足",
        [15] = "积分不足",
        [16] = "积分不足",
        [17] = "首胜",
        [18] = "今日次数已用完",
        [19] = "队伍等级不足",
        [20] = "需队伍等级到达",
        [21] = "快速挑战",
        [22] = "今日剩余:",
        [23] = "次",
        [24] = "级可兑换",
    },

    startactivity = {
        [0] = "每日福利",
        [1] = "战力突破",
        [2] = "等级突破",
        [3] = "半价抢购",
        [4] = "未到达购买天数",
        [5] = "当前折扣已变更，请重新购买",
        [6] = "原价: ",
        [7] = "不限量",
        [8] = "操作失败，请重新输入",
        [9] = "成功接受召回",
    },

    task = {
        [0] = "日常任务",
        [1] = "成 就",
        [2] = "全部领取",
        [3] = "无可领取的奖励",
        [4] = "未达成",
        [5] = "前 往",
        [6] = "完成可领取",
        [7] = "可能获得",
        [8] = "已完成",
        [9] = "一键领取",
        [10] = "今日奖励已领完",
    },

    treasureResolve = {
        [0] = "绿色",
        [1] = "蓝色",
        [2] = "紫色",
        [3] = "橙色",
        [4] = "请选择需要分解的宝物",
        [5] = "没有可自动添加的品质宝物,请手动添加",
    },

    worldboss = {
        [0] = "已经复活",
        [1] = "立即复活",
        [2] = "浴火重生",
        [3] = "退 出",
        [4] = "上次战斗龙王未被击杀！！",
        [5] = "青光妖龙",
        [6] = "紫宵魔龙",
        [7] = "当前boss已被杀死",
        [8] = "未进榜",
        [9] = "贵族",
        [10] = "或队伍等级",
        [11] = "级可自动战斗",

    },

    zhuxiantai = {
        [0] = "生命",
        [1] = "攻击",
        [2] = "防御",
        [3] = "速度",
        [4] = "暴击",
        [5] = "闪避",
        [6] = "格挡",
        [7] = "请先闯过上一关！",
        [8] = "可重置:",
        [9] = "重 置",
        [10] = "一键3关",
        [11] = "战斗力超过3关里最高值才可一键3关！",
        [12] = "商 品",
        [13] = "伙 伴",
        [14] = "装 备",
        [15] = "今日购买次数已到上限，请明日再来!",
        [16] = "威望不足，快挑战诛仙台获得威望吧！",
        [17] = "挑 战",
        [18] = "当前可用星数不足",
        [19] = "选择加成",
        [20] = "继续挑战",
        [21] = "奖励预览",
        [22] = "未上榜",
        [24] = "请选择加成",
        [25] = "请等待扫荡完成",
        [26] = "本次挑战已通关最高层",
        [27] = "本层挑战失败次数过多，无法继续挑战",
        [28] = "扫 荡",
        [29] = "今日重置次数已用完",
        [30] = "请等待扫荡完成",
        [31] = "历史最高层大于5层才可扫荡",
        [32] = "请等待扫荡完成",
        [33] = "本次挑战已通关最高层",
        [34] = "已到达本次可扫荡的最高层",
        [35] = "现在并无扫荡，无法立即完成",
        [36] = "扫荡中...",
        [37] = "扫荡1次",
        [38] = "推荐战斗力:",
        [39] = "层",
        [40] = "次",
        [41] = "战胜全部目标",
        [42] = "累计星数不够",
        [43] = "以上,或者队伍等级",
        [44] = "以上可使用扫荡功能",
        [45] = "贵族",
    },

    loginScene = {
        [0] = "注册账号",
        [1] = "更新配置文件......",
        [2] = "加载配置文件......",
        [3] = "加载数据",
        [4] = "同步资源......",
        [5] = "加载资源......",
        [6] = "用户名不存在",
        [7] = "密码错误",
        [8] = "用户名已存在",
        [9] = "注册新账号",
        [10] = "旧账号登录",
        [11] = "邮箱格式错误",
        [12] = "密码不能为空",
        [13] = "最近登录",
        [14] = "所有服务器",
        [15] = "请注册新账号或用旧账号登陆",
        [16] = "当前区正在维护，请选择其他区游戏",
        [17] = "帐号登陆",
        [18] = "其他",
        [19] = "您的账号有可疑操作，暂时被系统停封",
        [20] = "解压中......",  
    },
    
    battleScene = {
        [1] = "前 往",
        [2] = "重播",
        [3] = "确定",
        [4] = "晋级8强！！",
        [5] = "晋级4强！！",
        [6] = "晋级决赛！！",
        [7] = "晋级冠军！！",
        [8] = "本关三星通过后可跳过战斗",
        [9] = "引导过程中无法加速",
        [10] = "级可开启战斗3倍加速",
        [11] = "引导过程中无法加速或跳过",
        [12] = "战斗未开启",
        [13] = "武道会战斗中，不能跳过",
        [14] = "回合: ",
        [15] = "造成伤害: ",
        [16] = "伤害越高奖励越多",
        [17] = "造成的伤害越高，获得的奖励就越丰厚",
        [18] = "不可跳过",
        [19] = "本关副本第一次挑战，不可跳过",
        [20] = "需本关三星通过后或通关第三章副本",
        [21] = "隐藏神器",
        [22] = "伤害统计",
        [23] = "我方",
        [24] = "敌方",
        [25] = "返回",
        [26] = "第%d回合可以跳过战斗",
        [27] = "隐藏魔罩",
        [28] = "通用技能和合体技",
    },

    popups = {
        quxiao = "取 消",
        guanbi= "关 闭",
        queding = "确 定",
        queren = "确认",
        zhandou = "战 斗",
        ch_num = "请选择数量",
        buy_num = "购买个数已达上限",
        buy_time = "购买次数已达上限",
        put_wd= "点击输入",
        et_wd = "请输入兑换码",
        fanhui = "返 回",
        xiazu = "下 注",
        xiazucishu = "下注次数不足",
        xianqu = "仙琼酿不足",
        zhibo = "直 播",
        chongbo = "重 播",
        gongji = "攻击全体目标",
        putong  = "普通",
        jingying = "精英",
        dlpp = "掉落配置出错！",
        equipdetail = "装备详情",
        chosName = "请选择形象",
        enterName = "请输入昵称",
        sanbei = "三倍",
        friendID = "点击输入要查找好友的ID",
        enId = "请输入ID",
        msId = "ID无效",
        notPer = "查无此人，请重新输入",
        enterNum = "点击输入内容，最多发送20字",
        fasong = "发 送",
        fayan = "请输入发言",
        addfr = "去加好友",
        zuzheng = "该助阵伙伴与上阵伙伴重复",
        perout = "今日助战次数已用尽",
        enterGuid = "点击输入公会名字",
        guidName = "输入公会名字",
        putaccount = "点击输入公告",
        entAccount = "请输入公告",
        enterInvite = "点击输入邀请码",
        otherInvite = "请输入对方的邀请码",
        touchPut = "点击输入内容",
        youBi = "您的       变成了：",
        against = "迎 战",
        define = "投 降",
        enterGame = "进入游戏",
        lookPriv = "查看特权",
        yuan = "0元",
        change = "充 值",
        changemoney = "（充值268元送             ）",
        change_qudao = "未接入充值渠道",
        hMonth = "(豪华月卡)",
        month = "(月卡)",
        shiyong = "使用",
        zaizhan = "再 战",
        shangxz = "尚未选择",
        querencz = "是否确认操作？",
        zujue = "主角",
        huoban = "伙伴",
        mingge = "命格",
        equipfenjie = "已经装备的物品无法被分解",
        minggeqianghua = "命格强化",
        qianghua = "强 化",
        qianghuadj = "强化道具不足",
        tilishangxian = "体力上限",
        shaqishangxian = "精力上限",
        huobanshangxian = "伙伴装备等级上限",
        zhengrong = "阵 容",
        shurumingzi = "点击输入新名字名字最多6字",
        shuruxinni = "请输入新昵称",
        shuruliuyan = "点击输入留言，最多发送20字",
        shuruly = "请输入留言",
        skillSelf = "主动技能提升: ",
        skill2Self = "掌握新的被动技能:",
        handSkill = "掌握主动技能: ",
        zdskill =  "主动技能:",
        bdskill = "被动技能:",
        wujiacheng = "无加成",
        yeswifi = "您现在使用的是WIFI网络",
        nowifi = "您现在不是WIFI环境",
        noweb = "你现在网络已经断开，请链接网络",
        weidadao = "未到达",
        shangcz = "尚未充值",
        yilingqu = "今日已领取",
        weishangbang = "未上榜",
        jiangli = "奖励预览",
        region0 = {
        ["0"] = "魔王",
        ["1"] = "天庭",
        ["2"] = "佛界",
        ["3"] = "魔",
        ["4"] = "地府",
        ["5"] = "妖",
        ["6"] = "群雄",
        ["7"] = "魏国",
        ["8"] = "蜀国",
        ["9"] = "吴国",
        ["10"] = "魔王",
        ["11"] = "所有阵营",
        ["12"] = "魏蜀吴、群雄",
        ["13"] = "阐教",
        ["14"] = "截教",
        },
        tupo = "突破",
        peiyang = "培养",
        pslvbz = "伙伴等级不足",
        hplvbz = "伙伴魂魄不足",
        djbz = "道具不足",
        coinbz = "银币不足",
        dddj = "已达最高阶",
        ege = "土鸡蛋", 
        shj = "三黄鸡", 
        jhj = "叫花鸡",
        gongxianjhj = "以上可贡献叫花鸡",
        plcontext = "请输入内容",
        gonggao = "编辑公告",
        xuanyan = "编辑宣言",
        coin2bz = "银币不足",
        goldbz = "元宝不足！",
        vipbz = "贵族等级不足！",
        googshave = "已获得该物品，无法挑战",
        activation = "可激活缘分",
        noAwardget = "没有可领取的奖励",
        tpdbz = "突破丹不足",
        share = "分 享",
        shared = "已分享",
        illconditioned = "条件不满足！",
        vipInsufficientForRecharge = "贵族等级不足，是否去充值?",
        insufficientNumberOfChallenges = "挑战次数不足",
        resetCountLess = "重置次数不足",
        refresh = "零点数据刷新！",
        timeException = "系统时间不准，可能影响游戏体验，请校正",
        zongzhanbo = "总战报",
        jixu = "继续",
        noshare = "没有接入分享功能",
        jxlvbz = "觉醒等级不足",
        boxselect = "请选择一种获得物品",
        boxopenmax = "达到可开启上限",
        endnum = "改名卡剩余%s张",
        robberyID = "点击输入要查找对手的ID",
        openTimeMax = "已达到最大开启次数",
        openTimeMin = "已达到最小开启次数",
    },

    champion = {
        box = "宝藏",
        boxfree = "本关宝藏有可免费领取的奖励，请先领取",
        boxcannot = "击败相邻据点后可开启宝藏",
        pointcannot = "击败相邻据点后可挑战",
        boxall = "本关宝藏已全部开启",
        boxall1 = "已全部开启",
        resetmsg = "重新开始将清除关卡进度，恢复挑战次数。\n确定要重新开始吗？",
        minLevel = "贵族等级达到%s或者等级达到%s开启",
        goldless = "元宝不足，无法一键完成",
        res1 = "本次挑战战斗%d次，获胜%d次，失败%d次",
        res2 = "开启宝箱%d个，共%d次",
        res3 = "开启宝箱%d个",
        res4 = "次数不足",
    },

    equipInfo = {
        [0] = "装备详情",
        [1] = "分 解",
        [2] = "已经装备的物品无法被分解",
        [3] = "更 换",
        [4] = "精 炼",
        [5] = "强 化",
        [6] = "宝物详情",
        [7] = "升 华",
        [8] = "装备强化",
        [9] = "已达到强化等级上限",
        [10] = "银币不足",
        [11] = "装备类型错误",
        [12] = "宝物升华",
        [13] = "已达到最高阶",
        [14] = "材料不够",
        [15] = "宝物精炼",
        [16] = "装备精炼",
        [17] = "已到最高级",
        [18] = "材料已消耗完",
        [19] = "请选择消耗材料",
        [20] =  "装备相同品质的典籍可激活套装属性",
        [21] = "装备相同品质的坐骑可激活套装属性",
        [22] = " (宝物+",
        [23] = "解锁)",
        [24] = "宝物属性",
        [25] = "装备属性",
        [26] = "精炼等级",
        [27] = "属性已达当前上限，强化装备可提高上限",
        [28] = "装备洗炼",
    },
    generalInfo ={
        [0] = "角色详情",
        [1] = "升 级",
        [2] = "培 养",
        [3] = "突 破",
        [4] = "更 换",
        [5] = "伙伴突破",
        [6] = "属性",
        [7] = "魂魄数量不够",
        [8] = "已突破到最高次数",
        [9] = "伙伴传功",
        [10] = "请选择伙伴",
        [11] = "伙伴培养",
        [12] = "取 消",
        [13] = "确 定",
        [14] = "培养一次",
        [15] = "培养十次",
        [16] = "技能详情",
        [17] = "进 修",
        [18] = "低",
        [19] = "高",
        [20] = "中",
        [21] = "技能修炼",
        [22] = "伤害",
        [23] = "已达到等级上限",
        [24] = ":和",
        [25] = ":装备",
        [26] =  "、",
        [27] = "觉 醒", 
        [28] = "当前等级", 
        [29] = "触发伙伴",
        [30] = "需要觉醒到",
        [31] = "资质:",
        [32] = "阵营",
        [33] = "未激活",
        [34] = "基础属性:",
        [35] = "强化属性:",
        [36] = "攻击:",
        [37] = "防御:",
        [38] = "血量: ",
        [39] = "需要觉醒到",
        [40] = "自动培养",
    },

    penglaiReward = {
        [0] = "个人本周仙元：",
        [1] = "本周活动结束后，仙元保存至下周活动开始",
        [2] = "全服本周仙元：",
        [3] = "本周活动结束后，仙元保存至下周活动开始",
        [4] = "个人本周仙元：",
        [5] = "排行奖励，每周一通过邮件发送！",
        [6] = "成就",
        [7] = "全服",
        [8] = "排行",
        [9] = "奖励: ",
        [10] = "领 取",
        [11] = "未达成",
        [12] = "未完成",
        [13] = "奖励预览",
        [14] = "当日事件未全部探索，每日仙元奖励会在次日通过邮件发送",
        [15] = "每日",
    },

    exchange = {
        [0] = "下次刷新时间:",
        [1] = "兑换所需材料不足",
        [2] = "当前没有兑换次数！",
        [3] = "兑 换",
        [4] = "免费刷新",
        [5] = "刷 新",
        [6] = "免费刷新次数:",
    },

    recruit = {
        [0] = "招募预览",
        [1] = "招一次",
        [2] = "没有足够的招募令",
        [3] = "招十次",
        [4] = "再招十次",
        [5] = "确 定",
        [6] = "再招一次",
        [7] = "查 看",
        [8] = "更换奖励",
        [9] = "确认领取",
        [10] = "是否领取本次招募奖励？",
        [11] = "返回后本次抽奖结果将保存",
        [12] = "当前无可更换的奖励",
        [13] = "当前有未领取的奖励，无法招募",
        [14] = "元宝数量不足，无法更换奖励"
    },

    robselect = {
        [0] = "概率极高",
        [1] = "概率高",
        [2] = "概率较高",
        [3] = "概率中",
        [4] = "概率低",
        [5] = "换对手",
        [6] = "挑 战",
        [7] = "战十次",
    },

    -- runGamePrompt
    ui = {
        [0] = "输入含有敏感词，请重新输入",
        [1] = "输入过多，多余内容已舍去",
        [2] = "点击输入",
        [3] = "主角",
        [4] = "1分钟",
        [5] = "银币",
        [6] = "元宝",
        [7] = "体力",
        [8] = "精力",
        [9] = "补天石",
        [10] = "威望",
        [11] = "积分",
        [12] = "元命",
        [13] = "双倍",
        [14] = "暂未开放",
        [15] = "魔王大人，当前没有道具",
        [16] = "请去下列玩法获取吧！！",
        [17] = "去购买",
        [18] = "魔王大人，当前没有装备",
        [19] = "去获得",
        [20] = "魔王大人，当前没有宝物",
        [21] = "魔王大人，当前没有武器",
        [22] = "魔王大人，当前没有防具",
        [23] = "魔王大人，当前没有饰品",
        [24] = "魔王大人，当前没有头盔",
        [25] = "魔王大人，当前没有典籍",
        [26] = "魔王大人，当前没有坐骑",
        [27] = "魔王大人，当前没有装备碎片",
        [28] = "魔王大人，当前没有宝物碎片",
        [29] = "魔王大人，当前没有伙伴",
        [30] = "去招募",
        [31] = "魔王大人，当前没有伙伴魂魄",
        [32] = "魔王大人，当前没有命格",
        [33] = "去猎命",
        [34] = "掉落配置出错！",
        [35] = "魔王大人，当前没有材料碎片",
        [36] = "去夺宝",
        [37] = "1天以上",
        [38] = "刚刚",
        [39] = "竞技场",
        [40] = "贵族经验",
        [41] = "碎片",
        [42] = "阶",
        [43] = "魔王大人，当前没有魔符",
        [44] = "马上就要刷新了，请稍等一会儿",
        [45] = "购买人数未到达",
        [46] = "奖励已全部领完",
        [47] = "今日已领取",
        [48] = "今日已签到",
        [49] = "本月签到已完成",
        [50] = "未到达开启条件",
        [51] = "未到活动开启时间",
        [52] = "明天就能打哦~",
        [53] = "今日挑战次数已用完",
        [54] = "已经报名",
        [55] = "非报名时间",
        [56] = "积分不足",
        [57] = "所有开启技能已达到最高等级，请重置后再学习",
        [58] = "技能点数不足，请提升队伍等级",
        [59] = "没有技能可以重置",
        [60] = "技能全部锁定，无法重置",
        [61] = "魔宠等级已达到上限，无法再进阶！",
        [62] = "进阶材料不足",
        [63] = "技能锁定达到最大数",
        [64] = "该装备无法洗炼",
        [65] = "属性已达当前上限，强化装备可提高上限",
        [66] = "装备已达到最高阶",
        [67] = "还没选择装备",
        [68] = "条件未满足",
        [69] = "魂魄",
        [70] = "今日刷新次数已用完",
        [71] = "今日可刷新次数：",
        [72] = "魔宠等級已达上限",
        [73] = "数字不合法",
        [74] = "仙元",
        [75] = "魔王大人，当前没有天机令",
        [76] = "魔王大人，当前没有天机令碎片",
        [77] = "去获取",
        [78] = "实力碾压、秒杀敌人",
    },


    --显示比较多得字符串
    moreCommon ={
        [1] = "暂未开放",
        [2] = "今日已领取",
        [3] = "已过期",
        [4] = "未达成",
        [5] = "已领取",
        [6] = "领 取",
        [7] = "未完成",
        [8] = "级别未到达",
        [9] = "尚未购买成长计划",
        [10] = "已购买",
        [11] = "未购买",
        [12] = "接受他人邀请",
        [13] = "接受",
        [14] = "次数已用完",
        [15] = "活动已结束",
        [16] = "补签",
        [17] = "重 播",
        [18] = "去获取",
        [19] = "今日可战胜次数: ",
        [20] = "套装",
        [21] = "物品",
        [22] = "成长计划",
        [23] = "全民福利",
        [24] = "星辰",
        [25] = "已满",
        [26] = "尽请期待",
        [27] = "成长计划",
        [28] = "等级不足",
        wu = "无",
        tongyi = "同 意",
        jujue = "忽 略",
        yijujue = "已拒绝",
        yishenqing = "已申请",
        yitongguo = "已通过",
        shenqing = "申 请",
        beijujue = "被拒绝",
        fanhui = "返 回",
        queding = "确定",
        guomai = "购 买",
        yijieshu = "已结束",
        gongneng = "功能未开启",
        weitongguan = "未通关",
        gongneng2 = "功能未开启,敬请期待！",
        weikaiqi = "未开启",
        weijihuo = "未激活",
        copynotopen = "关卡未开启",

    },

    -- 灭神殿商店 （以后是否将所有的商店整合到一起？？？）
    TempleShop = {
        [1] = "商 品",
        [2] = "奖 励",
        [3] = "星数达到",
        [4] = "星数未达条件",
        [5] = "已兑换过",
    },

    island = {
        [1] = "是否10花费元宝传送",
        [2] = "开始",
        [3] = "停止",
        [4] = "想要积分吗？快挑战我把！",
        [5] = "不要打我，我不爆东西的！",
        [6] = "不要挑战我，否则你会死的很难看！",
        [7] ="活动结束",
        [8] = "活动时间: ",
        [9] = "一键全翻",
        [10] = "花费",
        [11] = "一键通关",
        [12] = "战斗失败",
        [13] = "战斗胜利",
        [14] = "条件不足,贵族达到%s或等级达到%s",
    },
    --魔宠界面使用
    devil = {
        --背包上面
        [1] = "魔宠",
        [2] = "碎片",
        --技能预览
        [3] = "被动技能预览",
        [4] = "确定",
        [5] = "激活",
        [6] = "锁定达到最大数",
        [7] = "上阵所有伙伴",
        [8] = "更换魔宠",
        [9] = "进阶",
        [10] = "魔宠详情",
        [11] = "进阶预览",
    },

    --法宝界面使用
    magic = {
        [1] = "取消",
        [2] = "替换",
        [3] = "锻造 X1",
        [4] = "锻造 X5",
        [5] = "锻造 X10",
        [6] = "请先确认是否强化！",
        [7] = "请先解锁",
        [8] = "锻造 X50",
    },
    mazeReward = {
        [1] = "奖 励",
        [2] = "已经购买",
        [3] = "每天可以获得2次免费次数，之后可用元宝刷新",
        [4] = "当前进度: ",
        [5] = "剩余重置次数: ",
        [6] = "全体伙伴",
    },
    share = {
        [1] = "分享成功",
    },
    cornucopia = {
        [1] = "今日聚宝次数已用完",
        [2] = "已领取",
        [3] = "奖励预览",
        [4] = "倍暴击",
    },
    multipleRebate = {
        [1] = "基金",
        [2] = "元",
        [3] = "倍",
        [4] = "倍返利",
        [5] = "月卡,高级月卡用户单笔充值             以上立即获得等价元宝，并在活动期间可累计领取月计划中价值          的资源奖励！",
        [6] = "奖励预览",
        [7] = "去购买",
        [8] = "去激活",
        [9] = "高级月卡：",
        [10] = "终身卡：",
        [11] = "同时激活月卡及高级月卡可购买",
        [12] = "激活规则",
        [13] = "未激活",
        [14] = "已激活",
        [15] = "开启奖励",
        [16] = "后停止购买",
    },

    title = {
        [1] = "物品兑换限制",
    },
    cdkey = {
        [1] = "请输入有效的兑换码",
        [2] = "输入的兑换码无效",
    },
    -- 好感度
    favoritegeneral = {
        [1] = "好感度",
        [2] = "伙伴已消失，不能赠送礼物了。",
        [3] = "他已经对你足够死心塌地了！",
        [4] = "获得好感度",
        [5] = "礼物数量为0，无法赠送",
        [6] = " 好感度", --要有空格
        [7] = "未达成",
        [8] = "成就未达成，不能领取",
        [22] = "互 换",
        [23] = "请先选择伙伴",
        [24] = "选择转移对象",
        [25] = "总好感度",
        [26] = "全队加成",
        [27] = "需要总好感度",
        [28] = "已达成",
        [29] = "下级",
        [30] = "已上阵",
        [31] = "助阵中",
        [32] = "所选伙伴好感度都为0，无法互换",
        [33] = "不能更换当前选定伙伴",
        [34] = "好感度已满",
    },

    -- 魔符
    mofulist = {
        [1] = "魔 符",
        [2] = "镶嵌于：",
        [3] = "强化等级已达上限",
        [4] = "精炼等级已达上限",
        [5] = "请选择消耗物品",
        [6] = "请选择魔符",
        [7] = "已满级",
        [8] = "没有满足条件的魔符",
        [9] = "不在阵魔符不能被升级",
        [10] = "需要外围5个魔符到达",
        [11] = "级，才可升级",
        [12] = "经验值：",
    },

    buypower = {
        propretyName1 = "挑战\"3\"次",
        propretyName2 = "体力\"",
        propretyName3 = "精力\"",
        propretyName4 = "\"",
        propretyName5 = "挑战\"1\"次",
        propretyName6 = "重置\"1\"次",
        propretyTitle1 = "购买",
        propretyTitle2 = "购买体力",
        propretyTitle3 = "购买精力",
        [1] = "达到今日购买次数上限",
        [2] = "没有精力丹可以使用",
        [3] = "没有体力丹可以使用",
    },
    kingman = {
        [1] = "BOSS详情",
        [2] =  "技能详情",
        [3] = "挑战次数不足",
        [4] = "等级不足",
    },
    encounter2 = {
        [1] = "还没遇到奇遇",
    },
    confirm = {
        [1] = "银币不足，是否去购买?",
        [2] = "元宝不足，是否去充值?"
    },
    recharge = {
        [1] = "充值失败或响应超时，请重新登录",
        [2] = "充值可能存在延迟，请稍等",
        [3] = "未接入第三方渠道",
        [4] = "充值可能存在延迟，请稍等",
        [5] = "充值失败或响应超时",
        [6] = "充值失败",
        [7] = "购买成功",
        [8] = "首充奖励已领取",     
        [9] = "(终身卡)",
        [10] = "(月卡)",
        [11] = "(高级月卡)",
        [12] = "充值取消或响应超时",
        [13] = "充值金额未达到要求",
        [14] = "当前已累计充值:"
    },

    -- 乾坤炉
    qiankunlu = {
        [1] = "炼化",
        [2] = "重生",
        [3] = "化魂",
        [4] = "重生返还初始宝物及养成消耗的大量资源",
        [5] = "重生返还初始装备及养成消耗的大量资源",
        [6] = "重生返还初始伙伴及养成消耗的大量资源",
        [7] = "请放入需要炼化的魂魄或装备",
        [8] = "没有符合条件的魂魄",
        [9] = "没有符合条件的装备",
        [10] = "没有符合条件的宝物",
        [11] = "请放入需要重生的伙伴、装备或宝物",
        [12] = "没有符合条件的伙伴",
        [13] = "请放入需要化魂的伙伴",
        [14] = "时装",
        [15] = "重生返还初始时装及养成消耗的大量资源",
    },

    --
    propusebynum = {
        [1] = "达到可使用上限",
        [2] = "一次最多使用100个",
        [3] = "确定要炼化吗？",
        [4] = "您要重生的是",
        [5] = "确定要重生吗？",
        [6] = "您要化魂的是",
        [7] = "确定要化魂吗？",
        [8] = "魂魄 ",
        [9] = "当前可使用：",
    },

    qiankunluPopup = {
        [1] = "您要炼化的是",
        [2] = "可用于同名伙伴的突破，确定要炼化吗？",
        [3] = "（伙伴重生后，可以化魂！）",
        [4] = "（\"王的男人\"\"天庭银座\"已使用！）",
        [5] = "王的男人和天庭银座已使用的伙伴无法化魂！",
        [6] = "重生后可以化魂",
        [7] = "确定要化魂吗？",
        [8] = "魂魄",
        [9] = "橙色以上品质",
    },

    fnt = {

    },
    passkill = {
        [1] = "已挑战胜利，请换个对手",
        [2] = "暂未开启，敬请期待",
        [3] = "正在结算奖励，请稍后",
        [4] = "结算奖励倒计时：",
        [5] = "挑战结束倒计时：",

    },

    equipstage = {
        [1] = "进化到下一阶级，需要战队等级达到",
        [2] = "级",
        [3] = "进阶材料不足",
        [4] = "装备已达到最高阶",
        [5] = "还没选择装备",
        [6] = "装备星级等级需要达到",
        [7] = "级,才可进阶",
        [8] = "装备强化等级需要达到",
        [9] = "装备达到",
        [10] = "星，且强化等级不小于",
        [11] = "级，才可继续进阶",
        [12] = "物品",
        [13] = "",   

    },
    dumpling = {
        [1] = "粽子已用完",
    },
    lunpan = {
        [1] = "获得积分：",
        [2] = "积分不足，不能兑换",
        [3] = "今日抽奖次数已满",
        [4] = "抽奖次数已满",
        [5] = "超出本档抽奖次数上限",
        [6] = "超出本档购买次数上限",
    },
    dragonboat = {
        [1] = "%s号龙舟获得胜利！",
        [2] = "彩球数量不足",
        [3] = "距押注开始：",
        [4] = "距比赛开始：",
        [5] = "距比赛结束：",
        [6] = "距活动结束：",
    },
    limitex = {
        [1] = "可兑换%s次",
        [2] = "刷 新",
        [3] = "兑 换",
        [4] = "兑换需要队伍达到%s级",
        [5] = "兑换需要达到贵族%s",
        [6] = "活动截止时间：%s",
        [7] = "  兑换之前要集齐相应的物品，\n  每天%s点、%s点会自动更新商品",
        [8] = "限时兑换"
    },
    equipUp = {
        [1] = "强 化",
        [2] = "洗 炼",
        [3] = "升 星",
        [4] = "装备升星已达到最高等级",
        [5] = "升星材料不足",
        [6] = "属性提升：",
        [7] = "消耗银币：",
        [8] = "基础属性：",
        [9] = "当前星级",
        [10] = "下个星级",
        [11] = "升星材料",
        [12] = "星级上限：",
        [13] = "该品质的装备没有升星资格",
        [14] = "注 灵",
        [15] = "进 阶",
        [16] = "进阶消耗",
        [17] = "进阶属性",
        [18] = "请先选择装备",
        [19] = "该装备无法进阶",
        [20] = "装备强化等级越高，可洗炼属性上限越高",
        [21] = "当前属性",
        [22] = "下级属性",
        [23] = "蓝色以上装备可洗炼",
        [24] = "紫色以上装备才可升星",
        [25] = "需要强化等级：",
    },
    wudaohui = {
        [1] = "仙豆不足",
        [2] = "彩球数量不足",
        [3] = "待开启:",
        [4] = "进行中:",
        [5] = "待关闭:",
        [6] = "破军",
        [7] = "贪狼",
        [8] = "开始匹配",
        [9] = "没有匹配次数，不可挑战",
        [10] = "不在活动时间内，不可匹配",
        [11] = "匹配中...",
        [12] = "领取奖励，请重新匹配战斗",
        [13] = "已经没有匹配次数，不可挑战",
        [14] = "战斗胜利,获得仙豆数:",  
        [15] = "您的队伍战胜了",--您的队伍战胜了李克强的队伍，当前场次第3场
        [16] = "的队伍，当前场次第",
        [17] = "场",
        [18] = "连胜!",   -- 连胜!您的队伍战胜了习大大的队伍，获得3连胜奖，当前场次第3场
        [19] = "您的队伍战胜了",
        [20] = "的队伍，获得",
        [21] = "连胜奖",
        [22] = "，当前场次第",
        [23] = "场",
        [24] = "连胜！", --连胜！您的队伍战胜了牛魔王的队伍，获得2连胜奖，并将对方的4连胜终结，当前场次第3场
        [25] = "您的队伍战胜了",
        [26] = "的队伍，获得",
        [27] = "连胜奖",
        [28] = "，并将对方的",
        [29] = "连胜终结",
        [30] = "，当前场次第",
        [31] = "场",
        [32] = "您的队伍输给了", --您的队伍输给了习大大的队伍，当前场次第1场
        [33] = "的队伍，当前场次第",
        [34] = "场",
        [35] = "连胜终止！", --连胜终止！您的连胜被习大大的队伍终止了，当前场次第4场
        [36] = "您的连胜被",
        [37] = "的队伍终止了，当前场次第",
        [38] = "场",
        [39] = "您的队伍战胜了", --您的队伍战胜了李木子的队伍，并将对方的3连胜终结，当前场次第1场
        [40] = "的队伍，并将对方的",
        [41] = "连胜终结",
        [42] = "，当前场次第",
        [43] = "场",
        [44] = "活动已经结束！",
        [45] = "榜外",
        [46] = "武道会匹配，已取消",
        [47] = "无段位",
        [48] = "正在匹配...",
        [49] = "匹配成功...",
        [50] = "消耗仙豆:",
        [51] = "武道会匹配，已取消",
        [52] = "刷新",
        [53] = "不同等级段奖池内道具不同",
    },
    goddownshop = {
        [1] = "当前拥有好感度：",
        [2] = "可兑换",
        [3] = "次",
        [4] = "好感度：",
        [5] = "兑 换",
        [6] = "好感度不足",
        [7] = "兑换次数已用完",
        [8] = "八戒美梦兑换",
        [9] = "活动截止时间：",
        [10] = "跨服美梦兑换",
    },
    goddownrank = {
        [1] = "排名奖励",
        [2] = "好感排名",
        [3] = "八戒美梦",
        [4] = "活动截止时间",
        [5] = "八戒美梦排行榜",
        [6] = "总好感度需要达到",
        [7] = "才能进入排行榜",
        [8] = "排名",
        [9] = "总好感度",
        [10] = "角色名称",
        [11] = "奖励",
        [12] = "未上榜",
        [13] = "年",
        [14] = "月",
        [15] = "日",
        [16] = "开始结算奖励",
        [17] = "时",
        [18] = "分",
        [19] = "跨服美梦",
        [20] = "跨服美梦排行榜",
    },

    slotspirit = {
        [1] = "该阵法使用中",
    },

    doublereward = {
        [1] = "(双倍掉落)"

    },
    activityeveryday = {
        [1] = "前 往",
        [2] = "每日0点更新",
        [3] = "周",
        [4] = "半价",
        [5] = "双倍",
        [6] = "福利未开启",
        [7] = "(五折优惠)",
    },
    safemaskshop = {
        [1] = "魔罩商店",
        [2] = "每天0点重置购买次数",
        [3] = "今日剩余:",
        [4] = "次",
        [5] = "已经没有购买次数",
        [6] = "购 买",
        [7] = " ",
        [8] = "去阵容",
    },

    auction = {
        [1] = "本服拍卖",
        [2] = "跨服拍卖",
        [3] = "我的竞拍",
        [4] = "竞价成功",
        [5] = "竞拍价格应高于当前竞价",
        [6] = "竞拍价格应低于一口价",
        [7] = "下轮竞拍时间：",
        [8] = "本轮竞拍已结束",
        [9] = "本轮竞拍开始倒计时：",
        [10] = "本轮竞拍结束倒计时：",
        [11] = "本轮竞拍已结束",
        [12] = "本轮竞拍未开始",
        [13] = "本周",
        [14] = "下周",
        [15] = "本轮竞拍分红结算倒计时：",
        [16] = "当前竞拍您已经是最高价",
    },

    cangjingge = {
        [1] = "品质属性",
        [2] = "品质属性：无",
        [3] = "升 级",
        [4] = "建 造",
        [5] = "产出",
        [6] = "级",
        [7] = "小时",
        [8] = "存储上限",
        [9] = "所需材料",
        [10] = "材料不足",
        [11] = "获取品质",
        [12] = "的藏经阁",
        [13] = "可接受",
        [14] = "已接受",
        [15] = "可完成",
        [16] = "已完成",
        [17] = "任务难度：",
        [18] = "任务内容：",
        [19] = "任务奖励：",
        [20] = "前往",
        [21] = "立即完成",
        [22] = "接 受",
        [23] = "完 成",
        [24] = "任务未完成",
        [25] = "任务已完成",
        [26] = "今日可完成：",
        [27] = "今日可完成任务次数已用完",
        [28] = "全部刷新",
        [29] = "额外任务奖励",
        [30] = "额外任务次数",
        [31] = "击杀奖励：",
        [32] = "概率获得：",
        [33] = "挑 战",
        [34] = "今日可协助次数：",
        [35] = "可协助次数不足",
        [36] = "可兑换次数：",
        [37] = "兑换次数不足",
        [38] = "基础建筑",
        [39] = "功能建筑",
        [40] = "未建造",
        [41] = "品质：",
        [42] = "普通",
        [43] = "精致",
        [44] = "史诗",
        [45] = "当前品质",
        [46] = "这个人太懒了，没有编辑公告",
        [47] = "剩余时间：",
        [48] = "提高刷新的任务品质",
        [49] = "去藏经阁",
        [50] = "取 消",
        [51] = "下次产出时间：",
    },

    cangjinggequality = {
        [1] = "普通",
        [2] = "精致",
        [3] = "史诗",
        [4] = "太古",
        [5] = "洪荒"
    },

    totalrecharge = {
        [1] = "充值福利",
        [2] = "充值兑换",
        [3] = "累计奖励",
        [4] = "领 取",
        [5] = "已领取",
        [6] = "充 值",
        [7] = "兑 换",
        [8] = "已兑换",
        [9] = "充值后可兑换",
        [10] = "累计充值",
        [11] = "活动期间，每日只需充值\n元以上，即可获得稀有豪华大礼！",

    },

    rebate = {
        [1] = "充值金额：",
        [2] = "消费元宝：",
        [3] = "活动剩余时间：",
        [4] = "可获得返利：",
        [5] = "累计充值",
        [6] = "累计消费",
        [7] = "元",
        [8] = "元宝",
    },

    daoguanshouwei = {
        [1] = "本期活动：",
        [2] = "活动结束时，馆主与道馆成员将会获得专属奖励",
        [3] = "进入道馆战力需求",
        [4] = "进入道馆",
        [5] = "道馆徽章: ",
        [6] = "活动结束时道馆馆长可获得：",
        [7] = "活动结束时道馆成员可获得：",
        [8] = "战 报",
        [9] = "挑 战",
        [10] = "击杀可获得本道馆徽章",
        [11] = "点击头像挑战道馆成员,同公会可为馆长进行血量加成",
        [12] = "剩余挑战次数: ",
        [13] = "挑战恢复时间：",
        [14] = "道馆守卫徽章奖励",
        [15] = "集齐道馆徽章",
        [16] = "战力:",
        [17] = "确 定",
        [18] = "战力不符,无法进入",
        [19] = "已经是馆长了，不能挑战",
        [20] = "已经是馆员了，不能挑战",
        [21] = "未挑战守护兽，不能挑战馆员",
        [22] = "道馆",
        [23] = "待开启:",
        [24] = "进行中:",
        [25] = "待关闭:",
        [26] = "活动结束",
        [27] = "挑战守护兽",
        [28] = "守护兽:",
        [29] = "馆长:",
        [30] = "挑战次数不足",
        [31] = "已领取",
        [32] = "请先获得任意道馆徽章",
        [33] = "挑战失败，请再接再厉",
        [34] = "当前未获得全部徽章",
        [35] = "挑战倒计时: ",
        [36] = "领奖倒计时: ",
        [37] = "挑战时间已过",
        [38] = "活动已结束",
        [39] = "上次活动获得过馆长或成员奖励，本次不能挑战",
        [40] = "馆长同公会人员数量：",
        [41] = "公会成员给与馆长血量加成：",
        [42] = "当前战力与道馆战力不符",
        [43] = "活动结束时馆长公会成员可获得：",
    },

    artifact = {
        [1] = "合成",
        [2] = "宝石等级已达上限",
        [3] = "数据出错,请返回主界面",
        [4] = "宝石详情",
        [5] = "卸 下",
        [6] = "镶 嵌",
        [7] = "神器详情",
        [8] = "去锻造",
        [9] = "附加效果",
        [10] = "宝石属性",
        [11] = "不可镶嵌同类型宝石",
        [12] = "打造",
        [13] = "放入强化神石后打造的神器属性会更强",
        [14] = "只有3件全是金光神器合成后才是金光神器",
        [15] = "自动放入",
        [16] = "不可\n镶嵌",
        [17] = "请选择宝石",
        [18] = "三个神器才能合成一个",
        [19] = "神器选择",
        [20] = "请选择神器",
        [21] = "是否消耗%s进行开孔？",
        [22] = "点击开启",
        [23] = "点击镶嵌",
        [24] = "未使用强化神石增加基础属性，确认打造吗？",
        [25] = "已使用强化神石增加基础属性，确认打造吗？",
        [26] = "强化神石个数不足",
        [27] = "神 器",
        [28] = "宝 石",
        [29] = "全部",
        [30] = "已鉴定",
        [31] = "未鉴定",
        [32] = "自动\n放入",
        [33] = "请将三种材料置入材料孔",
        [34] = "名称:",
        [35] = "强化打造",
        [36] = "普通打造",
        [37] = "打造成功",
        [38] = "当前重铸的神器：%s 已镶嵌宝石，若重铸宝石直接返还至背包。",
        [39] = "重铸成功",
        [40] = "镶嵌宝石",
        [41] = "附加属性",
        [42] = "全部神器",
        [43] = "未鉴定",
        [44] = "已鉴定",
        [45] = "拥有宝石",
        [46] = "攻击宝石",
        [47] = "防御宝石",
        [48] = "生命宝石",
        [49] = "技能宝石",
        [50] = "宝石合成",
        [51] = "合成一个",
        [52] = "全部合成",
        [53] = "成功几率",
        [54] = "宝石数量不足",
        [55] = "合成失败",
        [56] = "倒计时",
        [57] = "属性展示",
        [58] = "预览:",
        [59] = "特性%s:",
        [60] = "放入神器",
        [61] = "普通鉴定",
        [62] = "已放入神器",
        [63] = "请放入神器",
        [64] = "神器已鉴定",
        [65] = "请放入神器",
        [66] = "开启该孔位需%s级",
        [67] = "当前可开启",
        [68] = "可镶嵌宝石",
        [69] = "开 启",
        [70] = "首次开孔无需消耗，请问是否开启此宝石镶嵌孔位？",
        [71] = "确定消耗%s颗%s%s对该宝石进行升级？",
        [72] = "升级失败",
        [73] = "神器类型:",
        [74] = "打造:",
        [75] = "更 换",
        [76] = "洗 炼",
        [77] = "攻击型",
        [78] = "防御型",
        [79] = "辅助型",
        [80] = "只有强化攻击类型的神器才在战斗中显示呦",
        [81] = "宝石特效",
        [82] = "%s级宝石效果",
        [83] = "已选择",
        [84] = "将会为您自动放入神器打造材料",
        [85] = "神器镶嵌",
        [86] = "神器打造",
        [87] = "神器鉴定",
        [88] = "神器背包",
        [89] = "宝石背包",
        [90] = "去鉴定",
        [91] = "天格",
        [92] = "地格",
        [93] = "命格",
        [94] = "已放入所需全部神器",
        [95] = "没有空闲的已鉴定神器",
        [96] = "当前已没有未鉴定的神器了",
        [97] = "开启需消耗%s",
        [98] = "%s合%s",
        [99] = "%s级",
        [100] = "队伍等级%s级才可镶嵌下级宝石",
        [101] = "队伍等级%s级才可镶嵌本宝石",
        [102] = "神器开孔成功",
        [103] = "神器镶嵌成功",
        [104] = "该功能尚未开放",
        [105] = "%s个%s",
        [106] = "升 级",
        [107] = "点击下方宝石进行放入",
        [108] = "%s级合%s级",
        [109] = "请点击上方宝石放入后合成",
        [110] = "宝石数量不足,无法进行合成",
        [111] = "%s不足,无法进行合成",
        [112] = "当前该宝石数量为0",
        [113] = "高级鉴定",
        [114] = "当前正在使用",
        [115] = "进行鉴定，是否确认鉴定？",
        [116] = "当前打造为强化打造",
        [117] = "您已取消强化打造",
        [118] = "宝石卸下成功",
        [119] = "打造时放入强化神石属性会更强",
        [120] = "且只有强化打造的攻击型神器才会在战斗中显示",
        [121] = "本次登录不再提示",
        [122] = "继 续",
        [123] = "高级鉴定保底一条",
        [124] = "蓝色属性",
        [125] = "普通鉴定无保底",
        [126] = "继续鉴定",
        [127] = "您未选择强化打造",
        [128] = "打造的神器属性会",
        [129] = "更强",
        [130] = "打造的",
        [131] = "神器才会在",
        [132] = "战斗中显示",
        [133] = "只有",
        [134] = "镶嵌于:%s-%s",
        [135] = "镶嵌于:%s神器",
        [136] = "%s颗%s",
        [137] = "宝石升级成功",
        [138] = "时辰可能会影响鉴定结果",
        [139] = "切换时辰倒计时：%s",
        [140] = "是否消耗%s进行升级？",
        [141] = "神器评分",
        [142] = "时辰",
        [143] = "类型:",
        [144] = "打造",
        [145] = "属性:",
        [146] = "重铸时加入",
        [147] = "强化神器",
        [148] = "概率获得",
        [149] = "未鉴定强化神器",
        [150] = "放入",
        [151] = "3个强化神器",
        [152] = "必得",
        [153] = "未鉴定强化神器",
        [154] = "强化",
        [155] = "锁 定",
        [156] = "一键鉴定",
        [157] = "一键打造",
        [158] = "替 换",
        [159] = "洗 炼",
        [160] = "一键添加",
        [161] = "强 化",
        [162] = "强化属性",
        [163] = "取 消",
        [164] = "技能%d：",
        [165] = "无",
        [166] = "开孔成功",
        [167] = "开孔失败",
        [168] = "请先开启第%d个孔",
        [169] = "当前神器有高品质技能，是否替换？",
        [170] = "当前洗炼有高品质技能，是否取消？",

        [171] = "锁定神器不可重铸",
        [172] = "强化过的神器不可重铸",
        [173] = "点化过的神器不可重铸",
        [174] = "镶嵌宝石的神器不可重铸",
        [175] = "有大于1个宝石孔",
        [176] = "锁定神器不可消耗或互换",
        [177] = "强化过的神器不可消耗",
        [178] = "点化过的神器不可消耗",
        [179] = "镶嵌宝石的神器不可消耗",
        [180] = "有大于1个宝石孔",
        [181] = "当前消耗的神器有高品质技能，是否确认消耗？",
        [182] = "当前消耗的神器有多个技能，是否确认消耗？",
        [183] = "当前消耗的神器有高品质技能，是否重铸？",
        [184] = "当前消耗的神器有多个技能，是否重铸？",
        [185] = "转移",
        [186] = "锁定神器需要先解锁才可以进行技能转移",
        [187] = "请选择两个神器",
        [188] = "神器技能一样，无需互换",
        [189] = "技能互换会消耗大量元宝，是否确认互换",
        [190] = "开 孔",
        [191] = "解 锁",
        [192] = "(神技共鸣)",
        [193] = "没有技能可以互换",

        [194] = "只有相同类型神器才能转移强化等级",
        [195] = "神器互换会消耗大量元宝，是否确认互换",
        [196] = "神器强化等级和成功率一样，不需要互换",
        [197] = "请先选择左边的神器!",
        [198] = "攻击: +",
        [199] = "防御: +",
        [200] = "生命: +",


    },

    activityAuction = {
        [1] = "开始拍卖",
        [2] = "请先选择需要拍卖的古董！",
        [3] = "赝品",
        [4] = "真品",
        [5] = "万",
        [6] = "竞拍中途可通过点击“成交”按钮以当前竞拍价格成交",
        [7] = "起拍价:",
        [8] = "确定",
        [9] = "取消",
        [10] = "已到达最大数量",
        [11] = "已到达自动成交最高价格",
        [12] = "自动成交价格最小为",
        [13] = "一键拍卖最小数量为1个",
        [14] = "本次自动拍卖所有古董为赝品",
    },

    kingsBattle2 = {
        [1] = "本日累计挑战次数：",
        [2] = "每日0点重置挑战次数",
        [3] = "一键领取",
        [4] = "领 取",
        [5] = "已领取",
        [6] = "未领取",
        [7] = "段位奖励",
        [8] = "本服奖励",
        [9] = "跨服奖励",
        [10] = "积分奖励",
    },

    honorBattle2 = {
        [1] = "第一场",
        [2] = "第二场",
        [3] = "第三场",
        [4] = "失败",
        [5] = "胜利",
        [6] = "战斗力：",
        [7] = "查看详情",
        [8] = "赔率：",
        [9] = "本次押注底注为：",
        [10] = "押 注",
        [11] = "押注失败，未获得押注奖励",
        [12] = "押注成功，获得: ",
        [13] = "奖励",
        [14] = "本场比赛结果为 ",
        [15] = "红方",
        [16] = "蓝方",
        [17] = "倍",
        [18] = "猜对可获得",
        [19] = "取 消",
        [20] = "确 定",
        [21] = "本轮比赛剩余最大押注限额：",
        [22] = "当前拥有银币数量：",
        [23] = "货币不足，无法下注",
        [24] = "未上榜",
        [25] = "每轮比赛结束后发送对应奖励",
        [26] = "当前拥有好感度：",
        [27] = "活动截止时间：",
        [28] = "去获取",
        [29] = "活动将于每周日晚结束",
        [30] = "可兑换",
        [31] = "次",
        [32] = "荣耀积分:",
        [33] = "兑换",
        [34] = "巅峰对决火热进行中，可以在小组赛或冠军赛中进行押注哦！",
        [35] = "  海选赛筹备中，周三13点－18点开始进行海选赛，每5分钟进行一轮",
        [36] = "距离巅峰对决结束时间:",
        [37] = "上阵角色不足，无法报名",
        [38] = "当前阶段不可上传阵容",
        [39] = "比赛尚未开始，无法查看对战BUFF",
        [40] = "每组至少需上阵1人",
        [41] = "尚未上阵魔宠，是否确定？",
        [42] = "您所在区服未开赛",
        [43] = "当前赛事未开启",
    },

    exclusiveArtifact = {
        [1] = "专属详情",
        [2] = "武魂：",
        [3] = "武魂属性",
        [4] = "攻击：",
        [5] = "防御：",
        [6] = "生命：",
        [7] = "进阶提升",
        [8] = "技能：",
        [9] = "合体技：",
        [10] = "需要伙伴等级：",
        [11] = "强 化",
        [12] = "阶",
        [13] = "级",
        [14] = "进 阶",
        [15] = "已满级",
        [16] = "等级已满无法升级",
        [17] = "伙伴等级太低无法升级",
        [18] = "进阶效果",
        [19] = "进阶消耗",
        [20] = "攻击",
        [21] = "防御",
        [22] = "武魂进阶至终极解锁武将进化：",
        [23] = "真·",
        [24] = "进阶材料不足",
        [25] = "属性提升",
        [26] = "生命",
    },

    poolingServerGift = {
        [1] = "合服好礼",
        [2] = "活动截止倒计时：",
        [3] = "未领取",
        [4] = "领 取",
        [5] = "已领取",
        [6] = "1.完成当日制定任务即可领取",
        [7] = "当日奖励",
        [8] = "2.每日只可完成一次任务，当日任务只可当日完成",
        [9] = "3.每日",
        [10] = "零点",
        [11] = "开启当天任务",
        [12] = "4.活动结束后未领取的奖励将会清空",
        [13] = "5.活动截止倒计时：",
        [14] = "(今日任务)",
        [15] = "已过期",
    },

    poolingServerOnline = {
        [1] = "活动截止倒计时：",
        [2] = "每日零点重置在线时间",
        [3] = "累计在线礼包",
        [4] = "累计领取第四档奖励2、4、6次即可领取下列礼包",
        [5] = "领 取",
    },

    poolingServerSign = {
        [1] = "活动截止倒计时：",
        [2] = "每日登陆游戏可前进一次",
        [3] = "前进",
        [4] = "每日只可签到一次"
    },

    hell = {
        [1] = "通缉",
        [2] = "全民追捕每日零点刷新",
        [3] = "BOSS心情刷新时间:",
        [4] = "返 回",
        [5] = "购买BUFF",
        [6] = "挑 战",
        [7] = "已挑战",
        [8] = "全民追捕",
        [9] = "心情:",
        [10] = "选 择",
        [11] = "刷 新",
        [12] = "花费:",
        [13] = "提升相应属性，只对全民追捕有效",
        [14] = "最高",
        [15] = "元宝不足，无法刷新",
        [16] = "已挑战此boss",
        [17] = "可获得以上奖励",
        [18] = "未达成",
        [19] = "领 取",
        [20] = "已领取",
        [21] = "未达到领取奖励所需条件",
        [22] = "奖励已领取",
        [23] = "已完成所有挑战，不能购买BUFF",
        [24] = "刷新需要扣除",
        [25] = "且清除上次BUFF",
        [26] = "是否进行刷新？",
        [27] = "否",
        [28] = "是",
        [29] = "怪物详情",
        [30] = "当前BOSS加成:",
        [31] = "Boss心情刷新:",
        [32] = "确 定",
        [33] = "加成:",
        [34] = "无",
        [35] = "每日通关奖励会随着通缉成功次数而增加",
    },

    change = {
        pageName = {
            [1] = "转移",
            [2] = "互换",
        },
        general = {
            [1] = "转移后武将会继承原武将所有养成属性，并返还原武将魂魄，精华",
            [2] = "材料消耗",
            [3] = "转 移",
            [4] = "确 定",
            [5] = "战斗力: ",
            [6] = "重生后可转换",
            [7] = "突破等级不足4级",
            [8] = "王的男人或天庭银座已添加",
            [9] = "的伙伴不可转换",
            [10] = "请放入转换的武将",
            [11] = "请放入转换后的武将",
            [12] = "武将魂魄不足，无法转换",
            [13] = "武将精华不足，无法转换",
            [14] = "武将元宝不足，无法转换",
            [15] = "没有同资质可转换武将",
            [16] = "资质",
            [17] = "请放入互换的武将",
            [18] = "至少需要有1个武将突破达到4级",
            [19] = "将两个武将的养成等级互换（包括武将养成消耗的魂魄和精华）",
            [20] = "互 换",
            [21] = "材料不足，无法互换",
            [22] = "没有可互换的武将",
            [23] = "突破上限不同",
            [24] = "的伙伴不可互换",
            [25] = "本次互换将有较大的材料损耗，确定要互换吗？",
            atk = "攻击",
            def = "防御",
            hp = "生命",
            speed = "速度",
            g_atk = "仙攻",
            g_def = "仙防",
            g_hp = "仙命",
        }
    },

    godSoulTemple = {
        pageName = {
            [1] = "金灵石",
            [2] = "龟灵石",
            [3] = "无当石",
            [4] = "火灵石",
        },
        common = {
            [1] = "升 级",
            [2] = "(增加所有在阵武将属性)",
            [3] = "级",
            [4] = "当前基础属性",
            [5] = "下级基础属性",
            [6] = "下一级",
            [7] = "资质伙伴突破等级总和达到",
            [8] = "突破等级不足",
            [9] = "金灵石无法进行粹神",
            [10] = "等级达到",
            [11] = "级，开启炼魂",
            [12] = "级，开启粹神",
            [13] = "已满级",
            g_atk = "仙攻：",
            g_def = "仙防：",
            g_hp = "仙命：",
        },
        refineSoule = {
            [1] = "炼魂",
            [2] = "级",
            [3] = "星",
            [4] = "炼魂消耗",
            [5] = "一键添加",
            [6] = "取  消",
            [7] = "确  认",
            [8] = "所有",
            [9] = "资质伙伴碎片均可参与炼化",
            [10] = "粹神",
            [11] = "粹神消耗",
            [12] = "炼魂规则",
            [13] = "粹神规则",
            [14] = "资质精华碎片均可参与炼化"
        },
        status = {
            g_atk = "仙       攻：",
            g_def = "仙       防：",
            g_hp = "仙       命：",
            g_adddmg = "仙增伤值：",
            g_subdmg = "仙减伤值：",
            g_criticaldmg = "仙  暴  伤：",
            g_dodge = "仙  闪  避：",
            g_hit = "仙  命  中：",
            g_critical = "仙  暴  击：",
            g_resilience = "仙  抗  暴：",
            g_parry = "仙  反  击：",
            g_arp = "仙  抗  反：",
        },
        status2 = {
            g_atk = "仙攻",
            g_def = "仙防",
            g_hp = "仙命",
            g_adddmg = "仙增伤值",
            g_subdmg = "仙减伤值",
            g_criticaldmg = "仙暴伤",
            g_dodge = "仙闪避：",
            g_hit = "仙命中",
            g_critical = "仙暴击",
            g_resilience = "仙抗暴",
            g_parry = "仙反击",
            g_arp = "仙抗反",
        },
    },

    token = {
        [1] = "天机令",
        [2] = "碎片",
        [3] = "天机令碎片不足",
        [4] = "未解锁",
        [5] = "等级不足",
        [6] = "材料不足",
    },

     --三界联考界面使用
    examination = {
        --考试
       [1] = "已完成考试",
       [2] = "未进行",
       [3] = "周试每周六18点到22点开启",
       [4] = "月试每4周周日18点到22点开启",
       [5] = "未上榜",
       [6] = "待开启:",
       [7] = "进行中:",
       [8] = "待关闭:",
       [9] = "活动结束",
       [10] = "暂无排行信息",
       [11] = "周试",
       [12] = "月试",
       [13] = "参与奖",
       [14] = "第",
       [15] = "题",
       [16] = "即将进行三界联考",
       [17] = "无",
       [18] = "成绩单",
       [19] = "准考证",
       [20] = "周排行",
       [21] = "月排行",
    },
        
    fixedString = {
        cornucopiaRule = {
            [1] = "1.每次聚宝可以获得银币；\n\n2.获得的银币可以产生倍数的暴击；\n\n3.每日聚宝的次数上限，根据贵族等级增加。"   
        },
        activity = {
            [1] = "未达到",
            [2] = "剩余次数：",
            [3] = "少年，你有不需要的东西吗？可以到我这里换取其他你可能需要的好东西！",
            [4] = "使用刷新石头或者20元宝",
            [5] = "距离财神飞升：",
            [6] = "财神显灵！少量元宝变大量元宝！",
            [7] = "迎财神 ",
            [8] = "哎呦呦，手气不错啊！拿好你的元宝吧！",
            [9] = "您磅礴的诚意感动了玉帝，玉帝帮你变出了更多的元宝！",
            [10] = "今日可聚宝次数：",
            [11] = "获得:" ,
            [12] = "仅需  ，最少可获得", --仅需(XXX)，最少可获得(XXX)  
            [13] = "您的   变成了:   ", 
            [14] = "可领取："  , 
            [15] = "每日有礼",
            [16] = "伙伴折扣商店",    
            [17] = "活动期间每日     达到相应额度，可获得      ，每日      点刷新将清空今日累计充值请及时领取奖励",
            [18] = "大爷，机不可失时不再来，不看看人也看看宝吧。限时限量甩卖咯！",
            [19] = "剩余充值次数：",
            [20] = "单笔充值",
            [21] = "活动期间                达到相对应的额度即可获得               ！",
            [22] = "现有积分:",
            [23] = "免费点星次数:",
            [24] = "剩余充值次数:",
            [25] = "总灌溉积分达到%d可进入排行榜",
            [26] = "排行榜第%s名奖励",
            [27] = "排行榜第%s-%s排名奖励",
        },  
        activity_peace = {
            [1] = "正午",
            [2] = "12点－14点",
            [3] = "黄昏",
            [4] = "18点－20点",
            [5] = "午夜",
            [6] = "21点－24点",
        }, 
        activity_doubleoutput ={
            [1] = "产出",
            [2] = "Tiến lên",
            [3] = "Đã hoàn thành",            
        },
        activity_growplan ={
            [1] = "伴您挣脱命运之路！购买",
            [2] = "成长计划，总计可返还",
            [3] = "及以上玩家可花费                  购买",
            [4] = "当前贵族等级：",
            [5] = "相互扶持，前行才更有力！",
            [6] = "共享",
            [7] = "人数越多，奖励越壕～",
            [8] = "已购买人数",
            [9] = "全服",
            [10] = "超值大礼",
            [11] = "我也要买",
            [12] = "已领取",
            [13] = "未达到",
        },  
        activity_newrank = {
            [1] = "冲级奖励",
            [2] = "冲级奖励:",
            [3] = "活动结束后，奖励会以邮件形式在一个工作日内发放。",
        }, 
        activity_share = {
            [1] = "有福同享",
            [2] = "额外奖励",
            [3] = "分享到微博或者微信，邀请更多魔王一起作。。。",
            [4] = "能获得                        哦！",
            [5] = "分享成功可获得：" ,
            [6] = "每天可领取一次奖励，24:00点重置",
            [7] = "今日已领奖",
        }, 
        activity_fbshare = {
            [1] = "分 享",
            [2] = "点 赞",
            [3] = "领 取",
            [4] = "已领取",
            [5] = "邀 请"
        },
        activity_sdkpingjia = {
            [1] = "评 估",
            [2] = "领 取",
            [3] = "已领取"
        },
        activity_cumulativerecharge = {
            [1] = "累计充值",
            [2] = "丰厚奖励",
            [3] = "活动期间，                   达到相对应",
            [4] = "活动倒计时：",
            [5] = "活动期间累计充值：",
            [6] = "的额度即可获得                      ！",
            [7] = "（充值200元送             ）",
            [8] = "关羽",
            [9] = "未达成",
            [10] = "已领取",
        },  
        activity_cumulativeLogin = {
            [1] = "累计登录奖励",
            [2] = "累计登录       天，将获得橙色伙伴 ",
            [3] = "“                  ”  ",
        },
        activity_continuous = {
            [1] = "连续登录奖励",
            [2] = "当天",
            [3] = "连续登录，可获得                      ！如天数中断讲需要重新连续登录",
            [4] = "奖励仅限            领取有效，请及时领取避免损失",
        },
        activity_double = {
            [1] = "充值元宝，双倍返还",
            [2] = "活动期间，以下额度均能获得双倍",
            [3] = "元宝，每个额度                      哦！额外返还的元宝将在充值成功后通过邮件发送",
            [4] = "仅限一次",
        },
        activity_dailyreward = {
            [1] = "天天好礼",
            [2] = "活动期间每日                     达到相",
            [3] = "应额度，可获得                      ",
            [4] = "每日",
            [5] = "点刷新将清空今日累计充值",
            [6] = "请及时领取奖励",
            [7] = "今日累计充值:",
        },
        activity_consumereward = {
            [1] = "消费有礼",
            [2] = "活动期间，                    达到相应的",
            [3] = "额度，即可获得                     ",
            [4] = "累计消费:",
            [5] = "累计消费",
        },
        activity_invent = {
            [1] = "接受邀请的好友需要领取25级邀请奖励方能计入“成功邀请”。",
            [2] = "“                        ”是指：",
            [3] = "接受邀请的好友",
            [4] = "已领取达到                    的奖励",
            [5] = "已成功邀请好友：",
            [6] = "我的邀请码：",
            [7] = "等级20",
            [8] = "复 制",
        },
        activity_welfareMonth = {
            [1] = "月基金福利",
            [2] = "魔王再次使用神灯召唤月基金开启，同时也带来了福利，只要激活基金，就能领取，走过路过不要错过！",
            [3] = "领奖截止时间：",
            [4] = "活动截止时间：",
            [5] = "去充值",
        },
        activity_multipleRebate = {
            [1] = "请于                                            前领取所有奖励",
            [2] = "奖励已累计领取      天",
            [3] = "同时激活月卡及终身卡可购买",
            [4] = "月卡：",
        },

        activity_cardgift = {
            [1] = "月卡用户，充值享好礼",
            [2] = "活动期间，充值成为                     ",
            [3] = "的玩家可以累计充值获得",
            [4] = "月卡用户",
            [5] = "两种月卡可同时生效",
        },
        activity_treasuresDiscount = {
            [1] = "大爷，机不可失时不再来，不看看人也\n看看宝吧。限时限量甩卖咯！"
        },
        activity_signin = {
            [1] = "今日充值                    即可获取以下豪华奖励哦！",
            [2] = "6元以上",
            [3] = "本月已累计签到",
            [4] = "天",
            [5] = "签 到",
        },
        tc_share = {
            [1] = "分享有奖",
        },
        watchstar = {
            [1] = "观星台",
            [2] = "说明",
            [3] = "奖励",
            [4] = "当前星辰：",
            [5] = "星辰越多，奖励越丰厚",
            [6] = "每日0点刷新观星次数",
            [7] = "换 星",
            [8] = "领取星辰",
            [9] = "观 星",
        },
        starGetReward = {
            [1] = "查看奖励",   
        },
        starRule = {
            [1] = "观星规则",
            [2] = "1.观星时，点亮星星可获得星辰，点亮星星个数越多，获得星辰越多。\n\n2.换星仅在进行观星时可使用，领取星辰后需要进行新一次观星才能使用换星。\n\n3.换星可以使未点亮星星有几率点亮。\n\n4.累积星辰达到指定数量，可到奖励中领取奖励。\n\n5.每日0点重置观星次数，星辰数清0，避免损失请及时领取奖励。"     
        },
        battleScene = {
            [1] = "首次三星，银币奖励三倍 ",
            [2] = "队伍经验：",
            [3] = "强化装备可以提升装备的属性，从而使伙伴更强。的属性，从而使伙伴更强。",
            [4] = "去强化",
            [5] = "强化装备可以提升装备的属性，从而使伙伴更强。的属性，从而使伙伴更强。从而使伙伴更强。",
            [6] = "获得奖励",
        },
        battleVs = {
            [1] = "战斗力:",
        },
        generalExp = {
            [1] = "伙伴获得经验",
            [2] = "扫荡完成",        
        },
        chat = {
            [1] = "加好友",
            [2] = "免费喊话次数：",

            [3] = "大笑",
            [4] = "好色",
            [5] = "发呆",
            [6] = "大哭",
            [7] = "害羞",
            [8] = "发怒",
            [9] = "呕吐",
            [10] = "流汗",
            [11] = "咒骂",
            [12] = "晕眩",
            [13] = "再见",
            [14] = "鼓掌",
            [15] = "鄙视",
            [16] = "可怜",
            [17] = "睡觉",
            [18] = "我",
            [19] = "今日免费喊话次数:",
            [20] = "喊话器:",
            [21] = "屏蔽列表",
        },
        collect = {
            [1] = "推荐阵容",
            [2] = "全部伙伴",
            [3] = "武 器",
            [4] = "防 具",
            [5] = "头 盔",
            [6] = "饰 品",
            [7] = "坐 骑",
            [8] = "典 籍",
            [9] = "新手阵容",
        },
        copy = {
            [1] = "挑战次数：",
            [2] = "消耗体力：",
            [3] = "今日剩余挑战次数：",
            [4] = "推荐战力：",
            [5] = "挑战失败不消耗挑战次数",
            [6] = "今日剩余挑战次数：",
            [7] = "恭喜胜利",
        },
        copyFiend = {
            [1] = "帮助",
            [2] = "好友副本",
            [3] = "今日剩余次数",
            [4] = "我的排名：",
            [5] = "好友助战排行榜",
            [6] = "助战次数：",
            [7] = "请选择助战的好友！",
            [8] = "好友选择",
        },
        copyStar = {
            [1] = "有几率获得：",
            [2] = "够胆就来打我吧！打得过我吗？？？",
            [3] = "下一关",
        },
        cup = {
            [1] = "（杯赛可获得大量银币）",
            [2] = "打的不错啊，快来领取您的奖励吧！",
            [3] = "剩余下注次数",
            [4] = "本场比赛下注额度",
            [5] = "14:00点",
            [6] = "八进",
            [7] = "四",
            [8] = "16:00点",
            [9] = "四进",
            [10] = "二",
            [11] = "19:00点",
            [12] = "决赛",
            [13] = "竞猜成功后，奖励将发至邮箱",
            [14] = "比赛中......",
            [15] = "胜利！",
            [16] = "失败！",
            [17] = "第     轮" ,  
        },
        cupBet = {
            [1] = "支持率",
            [2] = "剩余仙琼酿",
            [3] = "本场下注额度",
        },
        cupRule = {
            [1] = "杯赛规则",
            [2] = "报名规则",
            [3] = "玩家参加杯赛的阵容由报名时的阵容决定",
            [4] = "玩家可以在每天9点到24点报名参加次日的杯赛",
            [5] = "比赛开放时间",
            [6] = "直播阶段：",
            [7] = "从早上9点开赛，每20分钟进行一轮比赛，直到决出8强",
            [8] = "竞猜阶段：",
            [9] = "每天下午2点到2点30分进行           淘汰赛",
            [10] = "每天下午4点到4点30分进行           淘汰赛",
            [11] = "每天下午7点到7点30分进行",
            [12] = "八进四",
            [13] = "四进二",
            [14] = "决赛",
            [15] = "奖励规则",
        },
        daily = {
            [1] = "开启等级：",
            [2] = "不在活动时间内",
            [3] = "开服%s天后开启",
        },
        devil = {
            [1] = "主动技能提升：",
            [2] = "蓝色：",
            [3] = "紫色：",
            [4] = "橙色：",
            [5] = "红色：",
            [6] = "主动技能",
            [7] = "被动技能",
            [8] = "仙缘",
            [9] = "三属性全满可进阶，进阶后属性和技能大幅度提升",
            [10] = "魔王提升",
            [11] = "攻击加成",
            [12] = "生命加成",
            [13] = "防御加成",
            [14] = "速度加成",
            [15] = "消耗：",
            [16] = "魔 宫",
            [17] = "未激活",
            [18] = "聚宝",
            [19] = "显示时装",
        },
        encounter = {
            [1] = "子曰：学而时习之，\n不亦说乎……",
            [2] = "仙人带来了礼物：",
            [3] = "使用              感谢仙人，即可获得双倍道具！",
            [4] = "点击物品查看详情",
            [5] = "消失时间：",
            [6] = "点击查看详情",
            [7] = "既然我们这么有缘！\n快把我带走吧！",
            [8] = "无 视",
            [9] = "原价：",
            [10] = "现价：",
            [11] = "当前拥有：",
            [12] = "无视只能获得该伙伴的一个魂魄",
            [13] = "打扫战场居然扫到了         ，快打开看看有什么",
            [14] = "使用               ，即可获得双倍宝物！",
            [15] = "打 开",
            [16] = "打开X2",
            [17] = "宝藏",
            [18] = "打扫战场",
            [19] = "哎呦呦，小妞别怕\n大爷们劫财不劫色",
            [20] = "冷眼旁观",
            [21] = "英雄救美",
            [22] = "前面有个小姑娘遇到了强盗，魔王大人要怎么做呢？",
            [23] = "击败         即可获得:",
            [24] = "强盗",
            [25] = "意外的发现了一件         只要                  就可以得到了",
            [26] = "无视将随机获得一件低品质装备",
            [27] = "奇遇",
            [28] = "恭喜魔王大人获得",
            [29] = "拜 谢",
            [30] = "拜谢X2",
            [31] = "看广告",
        },
        equip = {
            [1] = "消耗银币：",
            [2] = "点击图标选中或取消物品",
            [3] = "自动添加",
            [4] = "未装备",
            [5] = "Số lượng:",
            [6] = "进阶属性",
            [7] = "套 装",
            [8] = "［套装效果］",
            [9] = "缘 分",
            [10] = "所需材料",
            [11] = "精炼值",
            [12] = "点击图标放入材料，长按快速放入材料",
            [13] = "一键精炼",
            [14] = "基础属性：",
            [15] = "<套装·武器>",
            [16] = "套装",
            [17] = "洗炼属性",
            [18] = "选择洗炼",
            [19] = "花费：",
            [20] = "洗炼 X1",
            [21] = "洗炼 X5",
            [22] = "洗炼 X10",
            [23] = "替 换",
            [24] = "剩余：",
            [25] = "未装备的装备才会被分解",
            [26] = "全 部",
            [27] = "材 料",
            [28] = "已选择：",
            [29] = "一次最多使用          个",
            [30] = "装备2件：",
            [31] = "装备3件：",
            [32] = "装备4件：",  
            [33] = "属性：",  
            [34] = "基础属性:",   
            [35] = "精炼描述信息",  
            [36] = "最大",
            [37] = "自动洗炼",
        },
        friends = {
            [1] = "战力：",
            [2] = "公会：",
            [3] = "一键同意",
            [4] = "一键忽略",
            [5] = "好友数量",
            [6] = "我的ID",
            [7] = "今日l收礼次数",
            [8] = "飞鸽传书",
            [9] = "正在与                           对话",
            [10] = "精确查找！",
            [11] = "屏蔽数量",
        },
        general = {
            [1] = "技能",
            [2] = "（合体技）",
            [3] = "阵营：",
            [4] = "下级基础属性",
            [5] = "攻击：",
            [6] = "防御：",
            [7] = "生命：",
            [8] = "速度：",
            [9] = "当前基础属性", 
            [10] = "前往",
            [11] = "[副本]",
            [12] = "[黑市]",
            [13] = "本阶属性",
            [14] = "当前属性",
            [15] = "（效果翻倍）",
            [16] = "精心培养",
            [17] = "培养丹",
            [18] = "普通培养",
            [19] = "潜力点",
            [20] = "拥有培养丹",
            [21] = "培养一次，消耗1颗培养丹",
            [22] = "下阶属性",
            [23] = "点击屏幕继续",
            [24] = "觉 醒",
            [25] = "效 果",
            [26] = "触发几率：",
            [27] = "攻击范围：",
            [28] = "伤害总量：",
            [29] = "觉醒",
            [30] = "解锁天赋：",
            [31] = "已经觉醒满级",
            [32] = "该伙伴无法觉醒",
            [33] = "觉醒增加伙伴资质",
            [34] = "该伙伴无法觉醒",
            [35] = "资质升为",
            [36] = "伙伴仙缘",
            [37] = "进阶"
        },
        guild = {
            [1] = "战斗力：",
            [2] = "累计贡献：",
            [3] = "今日贡献：",
            [4] = "踢 除",
            [5] = "会长：",
            [6] = "人数：",
            [7] = "总战力:",
            [8] = "贡献：",
            [9] = "当前学习：",
            [10] = "贡献度：",
            [11] = "申请和创建公会倒计时",
            [12] = "搜 索",
            [13] = "点击修改",
            [14] = "内部公告",
            [15] = "宣言",
            [16] = "土鸡蛋",
            [17] = "三黄鸡",
            [18] = "叫花鸡",
            [19] = "公会经验：",
            [20] = "个人贡献：",
            [21] = "贡 献",
            [22] = "每日只能选择一种贡品，且只能贡献一次",
            [23] = "公会商店",
            [24] = "公会技能",
            [25] = "创建公会",
            [26] = "需要：",
            [27] = "达到25级",
            [28] = "创 建",
            [29] = "您确定要更改公会名称吗？",
            [30] = "确定要退出公会吗？",
            [31] = "今日进度：",
            [32] = "今日扔肥皂次数：",
            [33] = "扔肥皂可获得公会经验，个人贡献值及今日进度",
            [34] = "点击图标可以扔肥皂",
            [35] = "公会动态",
            [36] = "贡献排行榜",
            [37] = "我的贡献度：",
            [38] = "澡堂规则",
            [39] = "1.提升公会等级可以领取更丰厚的奖励；",
            [40] = "同时获得",
            [41] = "3.当日达到一定进度后可以领取进度奖励；",
            [42] = "4.丢肥皂进度每日0点清空。",
            [43] = "度、银币 ，              公会经验；",
            [44] = "贡献",
            [45] = "2.公会成员每天可以丢肥皂10次，洗澡时可以获得",
            [46] = "公会动态",
            [47] = "下一场战斗开启，倒计时：",
        },
        guildwar = {
            [1] = "1.银币鼓舞：每次鼓舞随机增加的攻击5%或防御5%。\n\n2.银币鼓舞可鼓舞20次。\n\n3.元宝鼓舞：每次鼓舞增加攻击5%和防御5%。\n\n4.元宝鼓舞可鼓舞20次。\n\n5.元宝鼓舞一定次数后，会有连胜加成。\n\n6.鼓舞只在本次争夺宝藏有效。\n\n7.退出战场后，加入其它战场鼓舞效果不消失。",
            [2] = "鼓舞说明",
            [3] = "宝藏战说明",
            [4] = "1.在系统规定的时间内，会长和副会长可以选择宝藏点进行报名，最多可报名2个宝藏点且报名后不可取消。\n\n2.报名成功时间结束后，将根据报名的公会中成员贡献度前4的公会作为报名成功的公会。报名成功的公会将可以参加攻打宝藏点。若该宝藏点已有公会占领，则只有前3的公会可参加攻打宝藏点。\n\n3.攻打宝藏点阶段由报名成功的4个军团进行对战。对战情况为第1VS第2，第3VS第4，然后胜利的公会在进行决战。最后胜利的公会将成功夺得宝藏点。\n\n4.公会战需要公会成员上线进入对应宝藏点的战场，在准备战场中可以鼓舞自己的战斗力，鼓舞到一定阶段会增加自己的连胜次数。准备时间过后将自动开战。进入准备场景的玩家将以此上场进行作战。剩余人数不为0的公会将获得胜利。\n\n5.每个公会只能占领一个宝藏点，如果1个以上的战场获得胜利，那么会默认选择最高品质的宝藏点为占领宝藏点。其他宝藏点轮空。\n\n6.最后占领宝藏点的公会将获得这个宝藏点的奖励，不同成员职位获得的奖励不同。\n\n7.发奖后，宝藏点的防御度自动降低，防御度对应的是守护宝藏的公会在本宝藏点的守城战斗力，若一个公会连续占领某个宝藏点，则防御度每次发奖后都会降低。直到更换新的占领公会，防御度才会恢复。",
            [5] = "提 示",
            [6] = "（只有本轮贡献         的公会才能获得                 ）",
            [7] = "本轮还可以报名攻打城池数：", 
            [8] = "※注：报名成功后无法取消",
            [9] = "占领军团:",
            [10] = "收     益:",
            [11] = "防 御 值:",
            [12] = "战 斗 力:",
            [13] = "(会长)",
            [14] = "(副会长)",
            [15] = "(成员)",
            [16] = "（同一军团连续占领时，每轮夺宝战后下降          ）",
            [17] = "（防御值越低，夺宝战中守宝军团战斗力越低）",
            [18] = "贡献在报名结束时截止计算，报名结束后将计算下一轮贡献",
            [19] = "公会战说明",
            [20] = "1.魔王宝藏分为4个等级：橙色、紫色、蓝色、绿色。产出：元宝、银币、神石碎片。",
            [21] = "2.每周进行2次夺宝战，分别在周二和周四。",
            [22] = "3.每周二8点-20点、周四8-20点可以报名夺宝战。",
            [23] = "4.每周二20点-21点、周四20点-21点可以进入战场。",
            [24] = "5.每周二22点-周四0点、周四20点-周六0点可以领取占领奖励。",
            [25] = "6.报名成功时间结束后，将根据报名的公会中成员上周五到进入战场前的贡献度前4的公会作为报名成功的公会。报名成功的公会将可以参加攻打宝藏点。若该宝藏点已有公会占领，则只有前3的公会可参加攻打宝藏点。",
            [26] = "7.在系统规定的时间内，会长和副会长可以选择宝藏点进行报名，最多可报名2个宝藏点且报名后不可取消。",
            [27] = "8.攻打宝藏点阶段由报名成功的4个军团进行对战。对战情况为第1VS第2，第3VS第4，然后胜利的公会在进行决战。最后胜利的公会将成功夺得宝藏点。",
            [28] = "9.公会战需要公会成员上线进入对应宝藏点的战场，在准备战场中可以鼓舞自己的战斗力，鼓舞到一定阶段会增加自己的连胜次数。准备时间过后将自动开战。进入准备场景的玩家将以此上场进行作战。剩余人数不为0的公会将获得胜利。",
            [29] = "10.每个公会只能占领一个宝藏点，如果1个以上的战场获得胜利，那么会默认选择最高品质的宝藏点为占领宝藏点。其他宝藏点轮空。",
            [30] = "11.最后占领宝藏点的公会将获得这个宝藏点的奖励，不同成员职位获得的奖励不同。",
            [31] = "12.发奖后，宝藏点的防御度自动降低，防御度对应的是守护宝藏的公会在本宝藏点的守城战斗力，若一个公会连续占领某个宝藏点，则防御度每次发奖后都会降低。知道更换新的占领公会，防御度才会恢复。",
            [32] = "13.参战公会成员：记录2天以内入会人员的入会时间，入会2天以内的玩家不能公会战。",
            [33] = "14.领取奖励公会成员：不能参加公会战的玩家不能领取本次公会战奖励。",
            [34] = "次数：",
            [35] = "即将开启",
            [36] = "占领奖励",
         },
        gonglve = {
            [0] = "游戏攻略",  
            [1] = "宝物",
            [2] = "宝物品质：",
            [3] = "4个品质，分别为二星绿色，三星蓝色，四星紫色，五星橙色，\n众所周知，宝物品质越高，属性越好，成长越高。",
            [4] = "宝物类型：",
            [5] = "分为2个部位：坐骑、典籍。主要增加伙伴的基础属性百分比。",
            [6] = "宝物升级：",
            [7] = "宝物可以通过升华，精炼来提升属性\n    宝物升华：提升宝物基础属性\n    宝物精炼：提升宝物基础属性百分比",
            [8] = "宝物分解：",
            [9] = "宝物分解可以获得精炼材料，用来精炼宝物。" ,
            [10] = "副本",
            [11] = "普通副本：",
            [12] = "挑战普通副本可随机获得蓝色装备、绿色装备、蓝色伙伴\n魂魄。\n章节每达到一定星数可获得额外奖励。\n首次3星通关关卡可获得三倍银币。",
            [13] = "精英副本：",
            [14] = "挑战精英副本可随机获得蓝色装备、紫色装备碎片。\n章节每达到一定星数可获得额外奖励。\n首次3星通关关卡可获得三倍银币。",
            [15] = "福利",
            [16] = "蟠桃：",
            [17] = "每天三次，每次30点体力。",
            [18] = "每日签到：",
            [19] = "每天一次，按日期领取。",
            [20] = "连续登录：",
            [21] = "每天一次，连续登录天数越多奖励越好。",
            [22] = "公会",
            [23] = "公会：",
            [24] = "可以选择加入现有公会和创建新的公会。\n创建公会需要大量银币。\n加入公会后，可以用自己的贡献使公会变得更加强大。",
            [25] = "公会鱼塘：",
            [26] = "公会中每个成员每日可以喂养10次；\n公会成员喂养1次，按饲料品质给予相应贡献度、银币，并\n增加相应品质鱼的经验值；\n鱼的等级控制拿奖数量；\n当公会升级后，鱼的品质发生变化后，鱼等的等级重置为\n1；鱼的品质发生变化时，奖励也发生变化；\n每日达到喂养进度时，可以领取奖励。\n喂养进度，每天0点清空。",
            [27] = "伙伴",
            [28] = "伙伴品质：",
            [29] = "4个品质，分别为二星绿色，三星蓝色，四星紫色，五星橙色，\n众所周知，伙伴品质越高，属性越好，成长越高。\n提示：游戏伙伴前后期效果不一样哦！",
            [30] = "伙伴类型：",
            [31] = "伙伴分为2个类型：攻击型和防御型",
            [32] = "攻击型：攻击成长较高，速度较快。\n防御型：防御和血量成长较高。",
            [33] = "伙伴成长：",
            [34] = "伙伴可以通过很多方式成长，不同的成长带来的收益不一样",
            [35] = "伙伴升级：可以通过历练战斗来提升，副本越高级，伙伴获得经验越多\n伙伴传承：伙伴可以通过传承获得另一个伙伴的经验值来提升等级\n伙伴突破：伙伴可以通过使用自己的魂魄来进行进阶，提升伙伴的基础属性。\n伙伴缘：同时上阵几个有缘的伙伴会获得基础属性加成。",
            [36] = "伙伴技能：",
            [37] = "伙伴技能分为2种：个人技能和合体技能",
            [38] = "个人技能：伙伴上阵后，4点怒气以上可触发，使用消耗所有怒气，怒气越多，伤害越高。\n合体技能：游戏中的一大特色，有合体技的伙伴同时上阵时，4点怒气以上有几率触发，使用消耗所有怒气，怒气越多，伤害越高。",
            [39] = "伙伴合成：",
            [40] = "伙伴可以通过收集伙伴魂魄合成，不同的伙伴合成所需魂魄个数不同。",
            [41] = "活动",
            [42] = "观星台：",
            [43] = "挑战普通副本可随机获得蓝色装备、绿色装备、蓝色伙伴\n魂魄。\n章节每达到一定星数可获得额外奖励。\n首次3星通关关卡可获得三倍银币。",
            [44] = "精英副本：",
            [45] = "挑战精英副本可随机获得蓝色装备、紫色装备碎片。\n章节每达到一定星数可获得额外奖励。\n首次3星通关关卡可获得三倍银币。",
            [46] = "猎命",
            [47] = "猎命：",
            [48] = "猎命可获得命格，能够使装备的角色更加强力。\n传说中提高战斗力非常有效的方法。\n通过装配命格，来有效的提升卡牌的战斗力，或者有效的减少伤害",
            [49] = "命格",
            [50] = "命格品质：",
            [51] = "4个品质，分别为二星绿色，三星蓝色，四星紫色，五星橙色，众所周知，命格品质越高，属性越好，成长越高。",
            [52] = "命格升级：",
            [53] = "命格可以通过升级来提升属性",
            [54] = "命格分解：",
            [55] = "命格分解可以获得灵元，用来升级命格。",
            [56] = "魔宠",
            [57] = "魔宠合成：",
            [58] = "未拥有的魔宠可以通过宠物碎片合成",
            [59] = "魔宠增强：",
            [60] = "喂养：喂养魔宠经验伙伴和绿色伙伴来提升魔宠等级\n进阶：宠物满级后可进阶，进阶后属性大幅度提升切宠物宠物的等级上限。",
            [61] = "魔宫",
            [62] = "主角增强：",
            [63] = "培养：使用魔晶培养主角的攻击、防御、生命\n进阶：使用突破丹和魔王魂石来提升主角的基础属性",
            [64] = "日常",
            [65] = "竞技场：",
            [66] = "验证实力的地方，在竞技场中获胜可获得魔晶。\n竞技场前五名获得挑战牛魔王的资格，有机会获得牛魔王魂魄。\n竞技场积分可换取高级装备碎片和伙伴魂魄。",
            [67] = "挑战：",
            [68] = "通过挑战有几率获得已有精炼材料碎片和宝物碎片。\n集齐一个宝物的所有碎片可合成该宝物。",
            [69] = "蓬莱仙岛：",
            [70] = "探索仙岛可获得魔晶、招募令、刷新石。\n每周排名可获得大量突破丹、大量魔晶。",
            [71] = "群仙屠龙：",
            [72] = "在规定的时间里挑战魔龙，可获得大量魔晶。\n排名奖励可获得新的宠物。\n",
            [73] = "灭神殿：" ,
            [74] = "灭神殿每一层都有三种难度可选择，分别为容易、普通和困难。难度越高，对手实力越强，胜利之后获得的星星也越多。\n每过5关会有奖励，闯过的关数越多奖励也越丰富。\n挑战灭神殿可获得大量的箱子，钥匙，宠物进阶道具。",
            [75] = "好友副本：",
            [76] = "每日每关可选择好友的一名助战伙伴且只能选择一次。\n挑战好友副本获得蓝色装备碎片、紫色装备碎片、橙色装备碎片和精炼材料。",
            [77] = "好友：",
            [78] = "加游戏好友可以送礼，查看阵容，在线聊天，助战好友副本。\n好友送礼可获得银币和体力。\n好友推荐中点击申请，对方通过后，将成为你的好友。\n直接在好友申请中点击精确查找，输入好友ID号。\n当有人请求添加你为好友时，可以在好友申请中通过其申请。\n如果对方将你删除，你的好友列表中就不会显示该玩家名字。",
            [79] = "杯赛：",
            [80] = "比赛",
            [81] = "\n    杯赛为全服皆可参与的PK玩法。\n    杯赛采取一场定输赢的淘汰赛制。\n    赢得胜利可获得海量突破丹。",
            [82] = "竞猜",
            [83] = "可利用手上的银币竞猜八强后所有杯赛的胜负。\n竞猜成功可获得下注额两倍的银币返还，竞猜失败下注的银币被系统回收。",
            [84] = "装备",
            [85] = "装备品质：",
            [86] = " 4个品质，分别为二星绿色，三星蓝色，四星紫色，五星橙色，众所周知，装备品质越高，属性越好，成长越高。",
            [87] = "装备类型：",
            [88] = "分为4个部位：武器、头盔、护甲、饰品。\n    武器：增加伙伴攻击和速度\n    头盔：增加伙伴防御和生命\n    护甲：增加伙伴防御和攻击\n    饰品：增加伙伴攻击和速度\n",
            [89] = "装备升级:",
            [90] = "装备可以通过强化，精炼来提升属性\n    装备强化：提升装备基础属性\n    装备精炼：提升装备基础属性百分比",
            [91] = "装备分解：",
            [92] = "装备分解可以获得精炼材料，用来精炼装备。",
        },
        island = {
            [1] = "蓬莱仙洞",
            [2] = "全部点亮可领取奖励",
            [3] = "点击可领取",
            [4] = "恭喜获得",
            [5] = "选择点数",
            [6] = "仙洞规则",
            [7] = "1.掷骰子向前移动，移动步数为骰子点数;\n\n2.宝物拾取触发，怪物路过触发;\n\n3.每场怪物战斗胜利会点亮1颗星，4颗星全部点亮可领取一个奖励;\n\n4.蓬莱仙洞每次可免费掷10个骰子;\n\n5.蓬莱仙洞每日可免费重置1次.",
        },
        kingman = {
            [1] = "详情",
            [2] = "王的男人",
            [3] = "敌人将在                后消失",
            [4] = "布 阵",
            [5] = "技 能",
            [6] = "挑战副本等级越高，获得物品奖励越多",
            [7] = "剩余挑战次数：",
            [8] = "足 迹",
            [9] = "详情",
            [10] = "造成伤害越高，获得物品奖励越多",
            [11] = "挑战失败也会消耗挑战次数，并获得对应的奖励",
            [12] = "挑战失败不消耗挑战次数",
            [13] = "魔吕布布阵",
            [14] = "如来布阵",
            [15] = "当前为如来布阵",
            [16] = "当前为魔吕布布阵",
        },
        login = {
            [1] = "中文名称：作妖计\n应用类型：卡牌游戏\n公司名称：北京初见科技有限公司\n客服电话：010-57853204\n免责声明：\n本游戏版权归“北京初见科技有限公司”所有，游戏中的文字，照片等内容均为游戏版权所有者的个人态度或立场，炫彩互动（中国电信）对此不承担任何法律责任。",
            [2] = "服务器人数已满！",
            [3] = "当前排队总人数：",
            [4] = "您在队列中位置：",
            [5] = "已等待时间：",
            [6] = "点击选区",
            [7] = "邮箱",
            [8] = "密码",
            [9] = "连接中",
            [10] = "最近登陆",
        },
        love = {
            [1] = "完成条件：",
            [2] = "属性加成",
            [3] = "好感度经验越高，送礼时直接升级几率越大，当前几率：",
            [4] = "一键赠送",
            [5] = "当前伙伴好感总和：",
            [6] = "一键赠送最多50个好感礼物，达到好感上限后不会继续使用，您确定要一键赠送吗？",
            [7] = "提示",
        },
        magic = {
            [1] = "解 锁",
            [2] = "增加所有上阵伙伴属性",
            [3] = "最大",
        },
        mail = {
            [1] = "奖励：",
            [2] = "最多可保留60封邮件，请及时领取",
            [3] = "系统邮件",
        },
        mainscene = {
            [1] = "选择头像",
            [2] = "点击更换头像",
            [3] = "下次体力恢复：",
            [4] = "全部体力恢复：",
            [5] = "下次精力恢复：",
            [6] = "全部精力恢复：",
            [7] = "音乐",
            [8] = "音效",
            [9] = "玩家信息",
            [10] = "我的ID：",
            [11] = "客 服",
             --天赐为 切換帳號，气吞云梦为 客服
            [12] = "公 告",
            [13] = "攻 略",

            [14] = "选择头像框",
            [15] = "头像框加成属性对所有上阵角色生效",
            [16] = "未装备的头像框属性也会生效",

            [17] = "选择称号",
            [18] = "称号加成属性对所有上阵角色生效",
            [19] = "未装备的称号属性也会生效",

            [20] = "更换头像",
            [21] = "更换称号",
            [22] = "更换头像框",

            [23] = "使用",
            [24] = "永久生效",
            [25] = "已失效",
            [26] = "剩余时间：",

            [27] = "称号激活",
            [28] = "头像框激活",

            [29] = "音乐",
            [30] = "音效",
        },
        pet = {
            [1] = "上 阵",
            [2] = "品质：",
            [3] = "额外属性加成",
            [4] = "背包",
            [5] = "魔宠图鉴",
            [6] = "（进阶可提升技能）",
            [7] = "激活技能个数：",
            [8] = "单个技能等级上限：",
            [9] = "当前技能点数：",
            [10] = "学 习",
            [11] = "技能增加上阵伙伴属性，点击可锁定和解锁",
            [12] = "天赋技能：",
            [13] = "魔宠等级已达到上限",
            [14] = "额外属性加成为所有上阵伙伴属性加成",
            [15] = "（多个宠物额外属性可叠加）",
            [16] = "激活   个被动技能位置。",
            [17] = "魔宠规则",
            [18] = "1.宠物每进阶一次提升一次宠物品质；\n\n2.宠物被动技能最高可达到15级；\n\n3.宠物被动技能可重置，重置后会需重新学习；\n\n4.已学习的宠物技能可以被锁定，锁定后重置 技能时，已锁定的技能不会消失；\n\n5.宠物品质越高，可激活被动技能越多；\n\n6.宠物被动技能绑定在所有宠物身上，更换宠物宠物被动技能不变。",
            [19] = "已锁定   个技能，未锁定技能将被清空，",
            [20] = "被清空技能包含橙色技能",
            [21] = "是否重置？",
            [22] = "锁 定",
            [23] = "激活     个被动技能位置。",
            [24] = "已锁定       个技能，未锁定技能将被清空，",
        },
        mofu = {
            [1] = "未镶嵌",
            [2] = "去镶嵌",
            [3] = "魔符属性",
            [4] = "提升所有上阵伙伴属性",
            [5] = "经验：",
            [6] = "选择魔符",
        },
        sports = {
            [1] = "首次达到前        名",
            [2] = "已获得",
            [3] = "前      名",
            [4] = "需要消耗积分",
            [5] = "每日获得：",
            [6] = "排名：",
            [7] = "积分",
            [8] = "战力",
            [9] = "每日奖励",
            [10] = "奖励",
            [11] = "每日奖励，每天零点通过邮件发放",
            [12] = "前         名",
        },
        prompts = {
            [1] = "合体技激活",
            [2] = "缘分激活",
        },
        qiankunlu = {
            [1] = "规 则",
            [2] = "1.消耗元宝，可以让升级、培养、突破过的伙伴；强化、洗炼过的装备；强化、精炼过的宝物重生为初始状态;",
            [3] = "2.点击“+”可进入选择界面，每次可选择1个伙伴或装备或宝物进行重生;",
            [4] = "3.重生后将返还被重生物品相对应的几乎全部培养资源。",
            [5] = "规 则",
            [6] = "1.可将初始状态的伙伴转化为魂魄状态;",
            [7] = "2.点击“+”可进入选择界面，每次可选择1-5个伙伴进行化魂;",
            [8] = "3.伙伴化魂后返还伙伴合成时所需的魂魄，同时被化魂的伙伴将消失。" ,
            [9] = "4.王的男人和阵容中的伙伴需要下阵之后才能进行化魂",
            [10] = "1.点击“+”可进入选择界面，每次最多可选择5个魂魄或装备进行炼化；",
            [11] = "2.可炼化魂魄，将获得神魂商店兑换货币；",
            [12] = "3.可炼化整件装备，将返还大部分培养资源，已穿戴的装备无法进行炼化；",
            [13] = "4.炼化后，所炼化物品将会消失。",
            [14] = "可以获得：",
            [15] = "添加装备",
            [16] = "添加魂魄",
            [17] = "添加宝物",
            [18] = "重 生",
            [19] = "消耗元宝：",
            [20] = "化 魂",
            [21] = "返还装备进阶消耗的大量资源",
        },
        rank = {
            [1] = "名",
            [2] = "排行榜",
            [3] = "积分排名",
            [4] = "排 名"
        },
        recharge = {
            [1] = "再充值",
            [2] = "即可成为",
        },
        reward = {
            [1] = "进度：",
            [2] = "在线奖励",
            [3] = "后可领取",
            [4] = "当前活跃度:",
            [5] = "日常任务于每日早上0点刷新",
            [6] = "点击获得更多奖励",
            [7] = "           后可领取",
        },
        rub = {
            [1] = "使用免战牌可获得相应的免战时间",
            [2] = "免 战",
            [3] = "免战8小时",
            [4] = "使用期间挑战其他玩家将解锁免战",
            [5] = "选择对手",
            [6] = "当前精力:",
            [7] = "每次挑战消耗   点",
            [8] = "护符",
            [9] = "使用护符可免于被挑战",
            [10] = "拥有宝物某一碎片后，即可通过挑战获得宝物的所有碎片",
            [11] = "未能获得碎片",
            [12] = "战斗胜利",
            [13] = "得到碎片：",
            [14] = "魔王大人~请抽取战斗奖励：",
            [15] = "奖励",
            [16] = "恭喜魔王大人获得",
            [17] = "连续挑战结算",
            [18] = "魔王大人~请查看战斗奖励",
            [19] = "挑战    次，第    次获得                 连续",
            [20] = "挑战终止！",
            [21] = "挑战    次，没有获得碎片   连续挑战终止！",
            [22] = "每次抢夺消耗        点",
            [23] = "抢夺    次，第    次抢夺到    连续",--抢夺    次，第    次抢夺到    连续    次
        },
        set = {
            [1] = "输入兑换码",
            [2] = "客服中心",
            [3] = "官方QQ群：",
            [4] = "客服邮箱：",
            [5] = "亲，发现问题请及时反馈我们哦！",
            [6] = "清 空",
        },
        shop = {
            [1] = "是否购买？",
            [2] = "今天还可购买            个",
            [3] = "售价：",
            [4] = "道具详情",
            [5] = "招  募",
            [6] = "首次元宝单抽必出",
            [7] = "点击屏幕返回",
            [8] = "拥有:",
            [9] = "今日还可购买      次",
            [10] = "（每日0点刷新）",
            [11] = "总价：",
            [12] = "新武将赠送结束倒计时：",
            [13] = "已拥有伙伴自动转换为魂魄",
            [14] = "额外获得",
            [15] = "今日可兑换      次",
            [16] = "十连抽(xxx)折优惠中，结束倒计时: %s",
            [17] = "元宝兑换%d",
            [18] = "当前拥有道具数量:",
            [19] = "购买卷轴",
            [20] = "转十次",
            [21] = "转一次",
            [22] = "大奖记录",
            [23] = "转%s次",
            [24] = "拜十次",
            [25] = "拜一次",
            [26] = "购买烧酒",
            [27] = "购买灵石",
            [28] = "购买令牌",
            [29] = "转百次",
        },
        slotlist = {
            [1] = "布阵",
            [2] = "前 排",
            [3] = "后 排",
            [4] = "拖拽伙伴头像更换上阵伙伴和伙伴位置",
            [5] = "魔 宠",
            [6] = "魔吕布布阵",
            [7] = "如来布阵",
            [8] = "当前为如来布阵",
            [9] = "当前为魔吕布布阵",
        },
        slotsinfo = {
            [1] = "神石属性",
            [2] = "升级消耗：",
            [3] = "神石需要依次激活和强化",
            [4] = "增加所有上阵伙伴属性",
            [5] = "命中:",
            [6] = "暴击:",
            [7] = "增伤:",
            [8] = "减伤:",
            [9] = "暴伤:",
            [10] = "所有小伙伴等级",
            [11] = "所有小伙伴突破等级",
            [12] = "添加有缘分的伙伴即可激活上阵伙伴的缘分加成或合体技",
            [13] = "神石",
            [14] = "点我可上阵新的伙伴",
            [15] = "技能",
            [16] = "合体技",
            [17] = "助阵位置全部开启且上满小伙伴可激活",
        },
        soul = {
            [1] = "消耗:",
            [2] = "装备：",
            [3] = "命格详情",
            [4] = "未装备的命格才会被分解",
            [5] = "命格介绍",
            [6] = "有几率可激活：",
            [7] = "可以获得命格：",
            [8] = "绿 色",
            [9] = "蓝 色",
            [10] = "紫 色",
            [11] = "橙 色",
            [12] = "拥 有:",
            [13] = "元宝猎命    可获得元命",
            [14] = "猎十次",
        },
        start = {
            [1] = "开服狂欢",
            [2] = "领奖倒计时：",
            [3] = "帮 助",
            [4] = "抢购福利",
            [5] = "第七日登录就送橙色武将",
            [6] = "点击继续",
            [7] = "小提示：礼包低折限量出售，越早购买，享受的价格越低",
        },
        worldboss = {
            [1] = "伤害血量：",
            [2] = "伤害排名前十的玩家可以获得额外奖励",
            [3] = "上次战况",
            [4] = "我是一个大BOSS呀～\n我有许多的小秘密哦～",
            [5] = "就不告诉你～\n     就不告诉你～～～～",
            [6] = "你想知道那个秘密？",
            [7] = "打败我就告诉你一个\n          秘密哦！",
            [8] = "秘密太多了~\n           说那个呢？",
            [9] = "结束倒计时",
            [10] = "自动战斗",
            [11] = "贵族5可自动攻击",
            [12] = "上次战况",
            [13] = "挑战                可获得",
            [14] = "魔宠碎片",
            [15] = "上一轮前三名：",
            [16] = "上次战斗boss未被击杀",
            [17] = "上一轮击杀：",
            [18] = "每天        开启",
            [19] = "开启倒计时：",
            [20] = "BOSS战已经开始了，快挑战吧！",
            [21] = "浴火重生",
            [22] = "复活倒计时：",
            [23] = "立即复活攻击增加100%",
            [24] = "伤害排行",
            [25] = "角色",
            [26] = "总伤害",
            [27] = "攻击       次，总伤害：",
            [28] = "击杀者",
        },
        zhuxiantai = {
            [1] = "BOSS等级: ",
            [2] = "今日可兑换     次",
            [3] = "        可兑换     次",
            [4] = "第",
            [5] = "层",
            [6] = "最高星数：",
            [7] = "当前累计得星：",
            [8] = "每5关可以使用一次星数加成属性",
            [9] = "立即完成",
            [10] = "灭神殿",
            [11] = "通关条件：",
            [12] = "可失败次数：",
            [13] = "当前",
            [14] = "挑战星级越高，奖励越丰厚",
            [15] = "欢迎光临灭神殿商店，这里\n的商品任您采购！",
            [16] = "当前积分：",
            [17] = "点击选择需要的属性加成",
            [18] = "当前加成",
            [19] = "闪避：",
            [20] = "格挡：",
            [21] = "灭神殿奖励",
            [22] = "首 胜",
            [23] = "日 常",
            [24] = "灭神殿排行",
            [25] = "您的灭神殿排名：",
            [26] = "己方阵营",
            [27] = "敌方阵营",
            [28] = "拖动头像可调整己方站位",
            [29] = "剩余星数：",
        },
        windows = {
            [1] = "（王的男人已上阵）",
            [2] = "分享",
            [3] = "新功能开启",
            [4] = "级" ,
            [5] = "啦",
            [6] = "请输入新名字",
            [7] = "留 言",
            [8] = "魔王大人英勇无敌，扫平三界为期不\n远，特奉上小小膜拜金，还请笑纳！",
            [9] = "双倍掉落中……",
            [10] = "使 用",
            [11] = "礼包购买",
            [12] = "升级奖励",
        },
        pop_ups = {
            [1] = "热卖",
            [2] = "剩余兑换次数：",
            [3] = "夺宝商店",
            [4] = "走过路过，不要错过！",
            [5] = "大家快来看一看啊！",
            [6] = "当前夺宝点：",
            [7] = "去公会",
            [8] = "黑市商店",
            [9] = "下次刷新时间：",
            [10] = "可购买次数：",
            [11] = "神魂商店",
            [12] = "当前魂蛋：",
            [13] = "免费刷新次数：",
            [14] = "使用神秘刷新令或     元宝可以刷新一次",
            [15] = "去炼化",
            [16] = "当前免费刷新次数    次",
            [17] = "当前可使用神秘刷新令      次",
            [18] = "竞技场商店",
            [19] = "每日0点会获得竞技场排名奖励",
            [20] = "拥有积分：",
            [21] = "去竞技场",
            [22] = "   您的网络已断开\n请耐心等待重新连接",
            [23] = "获取途径",
            [24] = "获取途径：",
            [25] = "暂无获取途径",
            [26] = "本次活动可随机到的物品",
            [27] = "下载更新",
            [28] = "邀请好友送大礼",
            [29] = "限时商店",
            [30] = "距离下次免费刷新还剩：",
            [31] = "1.在本活动中，每消费元宝刷新   次或每消费     元宝，\n   增加幸运值   点；",
            [32] = "2.幸运值越高，刷新出的        物品几率越高；",
            [33] = "3.幸运值达到       时，下次手动刷新必出现  个超值",
            [34] = "橙色物品！",
            [35] = "灭神殿商店",
            [36] = "欢迎光临灭神殿商店，这里\n的商品任您采购！",
            [37] = "去灭神殿",
            [38] = "（前      名）",
            [39] = "助战规则",
            [40] = "1. 点击想要挑战的关卡后，需要选择一名好友一起挑战。",
            [41] = "2. 战斗时好友先出场，阵亡后则玩家出场。",
            [42] = "3. 每天3次挑战机会，零点挑战次数重置。",
            [43] = "4. 挑战次数不足时可用元宝购买。",
            [44] = "当前魂蛋:",  
            [45] = "本次刷新花费",
            [46] = "好友选择", 
            [47] = "建议在wifi环境下下载更新", 
        },
        sdk = {
            [1] = "网络连接失败,是否重新连接？",
            [2] = "你确定要退出游戏吗？",
            [3] = "请下载最新版本游戏",
            [4] = "没有接入分享功能",
            [5] = "当前客户端版本过低，翅膀无法显示，请下载最新客户端",
        }, 
        olderDriver = {
            [1] = "活动结束时间: ",
            [2] = "上 车",
            [3] = "请先上车",
            [4] = "已上车",
            [5] = "进度：",
            [6] = "想要得到以下福利，你得先上我！额，不，是上车！",
            [7] = "老司机",
            [8] = "刷卡上车老司机就会以身相许",
            [9] = "滴滴，快上车，马上要发车了～",
            [10] = "魂 魄",
            [11] = "当前拥有",  
        },
        olderDriver2 = {
            [1] = "活动结束时间: ",
            [2] = "送 礼",
            [3] = "请先送礼",
            [4] = "已送礼",
            [5] = "进度：",
            [6] = "刷礼物嘛，刷礼物人家就陪你。还直播滴风油精哦~",
            [7] = "网红",
            [8] = "送礼网红陪你一起辣眼睛",
            [9] = "风油精，棒棒哒。",
        },
        olderDriver3 = {
            [1] = "活动结束时间: ",
            [2] = "请 安",
            [3] = "请先请安",
            [4] = "已请安",
            [5] = "进度：",
            [6] = "你也是偶染风寒，身子骨儿有些懒惰吗？还不赶紧滚来请安！",
            [7] = "宫心计",
            [8] = "哼! 本宫让你知道什么是步步惊心!",
            [9] = "然而我并不会抚琴。",
        },
        tigerChicken = {
            [1] = "开始十次",
            [2] = "开始一次",
            [3] = "结束时间: ",
            [4] = "可兑换次数:",
            [5] = "兑换次数不足",
            [6] = "老虎鸡兑换",
            [7] = "恭喜!",
            [8] = "老虎鸡",
            [9] = "开封有个关二爷～",
            [10] = "哈哈～哈哈～",
            [11] = "1.使用元宝进行抽奖，抽奖可以获得伙伴魂魄，有概率获得本期大奖；",
            [12] = "2.每进行一次抽奖，系统还会额外赠送积分，积分可以在商店中兑换伙伴魂魄；",
            [13] = "3.每期活动都有特定大奖，每次抽奖会增加幸运值，幸运值满时必得大奖，一旦抽到大奖以后幸运值清零;",
            [14] = "4.当活动结束后，系统会自动清除剩余的积分。",
            [15] = "当前拥有",
        },  
        passkill = {
            [1] = "积分排名",
            [2] = "排名奖励",
            [3] = "斩将排行",
            [4] = "过关斩将商店",
            [5] = "挑战结束倒计时：",
            [6] = "斩将积分：",
            [7] = "斩将币：",
            [8] = "奖励倒计时：",
            [9] = "~",
            [10] = "换一批",
            [11] = "免费换对手次数：",
            [12] = "每次换对手消耗：",
            [13] = "积分：",
            [14] = "获得斩将币：",
            [15] = "在这里可以兑换觉醒需要的物品哦",
            [16] = "1.胜负都消耗挑战次数",
            [17] = "2.战斗失败不给予斩将积分，斩将币减半",
            [18] = "3.每周一0点更新积分排名奖励，以邮件形式发放",
            [19] = "4.获得的斩将币可在商店内兑换稀有物品",
            [20] = "获得银币：",
            [21] = "未进榜",
            [22] = "拥有斩将币：",
            [23] = "去斩将",
            [24] ="消耗",
        }, 
        chamipon = {
            [1] = "冠军试炼商店",
            [2] = "宝藏",
            [3] = "说明",
            [4] = "商店",
            [5] = "当前胜场：",
            [7] = "当前试炼点：",
            [8] = "距离下次刷新：",
            [9] = "可挑战次数：",
            [10] = "重新开始",
            [11] = "当前开启免费",
            [12] = "开启后获得以下物品：",
            [13] = "1.冠军的试炼产出装备进阶材料。",
            [14] = "    1)战胜据点可以获得试炼点奖励，据点是以匹配的玩家作为敌方，敌方战斗力越高，试炼点奖励越多。",
            [15] = "    2)试炼点可以在试炼商店中兑换各种装备进阶资源。",
            [16] = "    3)一共有4个关卡，每个关卡通关后，可以开启关卡宝藏，关卡越高，奖励越丰富。",
            [17] = "2.每轮有12次挑战次数，每挑战一次据点，无论是胜败，均消耗一次挑战次数，次数用完后不可挑战。",
            [18] = "3.击败据点后，可以挑战相邻据点，击败最后一排据点，可以开启试炼宝藏。",
            [19] = "4.每个宝藏有1次免费、4次元宝开启机会，免费未使用无法进入下一关。",
            [20] = "5.进入下一关后，无法回到前面的关卡。",
            [21] = "获得试炼点：",
            [22] = "打 开",
            [23] = "试炼点",
        },  
        story = {
            [1] = "这是一幅好皮相，不屈的眼神，浪荡的胸怀，狂拽酷炫流，就是他了，快来附体吧！",
            [2] = "我还能说什么呢，做为一个兽主角，天生就拥有不走寻常路的决心，啪嗒砰，我就是有特色~",
            [3] = "美美哒，身为一个漂亮的妹纸怎么能够不漂亮呢~哎呀，又有小伙伴了呢，一起去三界玩耍吧！",
        },
        activity_fashion = {
            [1] = "下级获得强化属性：",
            [2] = "前往魔宫",
            [3] = "点击屏幕跳过",
            [4] = "前往查看",
            [5] = "限时",
            [6] = "五折",
            [7] = "当前强化等级：",  
            [8] = "时装技能",
            [9] = "时装属性",
            [10] = "强化材料",
            [11] = "强化预览",
            [12] = "排名",
            [13] = "角色名称",
            [14] = "积分",
            [15] = "胜率",
            [16] = "本级基础属性",
            [17] = "下级基础属性",
            [18] = "活动结束倒计时：",
            [19] = "时装",
            [20] = "限时折扣",
            [21] = "原价:            元宝",
            [22] = "下级获得强化属性：",
            [23] = "回收倒计时："--回收倒计时：
        },
        wudaohui = {
            [1] = "仙豆：",
            [2] = "连胜",
            [3] = "首胜奖",
            [4] = "五胜奖",
            [5] = "十战奖",
            [6] = "今日匹配次数:",
            [7] = "段位",
            [8] = "每次抽奖必得神石",
            [9] = "抽 奖",
            [10] = "现有仙豆：",
            [11] = "消耗仙豆：",
            [12] = "去武道会",
            [13] = "当前段位：",
            [14] = "取消匹配",
            [15] = "1.每周一、三、五 20:30~21:00 开启",
            [16] = "2.系统会自动分配为【贪狼】或【破军】阵营",
            [17] = "3.每次活动可以进行10场战斗，每场战斗会结算获得的积分数",
            [18] = "4.历史总积分可以解锁新段位，还可以在抽奖商店中进行抽奖",
            [19] = "5.积分排行榜前三的玩家，在下次活动中角色名称会带有闪烁特效",
            [20] = "6.每次活动结束，阵营总积分最高的判定为胜利，在该阵营中的所有玩家获得奖励",
            [21] = "转盘",
        },
        pigRule = {
            [1] = "1.圆梦分为低档，中档，高档，档次越高所需要的冷却时间就越长，所获得的奖励就越丰盛；",
            [2] = "2.冷却时间结束以后会获得好感度和银币奖励；",
            [3] = "3.累计到指定的好感度时，可以领取宝箱奖励；",
            [4] = "4.好感度可以在商店中兑换物品；",
            [5] = "5.总好感度累计到一定的值以后才能够进入排行榜；",
            [6] = "6.排行榜会根据好感度进行排名，排名越高奖励越丰富，活动结束后根据排名发送邮件奖励；",
            [7] = "7.美梦活动结束以后，没领取的奖励会通过邮件发送，奖励中包含的好感度不会累计到排行榜中；",
            [8] = "8.圆梦商店活动结束后会清除剩余的好感度，为了避免损失，请尽快使用您的好感度。",
        }, 
        maskRule = {
            [1] = "1.每个站位中都有1个魔罩；",
            [2] = "2.魔罩可以升级，升级需要消耗材料，升级成功可以提升吸收伤害值；",
            [3] = "3.魔罩等级升到指定等级时需要突破，突破成功可以提升吸收百分比，改变魔罩外观；",
            [4] = "4.吸收伤害值越高，在战斗中可抵消的伤害就越多；",
            [5] = "5.吸收百分比越高，在战斗中每次可抵消的伤害就越多；",
            [6] = "6.达成恋蛋大湿中的条件，可以增加全队伍属性；",
            [7] = "7.吸收伤害值和吸收百分比在战斗中不会恢复，人物死亡自动消失。",
        },
        goddown = {
            [1] = "活动截止时间",
            [2] = "说明",
            [3] = "八戒美梦",
            [4] = "好感度：",
            [5] = "总好感度",
            [6] = "圆梦榜",
            [7] = "兑换",
            [8] = "完成圆梦即可获得好感度，银币奖励",
            [9] = "选择圆梦档次",
            [10] = "奖励",
            [11] = "返 回",
            [12] = "跨服美梦",
            [13] = "圆梦截止时间",
            [14] = "兑换截止时间",
            [15] = "圆梦结束后24小时内仍可在商店兑换奖励",
            [16] = "本次活动已结束，当前不可圆梦",
            [17] = "已结束",
        },

        activityRank = {
            [1] = "排行榜前           名可以获得",
            [2] = "丰厚奖励！",
            [3] = "我的排名：",
            [4] = "快去提升吧！",
            [5] = "活动倒计时：",

            [6] = "未完成",
            [7] = "可领取",
            [8] = "已领取",

            [9] = "1.",
            [10] = "2.",
            [11] = "3.",
            [12] = "已结束",
            [13] = "我的分数：",
            [14] = "未上榜",



            [100] = "我的",
            [101] = "等级：",
            [102] = "战力：",
            [105] = "翅膀等级：",
            [106] = "副本进度：",
            [107] = "魔罩等级：",
            [118] = "伙伴战力：",
            [111] = "战力成长：",
            [112] = "魔符战力：",
            [113] = "战力成长：",
            [114] = "战力成长：",
            [115] = "命格战力：",
            [116] = "法宝战力：",
            [117] = "神器评分：",

            [201] = "等级排行榜",
            [202] = "战力排行榜",
            [205] = "翅膀等级排行榜",
            [206] = "副本进度排行榜",
            [207] = "魔罩等级排行榜",
            [218] = "伙伴战力排行榜",
            [211] = "战力成长排行榜",
            [212] = "魔符战力排行榜",
            [213] = "战力成长排行榜",
            [214] = "战力成长排行榜",
            [215] = "命格战力排行榜",
            [216] = "法宝战力排行榜",
            [217] = "神器评分排行榜",


        },


        deployment = {
            [1] = "灵阵图",
            [2] = "阵法加成",
            [3] = "阵型:",
            [4] = "全阵基础属性加成:",
            [5] = "拖拽伙伴可以更换伙伴位置",
            [6] = "阵法升级",
            [7] = "未达到",
            [8] = "已达到",
            [9] = "使用中",
            [10] = "消耗物品:",
            [11] = "已达成",
        },

        safemask = {
            [1] = "吸收伤害值",
            [2] = "吸收百分比",
            [3] = "全队属性加成",
            [4] = "魔罩",
            [5] = "折扣倒数计时：",
            [6] = "魔罩飞升等级已满",
            [7] = "飞升",
        },

        wing = {
            [1] = "使用中",
            [2] = "使 用",
            [3] = "染 色",
            [4] = "翅膀未激活",
            [5] = "本阶翅膀不可染色",
            [6] = "返 回",
            [7] = "翅膀满10级星后即可进阶操作",
            [8] = "属性加成",
            [9] = "资质",
            [10] = "激 活",
            [11] = "自动升星",
            [12] = "材料不足，无法升星",
            [13] = "所需材料",
            [14] = "，爆击",
            [15] = "倍",
            [16] = "获得经验：",
            [17] = "升星中",
            [18] = "成功率：",
            [19] = "%",
            [20] = "每次失败会提高5%的成功率",
            [21] = "进阶失败会损失道具，同时扣除翅膀星级1级",
            [22] = "进 阶",
            [23] = "材料不足，无法进阶",
            [24] = "进阶失败！",
            [25] = "您未使用［太虚神印］，进阶失败会使翅膀星级-1，是否继续？",
            [26] = "点击屏幕继续",
            [27] = "进阶失败！",
            [28] = "使用太虚神印失败不掉星",
        },

        cuprank = {
            [1] = "俺老孙告诉你！每周积分前          的玩家，自动成为跨服战的选手~",
            [2] = "名",
            [3] = "距离下次跨服战时间：",
            [4] = "跨服战开启时，重新计算积分",
            [5] = "每天杯赛结束更新排行榜",
            [6] = "A组",--A组
            [7] = "B组",--B组
            [8] = "C组",--C组
            [9] = "D组",--D组
            [10] = "E组",--E组
            [11] = "F组",--F组
            [12] = "G组",--G组
            [13] = "H组",--H组   
            [14] = "第%s轮比赛：周%s~周%s",
            [15] = "参赛名单",--
            [16] = "上交［上古卷轴］可以获得意外奖励！",-- 
        },

        servicewarlist = {
            [1] = "人榜冠军",
            [2] = "地榜冠军",
            [3] = "天榜冠军",
            [4] = "仙榜冠军",
            [5] = "神榜冠军",
        },
        servicewar = {
            [1] = "(每",
            [2] = "个增加1%)",
            [3] = "今日可上交数量: ",
            [4] = "上 交",
            [5] = "今日上交数量已达上限",
            [6] = "上传阵容",
            [7] = "上传阵容成功",
            [8] = "上传阵容失败",
            [9] = "个人战绩",
            [10] = "小组赛",
            [11] = "冠军赛",
            [12] = "胜利",
            [13] = "失败",
            [14] = "淘汰赛",
            [15] = "海选赛",
            [16] = "查 看",
            [17] = "领 取",
            [18] = "海选赛结束后系统会选出积分最高的64名玩家进入小组赛",
            [19] = "小组赛结束后获得小组冠军的玩家进入冠军赛",
            [20] = "距离跨服战结束时间:",
            [21] = "距离海选赛时间:",
            [22] = "跨服战火热进行中，可以在小组赛或冠军赛中进行押注哦！",
            [23] = "  海选赛筹备中，周三13点－18点开始进行海选赛，每5分钟进行一轮",
            [24] = "该场比赛未开始",
            [25] = "每天只能膜拜一次！",
            [26] = "膜拜本服玩家可获得双倍奖励！",
            [27] = "膜拜",
            [28] = "已膜拜",
            [29] = "上交了",
            [30] = "个上古卷轴",
            [31] = "押注成功",
            [32] = "押注失败",
            [33] = "第一场",
            [34] = "第二场",
            [35] = "第三场",
            [36] = "胜",
            [37] = "竞猜",
            [38] = "下 注",
            [39] = "本轮比赛剩余最大押注限额:",
            [40] = "下注成功后，奖励将发至邮箱",
            [41] = "比赛时间：周%s~周%s",
            [42] = "倍率：",
            [43] = "倍",
            [44] = "押注人数:",
            [45] = "当前拥有银币数量:",
            [46] = "请押注",
            [47] = "银币超过最大押注上限",
            [48] = "猜对可获得:",
            [49] = "本服积分排名",
            [50] = "跨服积分排名",
            [51] = "奖励内容",
            [52] = "每轮比赛结束后发送对应奖励",
            [53] = "玩家名称",
            [54] = "所在服务器",
            [55] = "海选赛结束后系统会自动选出星级最高的64名玩家进入小组赛",
            [56] = "杯赛积分",
            [57] = "比赛积分",
            [58] = "冠军次数",
            [59] = "被膜拜次数",
            [60] = "总积分数",
            [61] = "未上榜",
            [62] = "查 看",  
            [63] = "历届冠军", 
            [64] = "所有属性提升", 
            [65] = "上周杯赛积分最高的%s名玩家作为本次參赛人员",
            [66] = "晋级赛",
            [67] = "只可在自身赛区内押注。",
            [68] = "突围赛筹备中，周六8点－9点40分开始进行突围赛，每5分钟进行一轮",
            
            [69] = "小组赛结束后获得小组冠军的玩家进入8强赛",
            [70] = "8强赛结束后获胜的玩家进入半决赛",
            [71] = "半决赛结束后获胜的玩家进入决赛",
            [72] = "决赛结束后获胜的玩家将成为%s",
            [73] = "决赛结束后获胜的玩家将成为晋级赛冠军",
            [74] = "突围赛结束后系统会选出积分最高的20名玩家进入8强赛",
            [75] = "上周杯赛积分最高的16名玩家作为本次参赛人员",
            [76] = "通过海选赛系统会选出积分最高的64名玩家进入小组赛",
            [77] = "通过突围赛系统会选出积分最高的8名玩家进入8强赛",
        },

        playerrecall = {
            [1] = "成功召回老玩家后可领取",
            [2] = "已接受召回",
            [3] = "接受召回",
            [4] = "今日可购买次数:",
            [5] = "产出",
            [6] = "倍",
            [7] = "请输入召回码",
            [8] = "请输入有效的召回码",
            [9] = "复制",
            [10] = "复制成功",
            [11] = "玩家需要达到35级才可以输入召回码",
        },
        luanpan_rule = {
            [1] = "1.每转动1次转盘可以获得10积分",
            [2] = "2.积分达到一定数量可以兑换对应的道具",
            [3] = "3.每日一次免费转转盘机会，免费后19次付费转转盘机会",
            [4] = "4.转动转盘次数越多，价格越贵",
        },

        network = {
            [1] = "网络连接中断......",
            [2] = "游戏登录......",
            [3] = "游戏登录...",
        }, 

        nightclub = {
            [1] = "简 介",
            [2] = "获得奖励",
            [3] = "选择伙伴",
            [4] = "选 择",
            [5] = "修炼中",
            [6] = "战斗力：",
            [7] = "概率获得",
            [8] = "点击选择档次",
            [9] = "时间:",
            [10] = "消息记录",
            [11] = "累计奖励",
            [12] = "当前没有奖励可领取",
            [13] = "灌溉次数：",
            [14] = "被灌溉次数：",
            [15] = "好友灌溉",
            [16] = "该好友不可被灌溉",
            [17] = "聊 天",
            [18] = "前 往",
            [19] = "好友被灌溉次数已满",
            [20] = "已为你灌溉",
            [21] = "(已帮助)",
            [22] = "(可帮助)",
            [23] = "确 定",
            [24] = "已帮助该好友",

        },  
        kuafuzhan = {
            [1] = "1.开服时间≥7天开启跨服战;",
            [2] = "2.跨服战分为3个赛区，人榜（开服时间       天），天榜（开服时间       天），神榜（开服时间      天以上）",
            [3] = "3.跨服战每周一开始，每周日结束;",
            [4] = "4.系统自动选出杯赛总积分最高的16名玩家做为参赛者;",
            [5] = "5.参赛者需要在上古神兽中进行【上传阵容】，若没有进行此操作，系统则会默认为周一零点阵容做为比赛阵容;",
            [6] = "6.周一至周二全服玩家可以将{上古卷轴}上交给上古神兽，上交上古卷轴可以获得随机物品的奖励;",
            [7] = "7.周三上午8点到18点进行海选赛，海选赛中随机匹配对手，每30分钟进行一轮比赛，一共20轮比赛;",
            [8] = "8.每轮比赛给与一个比赛积分，海选赛结束后系统选出积分最高的64名玩家进入小组赛;",
            [9] = "9.小组赛分为8组，每组8个成员，采用3局2胜制度，最终选出各个小组冠军进入冠军赛;",
            [10] = "10.周四15:00~16:00进行32强赛事，19:00~20:00进行16强赛事;",
            [11] = "11.周五15:00~16:00进行8强赛事，19:00~20:00进行4强赛事;",
            [12] = "12.周六15:00~16:00进行半决赛，19:00~20:00进行决赛;",
            [13] = "13.所有玩家可以在每天开赛前对当天的比赛押注;",
            [14] = "14.如果押注的对象当天获胜晋级，则押注玩家可以获得对应的倍数奖励;",
            [15] = "15.获得冠军的玩家可以享受7日的限时时装，7日的上线全服通告。",
            [16] = "1.每场杯赛胜利获得n点积分;",
            [17] = "2.跨服战开启时，系统自动筛选出积分最高的16名玩家做为参赛者;",
            [18] = "3.每天杯赛结束后系统会累计本场杯赛获赠的积分;",
            [19] = "4.跨服战开启时，系统将清空所有积分，重新进行累计;",
            [20] = "1.所有玩家每天可膜拜一次;",
            [21] = "2.每天只能对一个上届冠军进行膜拜;",
            [22] = "3.膜拜本服玩家可获得双倍奖励。",        
        },
        playerreturn = {
            [1] = "魔王回归",
            [2] = "亲爱的魔王大人，欢迎回到《作妖计》，为了帮您迅速的恢复实力，我们为您准备了丰厚的奖励，快去享受吧！",
            [3] = "福利",
            [4] = "召回老玩家送大礼",
            [5] = "召回成功",
            [6] = "“                     ”是指：接受召回的老玩家在对应的活动中输入你的召回码",
            [7] = "成功召回玩家:",
            [8] = "我的召回码：",
        },  
        vipfuli = {
            [1] = "折扣",
            [2] = "折扣价：",
            [3] = "贵族特权每日均可：",
            [4] = "购买一次折扣礼包",
            [5] = "领取一次免费礼包",
            [6] = "贵族 %d 特权每日福利",
            [7] = "当前等级",
        }, 
        activityachievements = {
            [1] = "限时成就",
            [2] = "活动期间内，达成指定条件，即可领取对应奖励！",
        },      
        exchangeMore = {
            [1] = "多次兑换",
            [2] = "一共可以兑换%s次",
            [3] = "兑换次数已用完",
            [4] = "多次购买",
            [5] = "一共可以购买%s次",
        },
        activityQualityLunpan = {
            [1] = "普 通",
            [2] = "精 良",
            [3] = "史 诗",
            [4] = "抽奖",
            [5] = "抽奖十次",
        },

        triggerGift = { --限时礼包
            [1] = "限时礼包",
        },
        propsRecovery = { --道具回收
            [1] = "回收总价：",--回收总价：
        },  
        adCueboard = {
            [1] = "看广告",
            [2] = "返 回",
            [3] = "观看一小段广告后会立即聚宝一次,本次聚宝不会消耗今日聚宝次数。\n今日剩余%s次",
        },
        greatGiftByAD = {
            [1] = "看广告",
            [2] = "可领奖",
            [3] = "已领奖",
            [4] = "今日奖励已全部领取完毕",
            [5] = "广告显示错误",
            [6] = "广告加载超时",
            [7] = "正在加载广告，请稍等",
        },
    },

    fixedStringA = {
        [1] = "彩球",
        [2] = "斩将币",
        [3] = "粽子",
        [4] = "隊伍經驗",
        [5] = "充值積分",
        [6] = "游戏机积分",
        [7] = "获得%d游戏机积分",
        [8] = "恭喜%s,迎财神获得%s元宝！",
        [9] = "物品兑换限制",
        [10] = "不限次数",
        [11] = "仅限%d次",
        [12] = "充值元宝, %d倍返还",
        [13] = "活动期间，以下额度均能获得%d倍 \n元宝。每个额度",
        [14] = "%d (充值获得) + %dx%d (额外返还) =   %d 元宝",
        [15] = "剩余%d 次",
        [16] = "折扣倒计时：",
        [17] = "本周已购买",
        [18] = "本月已购买",
        [19] = "%s折",
        [20] = "开服%s天后开启",
        [21] = "魔宠技能：%s升级",
        [22] = "魔宠等级已达到上限，无法再进阶",
        [23] = "进至3阶可升红品",
        [24] = "进阶至红品得红色技能点",
        [25] = "激活%s",
        [26] = "队伍达到%s级,才能进阶到下阶",
        [27] = "进阶材料不足",
        [28] = "队伍等级：%s/%s",
        [29] = "魔宠进阶到: ",
        [30] = "魔宠进阶等级不足",
        [31] = "普通洗炼不可自动洗炼",
        [32] = "回收倒计时：",
        [33] = "等级不足，%s级或贵族%s开启！",
        [34] = "工匠锻造不可自动锻造",
        [35] = "自动锻造",
        [36] = "%s    ( 已領取 %s/次 ) ",
        [37] = "斩将币不足",
        [38] = "规则",
        [39] = "第%s轮比赛: 周%s %s:%s~周%s %s:%s",
        [40] = "走向巅峰",
        [41] = "今日已获得",
        [42] = "今日未获得",
        [43] = "获得今日龙珠",
        [44] = "好运当头，前进一步！",
        [45] = "雨天路滑，后退一步！",
        [46] = "好运当头，前进两步！",
        [47] = "雨天路滑，后退两步！",
        [48] = "该走哪个路口呢？",
        [49] = "偶遇宝藏，获得奖励！",
        [50] = "途中偶遇，会碰到哪位仙子呢？",
        [51] = "如有天助，获得骰子！",
        [52] = "倒计时：",
        [53] = "十连抽%s折优惠中，结束倒计时：",
        [54] = "贵族%s以上开启",
        [55] = "消耗%s元宝",
        [56] = "本周还可购买            次",
        [57] = "贵族%s以上可购买",
        [58] = "本周购买次数已用完",
        [59] = "该区正在维护，请选择其他区游戏",
        [60] = "调试模式开启",
        [61] = "正在登陆中请稍后",
        [62] = "获得%s%s",
        [63] = "升级成功",
        [64] = "技能品质提升成功",
        [65] = "协助%s次",
        [66] = "挑战%s次",
        [67] = "体力%s",
        [68] = "精力%s",
        [69] = "重置%s次",
        [70] = "等级不足",
        [71] = "请先挑战过%s",
        [72] = "您没有挑战次数了",
        [73] = "技能详情",
        [74] = "上阵伙伴%s",
        [75] = "是否消耗1点橙色技能点提升该技能品质？",
        [76] = "橙色技能点不足",
        [77] = "开始洗炼",
        [78] = "请选择次数",
        [79] = "已保存！",
        [80] = "未保存！",
        [81] = "第%s次 (洗炼x10)",
        [82] = "%s不足",
        [83] = "自动洗炼完成",
        [84] = "(红色+%s激活)",
        [85] = "(+%s激活)",
        [86] = "开始锻造",
        [87] = "第%s次 (锻造x10)",
        [88] = "自动锻造完成",
        [89] = "充值立即获得%s元宝",
        [90] = "招百次",
        [91] = "第一场",
        [92] = "第二场",
        [93] = "第三场",
        [94] = "观看",
        [95] = "胜",
        [96] = "竞猜",
        [97] = "下注",
        [98] = "本轮比赛剩余最大押注限额：",
        [99] = "下注成功后，奖励将发至邮箱",
        [100] = "比赛时间：过%s %s:%s ~ 过%s %s:%s",
        [101] = "战斗力：%s",
        [102] = "倍率：%s倍",
        [103] = "押注人数: ",
        [104] = "当前拥有银币数量：%s",
        [105] = "请押注",
        [106] = "银币超过最大押注上限",
        [107] = "猜对可获得:%s",
        [109] = "有我在此！谁也别想从这里过去！",
        [110] = "溜 走",
        [111] = "战 斗",
        [112] = "贿 赂",
        [113] = " 大王叫我來巡山～呔！前方何人？报上名來！",
        [114] = "还可购买%s次",
        [115] = "购买次数已用完",
        [116] = "稍 后",
        [117] = "今日还未完成",
        [118] = "需要队伍等级达到%s级",
        [119] = "队伍%s级",
        [120] = "银币",
        [121] = "是否消耗%s升级奖励？",
        [122] = "是否升级奖励？",
        [123] = "复制成功",
        [124] = "超级",
        [125] = "特级",
        [126] = "高级",
        [127] = "贵族客服微信：",
        [128] = "绑定平台账号安全。放心拿宝贝！还在咩啊！小妖们都拿了！！",
        [129] = "为《喵剑客》点“赞”拿好礼～",
        [130] = "赞",
        [131] = "分享《喵剑客》,拿开服好礼~",
        [132] = "是指:",
        [133] = "接受召回的老玩家在对应的活动中输入你的召回码",
        [134] = "亲爱的魔王大人，欢迎回到《作妖计》，为了帮您迅速的恢复实力，我们为您准备了丰厚的奖励，快去享受吧！",
        [135] = "活动期间，                   达到相对应\n\n的额度即可获得                      ！",
        [136] = "单充好礼",
        [137] = "单充送礼",
        [138] = "活动期间,每日只需充值                    以上，即可获得以下豪华大礼！",
        [139] = "已累计充值天数:",
        [140] = "礼包",
        [141] = "月礼包",
        [142] = "单笔充值                    以上并启动月卡与终生卡，可在活动期间累计领取月计划中价值          的资源奖励！",
        [143] = "藏经阁商店",
        [144] = "男",
        [145] = "女",
        [146] = "兽",
        [147] = "现有:",
        [148] = "所选次数需花费:",
        [149] = "洗炼次数",
        [150] = "洗炼",
        [151] = "请选择保留内容",
        [152] = "伤害:",
        [153] = "我的公会排名:",
        [154] = "贡献排行榜",
        [155] = "周四15:00～16:00第一轮比赛",
        [156] = "周四19:00～20:00第二轮比赛",
        [157] = "周五15:00～16:00第三轮比赛",
        [158] = "周五19:00～20:00第一轮比赛",
        [159] = "周六15:00～16:00第二轮比赛",
        [160] = "周六19:00～20:00第三轮比赛",
        [161] = "锻造",
        [162] = "锻造次數",
        [163] = "等级已达到上限",
        [164] = "提升品质",
        [165] = "当前技能点",
        [166] = "锁定:",
        [167] = "魔符升级",
        [168] = "竞 拍",
        [169] = " 一口价:",
        [170] = "当前竞价:",
        [171] = "竞拍价格",
        [172] = "日 志",
        [173] = "是否花费                   一口价竞拍？",
        [174] = "集齐七颗龙珠，召唤神龙即可领取大奖",
        [175] = "随机获得以上奖励中的一个",
        [176] = "再看看",
        [177] = "选这个",
        [178] = "年轻人，我看你骨骼清奇，我这有一堆适合你的好货，你要不要呀？？",
        [179] = "离 开",
        [180] = "验 货",
        [181] = "周礼包",
        [182] = "已拥有的伙伴,自动转换为魂魄",
        [183] = "绿色",
        [184] = "蓝色",
        [185] = "紫色",
        [186] = "只有裝备在同一伙伴身上的命格才可以合成",
        [187] = "回收总价:",
        [188] = "请选择获得物品，每次只能选择一种，可同时开启多个",

    },

    godCompetition = {
        [1] = "阵容1",
        [2] = "阵容2",
        [3] = "阵容3",
        [4] = "个人伤害达到:",
        [5] = "跨服伤害达到:",
        [6] = "阵容未配置，请先配置阵容在进行上传",
        [7] = "阵容上传成功",
    },
}
function language.string_format(self, keyTable, valueTable)
    local finStr
    for k, v in ipairs(keyTable) do
        finStr = finStr and finStr[v] or self[v]
    end
    if not finStr then
        return ""
    end
    if not valueTable or #valueTable == 0 then
        return finStr
    end
    for k,v in ipairs(valueTable) do
        valueTable[k] = tostring(v)
    end
    return string.format(finStr,unpack(valueTable))
end

function language.string_formatS(...)
    local argT = {...}
    return argT[1]:string_format({"fixedStringA",argT[2]},{unpack(argT,3)}) --unpack 函数5.1， 5.2及之后 table.unpack
end

function language.string_common(self,key1,key2,key3)
    if not key1 then
        return ""
    elseif not key2 then
        return self[key1]
    elseif not key3 then
        -- print("key1  "..key1.."  key2  "..key2)
        -- print(debug.traceback())
        return self[key1][key2]
    else
        return self[key1][key2][key3]
    end
end

function language.test( self )
    return self.quality
end

function  language.chatlevel(self,level)
    return " 玩家未达到"..level.."级，暂不能发言"
end

function language.YearMinute(self,year,month,day,hour,minute)
    return year.."年"..month.."月"..day.."日"..hour.."时"..minute.."分"
end

function language.YearHour(self,year,month,day,hour)
    return year.."年"..month.."月"..day.."日"..hour.."时"
end

function language.YearMonthDay(self,year,month,day)
    return year.."年"..month.."月"..day.."日"
end

function language.HourMin(self,data)
    return data.hour.."时"..data.min.."分"
end

function language.Day(self,day)
    return day.."天"
end

function language.andDay(self,day)
    return "还有"..day.."天"
end

function language.hourNum(self,num)
    return num.."小时"
end

function language.minuteNum(self,num)
    return num.."分钟"
end

function language.secondNum(self,num)
    return num.."秒"
end

function language.MonDay(self,month,day)
    return month.."月"..day.."日"
end

function language.laveDay(self,lave)
    return "月卡剩余: "..lave.."天"
end

function language.addRechage(self,money)
    return "月卡用户累计充值"..money.."元"
end

function language.addRechage2(self,money)
    return "累计充值"..money.."元"
end

function language.addRechage3(self,money)
    return "单笔充值"..money.."元"
end

function language.DayRechage(self,money)
    return "今日累计充值"..money.."元"
end

function language.addGold(self,gold)
    return "累计消费"..gold.."元宝"
end

function language.addDay(self,day)
    return "累计登录"..day.."天"
end

function  language.sign_day(self,day)
    return "连续登录第"..day.."天"
end

function language.rewardName(self,name)
    return "奖励:"..name
end

function language.money(self,money)
    return money.."元"
end

function language.moneyGold(self,rmb,gold)
    return rmb.."元 = "..gold.."元宝"
end

function language.laveStarnum(self,num)
   return "剩余观星次数:"..num
end

function language.freeStarNum(self,num)
   return "免费点星次数:"..num
end

function language.consume(self,fd)
    return "消耗:          "..fd
end

function language.consumeGold(self,goldnNum)
    return "是否花费"..goldnNum.."元宝进行点星？"
end

function language.csDay(self,day)
    return "连续观星"..day.."天可以获得奖励"
end

function language.levelFund(self,lv)
    return lv.."级成长基金"
end

function language.getLvGold(self,lv,gold)
    return "达到"..lv.."级即可领取"..gold.."元宝"
end

function language.getLv(self,lv)
    return "达到等级"..lv
end

function language.rewardNameNum(self,name,num)
    return "奖励："..name.." x"..num
end

function language.getSuccessPalays(self,num)
    return "邀请成功"..num.."名玩家"
end

function language.lvtimes(self,num)
    return "财神显灵！少量元宝变大量元宝！您还有"..num.."次机会！"
end

function language.dayHour(self,day,hour,minute)
    return day.."天"..hour.."小时"..minute.."分       秒"
end

function language.rankAward(self,fd)
    return "等级排名第".. fd .."奖励"
end

function language.idNum(self,num)
    return num.."号"
end

function language.monthSign(self,month)
    return month.."月签到奖励"
end

function language.partner(self,num)
    return num.."伙伴"
end

function language.NumName(self,num,name)
    return "第"..num.."章: "..name
end

function language.vipCopy(self,vip,copy,fd)
    return "您是贵族"..vip..",当前重置次数("..copy.."/"..fd..")"
end

function language.challengeMsg(self,challenge,msg)
    return "挑战次数不足，是否花费"..challenge.."元宝重置挑战次数？"..msg
end

function language.vipRaids(self,num)
    return "贵族"..num.."以上可使用扫荡功能"
end

function language.MsgClear(self,times)
    return "是否花费"..times.."元宝清除CD？"
end

function language.levelTimes(self,num)
    return "剩余挑战次数: "..num
end

function language.levelTimes2(self,num1,num2)
    return "剩余挑战次数: ".. num1 .."/"..num2
end

function language.addHt(self,num)
    return "消耗体力: "..num
end

function language.lvNum(self,num,name)
    return "第"..num.."关 "..name
end

function language.Getcoin(self,coin)
    return "银币 +"..coin
end

function language.powerNum(self,num)
    return   num ~= nil and   "战斗力:"..num or "战斗力"
end

function language.consumeName(self,name)
    return "消耗"..name..": "
end


function language.equipName(self,name)
    return "装备于: "..name
end


function language.collectSuit(self,num,quality,equipTy,equipNm)
    return "集齐 "..num.." 个碎片即可合成"..quality..equipTy.." <<"..equipNm..">> "
end

function language.collectPet(self,num,quality,name)
    return "集齐 "..num.." 个碎片即可合成"..quality.."魔宠<<"..name..">> "
end


function language.collectTrs(self,num,quality,name)
    return "集齐碎片"..num.."可合成"..quality.."宝物".." <<"..name..">> "
end

function language.collectMes(self,num,type,name)
    return "集齐碎片"..num.."可合成"..type.."精炼材料".." <<"..name..">> "
end

function language.dfCh(self,name)
    return "是否确认选择"..name
end

function language.refreshTime(self,tm)
    return "刷新过于频繁，请"..tm.."秒后刷新"
end

function language.lvTm(self,tm)
    return "离线: " .. tm
end

function language.delFr(self,name)
    return "是否确认删除好友:"..name.."？"
end

function language.hunpo(self,name)
    return name.."魂魄"
end

function language.complem(self,text)
    return "全部"..text
end

function language.stsNum(self,num)
    return "难度"..num
end

function language.lvOpen(self,num)
    return num.."级开启"
end

function language.scrPoint(self,op,pi)
    return  op and "积分增加"..pi or  "积分减少"..pi
end

function  language.colNum(self,num)
    return "当前拥有: "..num
end

function language.freetime(self,time)
    return time.." 后免费" 
end

function language.vipSt(self,name)
    return "贵族"..name.."以上可使用一键强化"
end

function language.powerNum(self,power)
    return "战力: "..power
end

function language.TolPower(self,power)
    return "总战力: "..power
end

function language.getHp(self,hp)
    return "获得元命"..hp
end

function language.butStates(self,times)
    return "今日可兑换"..times.."次"
end

function language.dayGet(self,dn)
    return "第"..dn.."天可领取"
end

function language.dayGet2(self,dn)
    return "第"..dn.."天可兑换"
end

function language.getlvNm(self,rew,showDt)
    return "仅限前"..rew.."名购买 (剩余"..showDt.."件)"
end

function language.getAward(self,name,award)
    return "获得"..name.."X"..award
end

function language.awardNum(self,name,num)
    return "奖励："..name.."x"..num
end

function language.awardPoint(self,point)
    return point.."点活跃度"
end

function language.getActivity(self,acPt)
    return acPt.."活跃度"
end

function language.getvipLv(self,num)
    return "贵族"..num.."以上可使用自动战斗"
end

function language.levelGt(self,lv)
    return lv.."级"
end

function language.levelGet(self,level)
    return "提升" .. level .. "级"
end

function language.getLevel(self,num)
    return "第"..num.."关"
end

function language.getLevelBig(self,num)
    return "第"..(self.bigNum[num] or num).."关"
end

function language.changeNum(self,num)
    return "今日还可兑换"..num.."次"
end

function language.idStatus(self,status)
    return status<1000000 and status.."区" or "1区"
end

function language.Fdminute(self,mt)
    return "约"..mt.."分钟"
end

function language.costGold(self,gold,viptr)
    return "是否花费 "..gold.." 元宝，恢复 "..viptr.." 培养点"
end

function language.vipBuytr(self,train,vipTr)
    return "(今日已购买"..train.."次，还可购买"..vipTr.."次)"
end

function language.hunGet(self,des,name,num)
    return des..name.."魂x"..num.."+"
end

function language.staMu(self,lv)
    return "随机攻击"..lv.."个目标"
end

function language.expNum(self,num)
    return "经验+"..num
end

function language.addFriend(self,name)
    return "确定添加“"..name.."”为好友吗?"
end

function language.changeGold(self,rmb1,rmb2)
    return "充值可得"..rmb1.."元宝，另送"..rmb2.."元宝"
end

function language.sendGold(self,num)
    return "(送"..num.."元宝)"
end

function language.getrmbGold(self,rmb,gold)
    return "立即获得"..rmb.."元宝，连续30天每天可领取"..gold.."元宝"
end

function  language.getMonthWing(self, num,a1,daygold)
    return "立即获得"..num.."元宝，"..(a1+1 ==2 and "永久" or "连续30天").."每天可领取"..daygold.."元宝"
end

function language.vipPage(self,num)
    return "贵族"..num.."尊享礼包"
end

function language.vipTq(self,num)
    return "贵族"..num.."特权"
end

function language.PerNum(self,num)
    return "已有该伙伴，自动转换为"..num.."个魂魄"
end

function language.getlvnum(self,num)
    return num.."级"
end

function language.shaqiNum(self,num)
    return "当前精力: "..num
end

function  language.teamLv(self,num)
    return "队伍等级: "..num
end

function language.xzTitle(self,title)
    return "选择"..title
end

function language.xzNumName(self,num,name)
    return "最多可选"..num.."个"..name
end

function language.xzNum(self,num)
    return "最多可选"..num.."个"
end

function language.liechuMingge(self,name,num)
    return name.."可以猎出"..num.."命格"
end

function language.dayNumreward(self,num,name,reward)
    return "第"..num.."天： "..name.."，限"..reward.."人购买"
end

function language.tjZdl(self,num)
    return "推荐战斗力: "..num
end

function language.daqianNum(self,num)
    return "当前: "..num
end

function language.getLevelAward(self,num1,num2)
    return "第"..num1.."-"..num2.."关中获得的数量达到下列数量，即可获得:"
end

function language.yi(self,num1)
    return num1.."亿"
end

function language.yiwan(self,num1,num2)
    return num1.."亿"..num2.."万"
end

function language.wan(self,num1)
    return num1.."万"
end

function language.advancdTimes(self,tm,fd)
    return "进阶"..tm.."次: "..fd
end

function language.addAtk(self,num)
    return num .. "%攻击力"
end

function language.useBf(self,num)
    return "当前可用："..num
end

 function language.dayHourSecond(self,day,hour,minute,second)
    return  (day~=0 and day.."天" or "")..((day~=0 or hour~=0) and hour.."小时" or "")..((day~=0 or hour~=0 or minute~=0) and minute.."分" or "")..second.."秒"
 end
 
 function language.dayMinute(self,day,hour,minute)
     return (day~=0 and day.."天" or "")..((day~=0 or hour~=0) and hour.."小时" or "")..((day~=0 or hour~=0 or minute~=0) and minute.."分钟" or "")
 end

 function language.jieNum(self,num)
     return num.."阶"
 end

 function language.disbattleNo(self,num)
     return  "距离冠军还剩"..num.."场比赛！！"
 end

 function  language.exchange_num(self,num)
     return "可兑换"..num.."次"
 end

 function language.swtchStarNum(self,num)
    return "今日还可观星"..num.."次"
 end

function language.swtchStarfreeNum(self,num)
    return "可免费换星"..num.."次"
end

function language.dayhourmSecond(self,day,hour,minute,second)
    return (tonumber(day) > 0 and day .. "天" or "")..hour .. "时" .. minute .. "分" .. second .. "秒"
end

function language.dayhourmSecond2(self,day,hour,minute,second)
    return day .. "天" ..  hour .. ":" .. minute .. ":" .. second
end

function language.hourbf(self,hournum)
    return (hournum - hournum % 1).."小时前"
end

function language.minutebf(self,minutenum)
    return (minutenum - minutenum % 1).."分钟前"
end

function language.nameMo(self,name)
   return name.."(魔)"
end

function language.nameXian(self,name)
   return name.."(仙)"
end

function language.challgNum(self,challenge,kill)
    return "扫荡"..(challenge - kill).."次"

end

function language.breakeAtk(self,breakstr,num)
    return breakstr.."攻击+"..(num*100).."%   "
end

function language.breakeDef(self,breakstr,num)
    return breakstr.."防御+"..(num*100).."%   "
end

function language.breakeHp(self,breakstr,num)
    return breakstr.."生命+"..(num*100).."%   "
end

function language.lvUp(self,num)
    
    return "进阶后等级上限为"..num
end

function language.equipExced(slef,num)
    return "您的装备已超过"..num.."件，请及时处理。"
end

function language.tresureExced(slef,num)
    return "您的宝物已超过"..num.."件，请及时处理。"
end

function language.ctgold(self,num)
    return "消耗元宝"..num
end

function language.ctcoin(self,num)
    return "消耗银币"..num
end

function language.lvgetGuild(self,num)
    return "等级到达"..tonumber(num).."级以上才可创建公会"
end

function language.quitGuild( self,str )
    return "退出公会"..str.."后才可创建公会"
end

function language.addGuild(self,str)
    return "退出公会"..str.."后才可加入新公会"
end

function language.guildLv(self,num)
   return num.."级公会"
end

function language.guildOpenLv(self,num)
   return "公会等级达到"..num.."级开启"
end

function language.guildWarBMLv(self,num)
   return "公会等级达到"..num.."级才可报名"
end

function language.runNum(self,num)
    return "你掷了"..num.."步"
end

function language.nowNum(self,num,name)
    return "现有"..num.."个"..name
end

function language.soulUp(self,num)
    return "您的命格已超过"..num.."件，请及时处理。"
end

function language.nameBuzu(self,name)
    return name.."不足"
end

function language.downnumKB(self,num)
   return "游戏需要下载大约"..num.."KB的更新"
end

function language.downnumM(self,num)
   return "游戏需要下载大约"..num.."M的更新"
end

function language.upnum(self,level,desc)

    return "进阶"..level.."次: "..desc
end

function language.brealname(self,name,lv,nextindex)
    return name..": (+"..lv.."激活)"..nextindex
end

function language.breakLevel( self,lv )
    return "(+"..lv.."激活)"
end

function language.needlv(self,lv1,lv2)
    return "需要等级: "..lv1.."/"..lv2
end

function language.dadaoLV(self,lv2)
   return "达到"..lv2.."级"
end

function language.hsYy(self,point)
    return point.."仙元"  
end

function language.getYy(self,point)
    return "获得"..point.."仙元"
end

function language.toYy(self,point)
    return "达到"..point.."仙元"
end


function language.numci(self,num)
    return "第"..num.."次"

end

function language.boosSkill(self,str)
    return "BOSS技能特殊效果:  "..str
end

function language.criticalTime(self,times)
    return "暴击"..times.."次"
end

function language.level(self,level)
    return "等级: "..level
end

function language.cornucopiaCount(self,count)
    return "聚宝"..count.."次"
end

function language.addGuildExp(self,guildExp,playerExp)
    return "公会经验增加"..guildExp.."点"..",".."个人贡献增加"..playerExp.."点"
end

function language.guildvipLv(self,num)
    return "贵族"..num.."免费"
end

function language.getGold(self,num)
    return "获得元宝"..num
end

function language.addStamina( self,num )
    return "增加"..num.."点体力"
end
function language.jumpGuide(self,time)
    return "再点击"..time.."次跳过引导"
end
function language.growplanBuyNum(self, num)
    return "购买人数达到"..num.."可以领取"
end
function language.closeActivity(self,page)
    return  "没有开启的"..(page == "2" and "活动" or (page == "1" and "福利" or "商店"))
end
function language.growplanBuy(self,num)
    return num.."人已购买"
end

function language.getCredits( self, point )
    return "获取"..point.."积分"
end

function language.somethingCanUsed( self,msg , num ,name )
    return msg..",剩余"..num..name.."可使用"
end

function language.notEnough( self,name )
    return name.."不足！"
end

function language.getSomething( self,name,num )
    return "获得"..name..num
end

function language.slotSpiritActivation( self,num )
    return "激活"..num.."个: "
end

-- 高级月卡
function language.CardState1(self, num)
    return ("        " .. 
        num .. "基金激活必须满足固定购买顺序条件，即必须先购买月卡及高级月卡再单笔充值" ..
        num .. "元以上才能激活月成长计划，如先单笔充值" .. 
        num .. "元以上，再购买月卡及高级月卡则不能激活，仍要再单笔充值" ..
        num .. "元以上才可激活。" .. "\n" .. "        " .. "此活动结束后，激活月基金的魔大大可累计领取20天资源。"
        ) 
end

-- 终身卡
function language.CardState2(self, num)
    return ("        " .. 
        num .. "基金激活必须满足固定购买顺序条件，即必须先购买月卡及终身卡再单笔充值" ..
        num .. "元以上才能激活月成长计划，如先单笔充值" .. 
        num .. "元以上，再购买月卡及终身卡则不能激活，仍要再单笔充值" ..
        num .. "元以上才可激活。" .. "\n" .. "        " .. "此活动结束后，激活月基金的魔大大可累计领取20天资源。"
        ) 
end

function language.RankReward1(self,num)
    return "排行榜排名第" .. num .. "奖励"
end

function language.RankReward2(self, num1, num2)
    return "排行榜排名第" .. num1 .. "-" .. num2 .. "奖励"
end

function language.CopyChapterNum(self,num)
    return "通关普通副本" .. num .. "后开启"
end

function language.CopyWipeLimit(self,lev,viplev)
    return lev .. "级或贵族" .. viplev .. "开启！"
end

function language.CopyWipeLimitTip(self,lev,viplev)
    return "等级不足，".. lev .. "级或贵族" .. viplev .. "开启！"
end

function language.DevilSkillLev(self,name)
    return "魔宠技能：" .. name .. "升级"
end

function language.DevilTeamLev(self,level)
    return "队伍达到" .. level .. "级，才能进阶到下级"
end

function language.RoleInfoLev(self,level)
    return "队伍达到" .. level .. "级开启，努力升级吧！！"
end

function language.GenralsListLev(self,level)
    return "等级不足，" .. level .. "级开启，努力升级吧！！"
end

function language.RevokeWork(self,name)
    return "确定撤销 " .. name .. " 副会长职位?"
end

function language.PromotionWork(self, name)
    return "确定提升 " .. name .. " 为副会长?"
end

function language.TickMember(self, name)
    return "确定将 "..name.." 踢出公会?"
end

function language.WingInspire(self, time, victory)
    return "元宝鼓舞" .. time .."(" .. victory .. ")" .. "次可以增加连胜场次1次"
end

function  language.CostContribution(self, num)
    return "消耗：" .. num .. "个人贡献"
end

function language.GuildLevStudy(self, level)
    return "您的公会等级不足" .. level .. "级，不可学习"
end

function language.GuildNotLev(self, level)
    return "您的公会等级不足"..level.."级，不可升级"
end

function language.guildLevel( self,level )
    return "公会"..level.."级"
end
function  language.RoleLevLimitStudy(self, level)
    return "您的等级不足"..level.."级，不能学习"
end

function  language.RoleLevLimitUp(self, level)
    return "您的等级不足"..level.."级，不能升级"
end

function language.islandfreeCount(self, count)
    return "免费 " .. count .. " 次"
end

function language.mofuMosaic(self,num,level)
    return "镶嵌" ..num .."枚" .. level .."级以上魔符后开启"
end

function language.vipCanBuyTimes(self,vip,times)
    return "贵族"..vip.."每日可购买"..times.."次"
end

function language.canBuyTimes( self, times)
    return "每日可购买"..times.."次"
end

function language.haveNum( self,num )
    return "当前拥有："..num.."个"
end

function language.levelCanIn( self,level )
    return level.."级可进入"
end

function language.challenged(  self,name)
    return "请先挑战过"..name
end

function language.challengeLevel( self,level )
    return "请先挑战过"..level.."级难度" 
end

function language.copyChallengeTimes(self ,times )
    return "本关卡可战胜次数"..times
end

function language.openMonthDay(self,month,day)
    return month.."月"..day.."日00点开启"
end

function language.enhancedLevel( self ,currentLevel,maxLevel )
    return "强化等级: "..currentLevel.."/"..maxLevel
end

function  language.ReamainCount(self, num1, num2)
    return "剩余次数: " .. num1 .. "/" .. num2
end

function language.ReaminNum(self,num)
    return "剩余: " .. (num or 0)
end

function language.TreasureUnlock(self, num)
    return "  (宝物+".. num .."解锁)"
end

function language.expCount(self, num1,num2)
    return "经验值：".. num1 .."/" .. num2
end

function language.helpbuy(self, i,name,num)
    return "第"..i.."天： ".. name .."，最低折限"..num.."人购买"
end

function language.DamageRank(self,rank)
    return "伤害第 "..rank.." 名"
end

function  language.DamageRandRank(self, rank1,rank2)
    return "伤害第 "..rank1.."~"..rank2.." 名"
end

function language.openSkill(self,skillName )
    return "解锁技能: "..skillName
end

function language.freeFlop( self,times )
    return "免费翻牌" .. times .. "次" 
end

function language.maxLevel(self,level)
    return "( 最大"..level.." )"
end

function language.awakenUp( self,lv )
    return "升至下级伙伴资质变为"..lv.."，增加属性成长"
end

function language.awakenUped( self,lv)
    return "伙伴资质变为"..lv
end

function  language.championBoxOpen(self, num)
    return "还可开启" .. num .. "次"
end

function  language.gangbattletime1(self, wday1, hour1, min1, sec1, wday2, hour2, min2, sec2 )
    return "报名时间：周"..self.wdayNum[wday1]..(hour1 >= 10 and "" or "0")..hour1..(min1 >= 10 and ":" or ":0")..min1..(sec1 >= 10 and ":" or ":0")..sec1.." 到 周"..self.wdayNum[wday2]..(hour2 >= 10 and "" or "0")..hour2..(min2 >= 10 and ":" or ":0")..min2..(sec2 >= 10 and ":" or ":0")..sec2
end

function  language.gangbattletime2(self, wday1, hour1, min1, sec1)
    return "夺宝战进入战场时间：周"..self.wdayNum[wday1]..(hour1 >= 10 and "" or "0")..hour1..(min1 >= 10 and ":" or ":0")..min1..(sec1 >= 10 and ":" or ":0")..sec1
end

function  language.gangbattletime3(self, wday1, hour1, min1, sec1)
    return "(周"..self.wdayNum[wday1]..(hour1 >= 10 and "" or "0")..hour1..(min1 >= 10 and ":" or ":0")..min1..(sec1 >= 10 and ":" or ":0")..sec1.."发放奖励)"
end

function language.generallevel( self,lv )
    return "该伙伴到"..lv.."级才能觉醒"
end

function language.tupolevel( self,lv )
    return "该伙伴突破到"..lv.."级才能觉醒"
end

function language.canUp( self,level )
    return "队伍等级到达"..level.."级可强化"
end

function language.wudaohuiLost( self,num )
    return "战斗失败,获得仙豆数："..(num or 0).."，取消继续匹配"
end

function language.upToLevel( self,level)
    return "强化到"..level.."级"
end

function language.attributeUp( self,type,num )
    return type ~= nil  and "强化属性:  +"..num or "强化属性:  "..type.." +"..num
end

function language.cutOff( self,num )
    return num .."折"
end

 function language.addLvactivty( self,num )
    return "(+"..num..")激活) "
end

function language.canExchangeTimes( self,times )
    return "可兑换次数"..times
end

function language.deploymentLevelUp( self,lv )
    return "队伍等级到达"..lv.."级后可升级"
end

function language.goddownImmediateMsg(self,num)
    return "是否消耗 "..num.."元宝 立即完成本次圆梦？"
end

function language.goddownSelectMsg(self,num)
    return "距离活动结束已不足"..num.."小时，活动结束时冷却时间\n未结束，则不能获得本次奖励，是否继续圆梦？"
end

function language.buyCutFashion( self,num )
    return "限时折扣 原价: "..num.."元宝"
end

function language.safemaskLevelUp( self,lv )
    return "需要队伍等级到达"..lv.."级"
end

function language.servicewar_division( self,num )
    return "第"..(self.bigNum[num] or num).."赛区"
end

function language.servicewar_now_round( self,num )
    return "第 "..num.." 轮"
end

function language.servicewar_now_point( self,num )
    return "获得"..num.."点积分"
end

function language.servicewar_title_num( self,num )
    return "第"..(self.bigNum[num] or num).."届跨服战"
end

function language.wing_up_persent( self,persent )
    return "每次失败会提高"..persent.."%的成功率"
end

function language.shell_recall_code( self,code )
    return "各位已经很久没有登陆的小伙伴们，魔王回归强势开启，快快登陆游戏输入“"..code.."”参加吧！"
end

function language.need_favorate_lv( self,lv )
    return "需要与该伙伴好感度等级到达"..lv.."级"
end


function language.need_mammon2_lv( self,lv )
    return "需要贵族"..lv.."才能进行本次迎财神"
end

function language.need_soul_lv( self,lv )
    return "该命格未达到"..lv.."级"
end

function language.wudaohui_choujiang(self,num)
    return "抽奖"..(self.bigNum[num] or num).."次"
end

function language.recovery_need_num(self,num)
    return "该道具的拥有数量不足"..num.."个，无法回收"
end

function language.recovery_basic_num(self,num)
    return "每"..num.."个为1个单位"
end

function language.nightclubLevelOpen( self,num )
    return num.."级开启"
end

function language.friendnightStr3(self,num1,num2)
    return "当前已选择伙伴："..num1.."/"..num2
end

function language.daoguanStartinishTime(self, start, finish)
    return start.month.."月"..start.day.."日"..start.hour.."时".."-"..finish.month.."月"..finish.day.."日"..finish.hour.."时"
end

function language.carnival_num(self,index,num)
    if index == 1 then
        return "普通档位"..num.."次后进入精良档位"
    elseif index == 2 then
        return "精良档位"..num.."次后进入史诗档位"
    elseif index == 3 then
        return "史诗档位剩余"..num.."次"
    else
        return ""
    end
end

function language.carnival_num2(self,index,num)
    if index == 1 then
        return "普通档位"..num.."次后进入精良档位"
    elseif index == 2 then
        return "精良档位"..num.."次后进入史诗档位"
    elseif index == 3 then
        return "史诗档位剩余"..num.."次"
    else
        return ""
    end
end

function language.carnival_goto(self,index)
    if index == 1 then
        return "请切换到普通档位"
    elseif index == 2 then
        return "请切换到精良档位"
    elseif index == 3 then
        return "请切换到史诗档位"
    else
        return ""
    end
end

function language.carnival_goto2(self,index)
    if index == 1 then
        return "请切换到普通档位"
    elseif index == 2 then
        return "请切换到精良档位"
    elseif index == 3 then
        return "请切换到史诗档位"
    else
        return ""
    end
end

local languageNumC = {"一","二","三","四","五","六","七","八","九","十"}
function language.getLanguageNum(self,num)
    return languageNumC[num] or tostring(num)
end

function language.cangjingge_uplimit(self,str,level)
    return "需要"..str.."到达"..level.."级"
end

function language.cangjingge_qualitylimit(self,str,quality)
    return "需要"..str.."品质为"..quality
end

function language.auction_message(self,opt,name,num,gold,time)
    local ss = ""
    local s_time = os.date("*t", time)
    if opt and opt == 3 then
        ss = name.."x"..num.." 在"..s_time.hour.."时"..s_time.min.."分"..s_time.sec.."秒".."流拍！"
    elseif opt and opt == 4 then
        ss = name.."x"..num.." 在"..s_time.hour.."时"..s_time.min.."分"..s_time.sec.."秒".."被以"..gold.."元宝竞拍价成交！"
    elseif opt and opt == 2 then
        ss = name.."x"..num.." 在"..s_time.hour.."时"..s_time.min.."分"..s_time.sec.."秒".."被以"..gold.."元宝一口价秒拍！"
    else
        ss = name.."x"..num.." 的竞价在"..s_time.hour.."时"..s_time.min.."分"..s_time.sec.."秒".."被提高到"..gold.."元宝！"
    end
    return ss
end

function language.auction_log(self,opt,name,num,gold,time)
    local ss = ""
    local s_time = os.date("*t", time)
    if opt and (opt == 4 or opt == 1) then
        ss = "<"..s_time.month.."-"..s_time.day.." "..s_time.hour..":"..(s_time.min < 10 and "0" or "")..s_time.min..">  "..name.."x"..num.." 以"..gold.."元宝竞拍价成交！"
    elseif opt and opt == 2 then
        ss = "<"..s_time.month.."-"..s_time.day.." "..s_time.hour..":"..(s_time.min < 10 and "0" or "")..s_time.min..">  "..name.."x"..num.." 以"..gold.."元宝一口价秒拍！"
    else
        ss = "<"..s_time.month.."-"..s_time.day.." "..s_time.hour..":"..(s_time.min < 10 and "0" or "")..s_time.min..">  "..name.."x"..num.." 流拍！"
    end
    return ss
end

function language.turntablerecord(self,num,name,service,time)
    local ss = ""
    --local s_time = os.date("*t", tonumber(time))
    if service and service > 0 then
        ss = "<"..time..">  "..name.."("..service.."服) 获得"..num.."元宝!"
    else
        ss = "<"..time..">  "..name.." 获得"..num.."元宝!"
    end
    return ss
end

function language.turntablerecordcommon(self,num,name,service,time,id)
    local ss = ""
    local config = ui.IDconfig(id)
    local idname = config.name
    if config.staffType == "general_fragment" then
        idname = idname.."碎片"
    end
    if service and service > 0 then
        ss = "<"..time..">  "..name.."("..service.."服) 获得"..idname.."个".."!"
    else
        ss = "<"..time..">  "..name.." 获得"..num.."个"..idname.."!"
    end
    return ss
end

function language.SoulHunt100Limit(self,lev,viplev)
    return lev .. "级或贵族" .. viplev .. "开启猎命百次和千次猎命"
end

function language.gangbossrule1( self,lv )
    return "1.公会等级大于等于"..lv.."级，且入会时间大于24小时的公会成员可以挑战公会BOSS。"
end

function language.gangbossrule2( self,lv )
    return "2.贵族"..lv.."以上的公会成员可以消耗元宝进行鼓舞，鼓舞可以提升全体公会成员对BOSS的伤害，每日0点重置鼓舞效果。"
end

function language.rebatedesc( self,activitytype,num,max )
    return "活动期间，"..(activitytype == 1 and "充值任意金额都" or "消费元宝").."可以获得"..num.."%的元宝返利，达到相应的额度更有好礼相送。返利会在活动结束后以邮件的形式发放。"..(max > 0 and ("最多可返利"..max.."元宝。") or "")
end

function language.wingGrow( self,level,star )
    return level.."阶"..star.."星"
end

function language.copyProcess( self,star )
    return star.."星"
end

function language.generalPeiyang( self,num )
    return "第"..num.."次".." (培养x10)"
end 

function language.daoguankeeper( self,idx )
    local strs = {
        "是否挑战光辉道馆守护兽，战斗胜利可获得光辉道馆徽章？",
        "是否挑战荣耀道馆守护兽，战斗胜利可获得荣耀道馆徽章？",
        "是否挑战巅峰道馆守护兽，战斗胜利可获得巅峰道馆徽章？",
        "是否挑战传奇道馆守护兽，战斗胜利可获得传奇道馆徽章？",
    }
    return strs[idx] or ""
end

function language.daoguanhuizhangget( self,idx )
    local strs = {
        "您已获得光辉道馆徽章",
        "您已获得荣耀道馆徽章",
        "您已获得巅峰道馆徽章",
        "您已获得传奇道馆徽章",
    }
    return strs[idx] or ""
end

function language.daoguanleader( self,idx,name )
    local strs = {
        "是否挑战光辉道馆馆长",
        "是否挑战荣耀道馆馆长",
        "是否挑战巅峰道馆馆长",
        "是否挑战传奇道馆馆长",
    }
    return (strs[idx] or "")..name
end

function language.daoguanleaderget( self,idx )
    local strs = {
        "您已成为光辉道馆馆长",
        "您已成为荣耀道馆馆长",
        "您已成为巅峰道馆馆长",
        "您已成为传奇道馆馆长",
    }
    return strs[idx] or ""
end

function language.daoguanmember( self,idx,name )
    local strs = {
        "是否挑战光辉道馆成员",
        "是否挑战荣耀道馆成员",
        "是否挑战巅峰道馆成员",
        "是否挑战传奇道馆成员",
    }
    return (strs[idx] or "")..name
end

function language.daoguanmemberget( self,idx )
    local strs = {
        "您已成为光辉道馆成员",
        "您已成为荣耀道馆成员",
        "您已成为巅峰道馆成员",
        "您已成为传奇道馆成员",
    }
    return strs[idx] or ""
end

function language.daoguanrefresh( self,sec )

    return "请"..sec.."秒后再试"
end

--[[
[1] = "报名时间：周四10:00:00 到 周六00:00:00",
[2] = "夺宝战进入战场时间：周六20:00:00",
[6] = "（周六22:00:00发放奖励）",
[36] = "夺宝战报名时间：每周四早10点 到 周五晚24点",
]]

function language.loadingtips(self )
    return  {--loginScene 加载用的字
        "吕布貂蝉合体狂虐单身狗",
        "刘备，关羽，张飞桃园结义感天动地",
        "招募菩提祖师，宇宙飞船带你飞",
        "猴哥，师父啰嗦病又犯了，咋整？",
        "血气不足吗？何仙姑来补补补~！",
        "从前有个蓬莱洞，洞里有好多宝贝",
        "我要一步一步向上爬，我去，啥塔辣么高",
        "来来来，阎王土豪请吃辣条",
        "传说公会温泉能遇到美女",
        "放开观音姐姐，让我来！！！",
        "魔宫里看我的72变变变",
        "大乔神鞭一挥，做人，懂了吗？",
        "呵呵，董卓大爷给你笑一个",
        "后羿欧巴，不是说好要做彼此的天使吗",
        "月英你吓到我了，赔钱",
        "8颗北极星，亮瞎我的眼",
        "玉帝可带来最强大的装*力量",
    }   
end

function language.gameSceneDefault(self )
   return {
        "欢迎进入神将道",
        "这里有最逗比的武将",
        "这里有最酷炫的技能",
        "这里有最欢乐的剧情",
    }
end


function language.tigerPropname(self,name)
    return "购买"..name.."赠送伙伴与道具"
end

function language.daoguanZhanbaoRichLabel(self,richdata)
    local str = {}
    local colorNum = 3
    if richdata.colorId == 1 then
        colorNum = 3
    else
       colorNum = 11
    end
    table.insert(str,{fontID = colorNum, content = richdata})
    return str
end

function language.activityAuctionResult(self, time)
    local ss = ""
    local s_time = os.date("*t", time)

    if s_time.min < 10 then
        s_time.min = "0"..s_time.min
    end

    time = s_time.year.."年"..s_time.month.."月"..s_time.day.."日"..s_time.hour..":"..s_time.min
     
    return time.."您开始拍卖古董:"
end

function language.activityAuctionResult1(self, round, npcName, price, resultType)
    return "         第"..gameConfig.strings:string_common("bigNum", round).."轮  "..npcName.."出价:"..self:activityAuctionResultByType(price, resultType, true)
end

function language.activityAuctionResult2(self, price, resultType)
    return "         您的古董最终以："..self:activityAuctionResultByType(price, resultType).."价格成交！\n"
end

function language.activityAuctionResult3(self, result, price, resultType)
    return "         您的古董鉴定为"..result.."，获得"..self:activityAuctionResultByType(price, resultType, true)
end

function language.activityAuctionResultByType(self, price, resultType, isEnter)
    local _isEnter = ""

    if isEnter then
        _isEnter = "\n"
    end

    if resultType == 1000 then
        return (price / 10000).."万银币".._isEnter
    elseif resultType == 1001 then
        return price.."元宝".._isEnter
    end
end

function language.activityAuctionResultOnekey(self, time)
    local ss = ""
    local s_time = os.date("*t", time)

    if s_time.min < 10 then
        s_time.min = "0"..s_time.min
    end

    time = s_time.year.."年"..s_time.month.."月"..s_time.day.."日"..s_time.hour..":"..s_time.min
     
    return time.."您一键拍卖古董:"
end

function language.activityAuctionOnekey(self,rightnum,wrongnum,chengjiaonum)
    return "         其中真品"..rightnum.."件，赝品"..wrongnum.."件，成交"..chengjiaonum.."件\n"
end

function language.activityAuctionOnekeyCoin(self, price, resultType)
    if resultType == 1000 then
        return "         共获得"..math.modf( price / 10000 ).."万银币\n"
    elseif resultType == 1001 then
        return "         共获得"..price.."元宝\n"
    end
end

function language.activityAuctionChoose(self, level)
    return "战队等级"..level.."可拍卖"
end

function language.activityAuctionChooseOneKey(self, level)
    return "战队等级"..level.."可一键拍卖"
end

function language.exclusiveArtifactNextSkill(self, step, skillName)
    return "进阶至"..step.."阶解锁技能"..skillName
end

function language.exclusiveArtifactNeedGeneralLevel(self, generalLevel)
    return "需要武将等级达到："..generalLevel.."级"
end

function language.poolingServerOnlineTitle(self, num, max)
    return "每日在线得好礼（"..num.."/"..max.."阶段）"
end
function language.inspireTip(self,num)
    return "鼓舞成功，个人贡献增加"..num.."点"
end
function language.timeStr(self,time)
    return string.format("%02d",time.hour)..":"..string.format("%02d",time.min)..":"..string.format("%02d",time.sec)
end

function language.timeStr2(self,time)
    local timeTb = os.date("*t",time)
    return string.format("%d",timeTb.year).."/"..string.format("%02d",timeTb.month).."/"..string.format("%02d",timeTb.day).."  "..string.format("%02d",timeTb.hour)..":"..string.format("%02d",timeTb.min)..":"..string.format("%02d",timeTb.sec)
end

function language.gender(self, gender)
    if gender == 1 then
       return "男"
    elseif gender == 2 then
       return "女"
    elseif gender == 3 then
       return "兽"
    end
end

function language.titleEndTime( self,endtime)
    
    local str = ""

    if endtime == -1 then
        str = gameConfig.strings:string_common("fixedString","mainscene",24)
    elseif endtime == 0 then
        str = gameConfig.strings:string_common("fixedString","mainscene",25)
    elseif endtime > 0 then
        if endtime >= 3600*24 then
            str = math.floor(endtime/(3600*24)).."天"
        else
            local hour = math.floor(endtime/3600)
            local min = math.floor(endtime%3600/60)
            str = string.format("%02d",hour).."小时"..string.format("%02d",min).."分"
        end
    elseif endtime < -1 then
        str = "已失效"
    end
    return str
end

function language.attributeValue(self,attr,attrType,attrValue)

    if attrType == "value" then
        return gameConfig.strings.attr_type[attr].." +"..attrValue
    elseif attrType == "percent" then
        return gameConfig.strings.attr_type[attr].." +"..attrValue.."%"
    else
        return ""
    end
end

function language.attributeValue2(self,attr,attrType,attrValue)
    print("attributeValue2",attr,attrType,attrValue)
    if attrType == "value" then
        return gameConfig.strings.attr_type[attr].."：+"..attrValue
    elseif attrType == "percent" then
        return gameConfig.strings.attr_type[attr].."：+"..attrValue.."%"
    else
        return ""
    end
end

function language.artifactResonanceAttr(self,artifacts)

    printT(artifacts,"artifactResonanceAttr")
    if artifacts.resonanceActiveId1 == 0 and artifacts.resonanceActiveId2 == 0 and artifacts.resonanceActiveId3 == 0 and artifacts.resonanceSkillNum < 2 then
        return ""
    end


    local attrValue = 0
    if artifacts.resonanceActiveId1 > 0 then
        attrValue = attrValue + gamedata.config.resonance_attribute["1"][tostring(artifacts.resonanceActiveId1)].attribute
    end
    
    if artifacts.resonanceActiveId2 > 0 then
        attrValue = attrValue + gamedata.config.resonance_attribute["1"][tostring(artifacts.resonanceActiveId2)].attribute
    end

    if artifacts.resonanceActiveId3 > 0 then
        attrValue = attrValue + gamedata.config.resonance_attribute["1"][tostring(artifacts.resonanceActiveId3)].attribute
    end


    --一条没有共鸣
    if artifacts.resonanceSkillNum > 1 then
        attrValue = attrValue + gamedata.config.resonance_attribute["2"][tostring(artifacts.resonanceSkillNum)].attribute
    end

    if attrValue > 0 then
        return "(共鸣速度+"..attrValue..")"
    else
        return "(神技共鸣)"
    end
end

function language.babelTowerPassCondition(self,id,param1,param2)
    print("babelTowerPassCondition",id,param1,param2)
    local config = gamedata.config.tongtianta_tongguantiaojian[tostring(id)]
    if not config then
        return ""
    end

    local str = ""
    if id == 9 then
        local generalConfig = gamedata.config.general[tostring(param2)]
        str = string.format(config.describe,param1,generalConfig.name)
    elseif id == 10 then
        str = string.format(config.describe,param1,gameConfig.strings:string_common("popups","region0")[tostring(param2)] or "")
    else
        str = string.format(config.describe,param1)
    end
    return str
end

function language.checkBattleDamage(self, damage)
    if damage > 10000000 then
        return math.floor(damage / 10000).."万"
    else
        return damage
    end
end

function language.godSoulTempleLevel(self, soulType, level)
   local str =  "需要"
   local soul = tonumber(soulType) or 0
   print("soul  "..soul)
   if soul == 18 then
        str = str.."金灵石等级:"
   elseif soul== 20 then
        str = str.."龟灵石等级:"
   elseif soul == 23 then
        str = str.."无当石等级:"
    elseif soul == 44 then
        str = str.."火灵石等级:"
   end 
   -- str = str..level
   return str
end

function language.godSoulTempleLevelUp(self, soulType, tipType)
    local str =  ""
    local soul = tonumber(soulType) or 0
    print("soul  "..soul)
    if soul == 18 then
        str = str.."金灵石等级不足,提升等级后可进行"
    elseif soul== 20 then
        str = str.."龟灵石等级不足,提升等级后可进行"
    elseif soul == 23 then
        str = str.."无当石等级不足,提升等级后可进行"
    elseif soul == 44 then
        str = str.."火灵石等级不足,提升等级后可进行"
    end 
    if tipType == 0 then
        str = str.."炼魂"
    else 
        str = str.."粹神"
   end 
   return str
end

function language.xuanyueTreasuresDayhour(self,day,hour,minute,second)
    
    if tonumber(day) > 0 then
        return day.."天"..((tonumber(hour) > 0) and hour.."时" or "")
    end

    if tonumber(hour) > 0 then
        return hour.."时"..((tonumber(minute) > 0) and minute.."分" or "")
    end

    return minute.."分"..second.."秒"
end


function language.skillEffectDesc(self,skillconfig,skilllevel)

    skilllevel = skilllevel or 1
    skilllevel = math.max(skilllevel,1)
    
    local str = ""
    if skillconfig and skillconfig["effect-desc"] then
        if skillconfig["atk_param_"..skilllevel] and tonumber(skillconfig["atk_param_"..skilllevel]) then
            str = string.gsub(skillconfig["effect-desc"],"##",tonumber(skillconfig["atk_param_"..skilllevel])*100)
        else
            str = skillconfig["effect-desc"]
        end
    end
    return str
end

function language.fixedDate(self,time)
    if time and time > 0 then
        local date = os.date("*t", time)
        return date.month.."月"..date.day.."日  "..date.hour..":"..date.min
    else
        return ""
    end
end

function language.tokenStatus(self, index, type, num)
    return index .. "件效果：" .. self.attr_type[type] .. "+" .. num
end

function language.tokenNeedLevel(self, currentLevel, needLevel)
    return "需求等级：" .. currentLevel .. "/" .. needLevel
end

function language.tokenNeedSuit(self, name)
    return "需激活" .. name
end


function  language.godcompetition_period(self,period)
    return " 第"..period.."届BUFF详情"
end

return language












