


local function userdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 1001,param = "error"})
end

local function sportdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 1610,param = "error"})
end

local function userVipErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 117, update = true})
end

local function userslotdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 1002, param = "error"})
end

local function userpetdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 1044, param = "error"})
    UIRequest({type = 1040, param = "error"})
end

local function userfrienddataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 2300, param = 1})
    UIRequest({type = 2301})
    UIRequest({type = 2303})
    UIRequest({type = 3002})
end

local function usercupdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 2100})
    UIRequest({type = 2102})
end

local function usermieshendiandataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 3620,param = "error"})
end

local function usergangdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 2230,param = "main"})
end

local function usergangwardataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 2230,param = "gangwar"})
end

local function userrobselectdataErr()
    gameWindows:closeAllWindowDirect()
    if gameWindows.windows["robselect"].show then
        gameWindows.windows["robselect"].module:changeEnemy()
    end
end

local function userWorldWardataErr()
    gameWindows:closeAllWindowDirect()
end

local function userMessageErr()

end

local function userAuctionErr()
    UIRequest({type = 4810,param = "error"})
end

local function userManorErr()
    if GameScene.layers["manor"].show then
        GameScene.layers["manor"].module:manorchangebyrid()
    end
end

local function usergangbossdataErr()
    gameWindows:closeAllWindowDirect()
    UIRequest({type = 4840})
end


local function userHerobossErr()
    UIRequest({type = 5201})
    if GameScene.layers["bosschallenge_attack"].show then
        GameScene.layers["bosschallenge_attack"].module:changedata()
    end
end

--简单飘字组合
local function forceExit(msg)
    loading:exitGame(msg)
end

local logError = {

    errorMessage = {
        [0] = "无效请求",
        [1] = "银币不足",
        [2] = "元宝不足",
        [3] = "体力不足",
        [4] = "精力不足",
        [5] = "竞技点不足",
        [6] = "竞技场荣誉不足",
        [11] = "您已经有大月卡啦",
        [12] = "请选择一键挑战次数",
        [13] = "队伍等级80级或VIP5可使用一键挑战",
        [14] = "消耗品不足",
        [20] = "法宝突破达到上限",
        [21] = "锻造属性未达上限",

        
        [8] = "数据有误,请退出游戏重新登录",
        [9] = "应用宝接口异常",
        [49] = "战斗力不足",
        [50] = "贵族等级不足",
        [51] = "等级不足",
        [52] = "仙元不足",
        [53] = "等级或vip不足",

        [60] = "该活动副本未开启",
        [61] = "没有可扫荡的关卡",
        [62] = "重置次数不足",
        [63] = "灭神殿扫荡中，请勾选立即完成与重置",
        [64] = "未到扫荡极限，请勾选立即完成",
        [65] = "重置次数大于1，请勾选立即完成",
        [66] = "挑战次数不足",
        [67] = "观星次数不足",
        [68] = "免费扔骰子次数已达上限",
        [69] = "骰子数不足",
        [70] = "请选择挑战次数",
        [71] = "任务类型不存在",
        [72] = "最高层小于5层不可扫荡",
        [73] = "冠军试炼开箱次数不能为0",
        [74] = "可购买次数不足",

        [100] = "不能操纵主角",
        [101] = "伙伴不存在",
        [102] = "伙伴等级不够",
        [103] = "伙伴突破不够",
        [104] = "伙伴魂魄不够",
        [105] = "伙伴在阵",
        [106] = "伙伴品质不够",
        [107] = "伙伴等级过高",
        [110] = "伙伴已存在",
        
        [111] = "装备不存在",
        [112] = "装备等级不够",
        [113] = "装备精炼不够",
        [114] = "装备碎片不够",
        [115] = "装备在阵",
        [116] = "装备品质不够",
        [117] = "装备等级过高",
        [118] = "装备星级已达上限.",
        [119] = "装备品阶已达上限.",
        
        [121] = "宝物不存在",
        [122] = "宝物等级不足",
        [123] = "宝物精炼不足",
        [124] = "宝物碎片不足",
        [125] = "宝物在阵",
        [126] = "宝物品质不够",
        [127] = "宝物等级过高",
        
        [131] = "命格不存在",
        [132] = "命格等级不足",
        [133] = "命格精炼不足",
        [134] = "命格碎片不足",
        [135] = "命格在阵",
        [136] = "命格品质不够",
        
        [141] = "宠物不存在",
        [142] = "宠物等级不足",
        [143] = "宠物精炼不足",
        [144] = "宠物碎片不足",
        [145] = "宠物在阵",
        [146] = "宠物品质不够",
        [147] = "宠物等级达到上限",

        [160] = "强化等级已满",
        [161] = "武将不在阵",
        [162] = "武将不为初始状态",
        [163] = "两个武将资质不等",
        [164] = "橙色品质以下武将不能互换",
        [165] = "两个武将突破上限不同",
        [166] = "武将精华不足",

        [170] = "圣石等级已满",
        [171] = "圣石等级不足",
        [172] = "炼魂功能未开启",
        [173] = "炼魂已达上限",
        [174] = "粹神功能未开启",
        [175] = "粹神已达上限",
        
        [201] = "已经是好友",
        [202] = "已经不是好友",
        [203] = "好友今天已经助战过了",
        [204] = "领取好友奖励已达每日上限啦",
        [205] = "对方被你加入黑名单",
        [206] = "你被对方加入了黑名单",
        [207] = "协助次数不足",
        [208] = "好友小妖数不足",

        [209] = "没有好友",
        [210] = "没有可送礼好友",
        [213] = "没有可收好友礼物",

        [214] = "没有可收好友礼物且没有可送礼好友",
        [215] = "送礼完成，没有可收好礼礼物",
        [216] = "收礼完成，没有可送礼好友",
        [217] = "建筑大厅至少为1级",
        [975] = "可上阵位少于上阵武将数量",
        [976] = "请设置挑战阵容",
        [978] = "无可领奖位置",
        [979] = "上阵位未通关",
        

        [981] = "武将已上阵",
        [982] = "没有上阵武将",
        [983] = "时间配置错误",
        [984] = "没有可操作关卡",

        
        [211] = "杯赛已经报名",
        [212] = "下注次数不足",
        
        [221] = "星数不足",
        [222] = "已经接近最大层",
        [223] = "相同伙伴只能上阵一位",

        [251] = "已经有公会了",
        [252] = "还没加入公会",
        [253] = "您刚退出公会，还不能加入其他公会",
        [254] = "没有权限",
        [255] = "副会长已满",
        [256] = "不能直接踢公会管理层，请先将其降级",
        [257] = "会长不能直接退出公会，请先传位",
        [258] = "公会不存在",
        [259] = "入会不满一天，不能加入战场",
        [260] = "公会创建不满%d天，不能参加魔王宝藏",
        [261] = "已经加入另一战场",
        [262] = "没有报名该据点",
        [263] = "您的公会已报满",
        [264] = "已报名该据点",
        [265] = "不在报名时间内",
        [266] = "入会不满一天，不能领取",
        [267] = "公会战斗期间，不可此操作",
        [268] = "您的公会已占领此宝藏",
        [269] = "已拜神",
        [270] = "请选择拜神类型",
        [271] = "拜神类型不存在",
        [272]= "公会福利已领取",
        [273]= "今日已执行",

        [274]= "当前公会成员大于1人，不允许解散",
        [275]= "已报名公会战，不允许解散",
        [276]= "已占据公会据点，不允许解散",
        [277]= "已参加当前公会战，不允许解散",
        [278]= "参加了上次公会战，不允许解散",

        [230] = "专属神器未激活",
        [231] = "专属神器可强化次数不足",
        [232] = "强化过程中需要进行洗练",
        [233] = "要镶嵌器灵已在阵",
        [234] = "器灵强化等级达到上限",
        [235] = "被熔炼器灵在阵或已上锁",
        [236] = "镶嵌器灵位置不符",
        [237] = "当前等级不可洗礼",
        [310] = "协助次数不足",
        [325] = "好友小妖数不足",

        [301] = "物品已出售",
        [302] = "物品当前竞拍价格已变更，请重新竞拍",
        [303] = "不在可竞拍的时间范围内",

        [304] = "未满足升级条件",
        [305] = "建筑等级已达上限",
        [306] = "暂无可刷新任务",
        [307] = "该任务不可接取",
        [308] = "已被别人清掉了",
        [309] = "该任务不可取消",

        [310] = "该建筑等级不足",

        [311] = "公会BOSS未开启",
        [312] = "入会时间不足24小时，不可挑战",
        [313] = "鼓舞次数已达上限",
        [314] = "公会BOSS已被击杀",
        [315] = "公会等级不足",

        [325] = "打地鼠活动未开启",

        [331] = "BOSS正在复活中",
        [332] = "已参加另一个BOSS的挑战",
        [333] = "参战次数不足",
        [334] = "队伍复活中",
        [347] = "锁定神器不可消耗",
        [348] = "已镶嵌相同类型宝石",
        [352] = "不在可操作阶段",
        [353] = "装备进阶条件不满足",

        [935] = "0点5分开始报名,请稍等",
        
        [901] = "对方处于保护中，无法挑战",
        [902] = "目标为玩家",
        [903] = "目标为npc",

        [930] = "今日已参与过道馆活动",


        [970] = "正在结算奖励，请稍后",

        [980] = "活动已结束",

        [985] = "奇遇时间已过",
        [986] = "贵族次数不足，请升级vip",
        [987] = "次数不足",
        [988] = "已超出上限",
        [989] = "你还没有资格，你怎么点进来的呀？",
        [990] = "活动未开启，你怎么进来的？",
        [991] = "次数已经用完啦",
        [992] = "奖励已经领过了",
        [993] = "时间不对，仔细重对",
        [994] = "钥匙不足",
        [995] = "道具不足",
        [996] = "玩家不存在",
        [997] = "参数错误",
        [998] = "不满足条件",
        [999] = "材料不足",
        [1000] = "逻辑错误",
        [1001] = "数据飞走了，请重进试试",
        [1002] = "请不要输入自己的邀请码",
        [1003] = "禁言中",
        [1004] = "自己好友已满",
        [1005] = "对方好友已满",
        [1006] = "不在阵魔符不能被升级",
        [1007] = "魔符不能被换下阵",
        [1008] = "替他阵位魔符等级不满足条件",
        [1009] = "无效的召回码",
        [1010] = "请不要输入自己的召回码",
        [1011] = "已输入过召回码",
        [1012] = "该关卡通关后可进行一键完成",
        [1013] = "无可领奖励位置",
        [1014] = "输入内容非法",
        [1015] = "该关卡100%伤害通过后可进行一键完成",
        [1016] = "当前时间无法发言",

        [1100] = "时装不存在",
        [1101] = "时装已过期",
        [1102] = "时装已穿戴",
        [1103] = "时装已拥有",
        [1104] = "皮肤未激活",

        [1111] = "您所在渠道充值已关闭",
        [1301] = "不在活动时间内，不可匹配.",
        [1302] = "没有匹配次数，不可挑战.",
        [1303] = "答题时间已结束",

        [1401] = "不可押注",
        [1402] = "未通关上一难度",
        [1403] = "正在进行其它难度挑战",

        [1512] = "当前有未领取的奖励，无法招募",
        [1513] = "当前没有未领取的奖励，无法刷新",
        [1514] = "当前没有未领取的奖励，无法领取",

        [2001] = "公会名字重复",
        [2002] = "请不要重复申请",
        [2003] = "公会人员已满",
        [2004] = "已加入其他公会",
        [2005] = "拒绝",
        [2006] = "会长离线未满7天",
        [2007] = "已有人提出弹劾",
        [2008] = "主动退会未超过24小时",

        [2009] = "已经过了下注时间",

        
--------------------------------------------------------------------------------------------
--用于添加Net发送的字符传
--格式
    --[频道号] = “msg”
    --[频道号01] = "msg" --一个频道号过个消息时 
    --如果已经有了[此频道号 最大号+1]  没有[频道号01] 用次号  
--zhangzhixin
--------------------------------------------------------------------------------------------  
        [100001] = "次数已用完",
        [100002] = "今日次数已用完",
        [100003] = "挑战次数不足",
        [100004] = "配置文件损坏，请重启游戏更新配置文件。如问题仍存在请删除游戏并重新下载安装。",
        [100005] = "还未预览",
        [100006] = "报名失败",
        [100007] = "重置次数已用完",
        [100008] = "今日购买个数已达上限！",
        [100009] = "贵族等级不够",
        [100010] = "所有装备已强化到上限",
        [100011] = "还没有穿戴装备",
        [100012] = "本地文件损坏，为保证游戏体验请删除游戏并重新下载安装。",
        [100013] = "条件不满足",
        [100014] = "友谊的小船不能翻",
        [100015] = "已屏蔽该玩家",


        [1042] = "进阶道具不足",
        [1057] = "进阶道具不足",
        [1130] = "已经强化到满级",
        [140101] = "没有足够的招募令",
        [140102] ="没有足够的招募令",
        [2210] = "助理人数已达上限",
        [2239] = "副会长人数已达上限",
        [213101] = "请让公会会长或副会长前来报名参加",
        [213102] = "已经报名2个了！",
        [2134] = "战场错误" ,
        [2504] = "灵元不足！",
        [2610] = "未加入任何公会",
        [2071] = "血战状态错误~",
        [2077] = "血战状态错误~",
        [2078] = "血战状态错误~",
        [2079] = "血战状态错误~",
        [2101] = "报名时间未到,请9点后再来",
        [3651] = "当前魂蛋不足，请前往炼化获得",
        [3661] = "当前夺宝币不足，请前往夺宝获得",
        [401101] = "已拥有此伙伴，且此伙伴等级超过5级！" ,
        [401102] = "已拥有此伙伴，且突破等级超过1级！" ,
        [401103] = "已拥有此装备，且等级超过5级！" ,
        [401104] = "已拥有此宝物，且等级超过5级！" ,
        [401105] = "已拥有此宝物，且精炼等级超过1级！" ,
        [401106] = "已没有剩余兑换次数！",

        [271101] = "试炼点不足",
        [322] = "当前竞拍您已经是最高价",
        [401] = "宝石数量不足",
        [340] = "未有可替换技能",
        [341] = "神器未鉴定",
        [342] = "神器未洗练过",
        [343] = "技能空位已锁定",
        [344] = "技能空位未锁定",

        [1201] = "赛龙舟押注不在时间内",
        [1202] = "武将进修条件不满足",

        [154] = "魔罩飞升等级达到上限",
        [155] = "魔罩飞升等级不足",

        [1501] = "灵气值不足",
        [1502] = "未匹配到该玩家",
        [1503] = "玩家已进入保护模式",
        [1504] = "数据已过期，请刷新",
        [1505] = "连接不到游戏服，请重试",
        [1506] = "发布协助条数已满",
        [1507] = "已有此玩家的协助复仇任务",
        [1508] = "不能帮助非公会成员复仇",
        [1509] = "不可以求助自己，你咋不上天呢？",
        [1510] = "本日协助复仇次数已达上限，明天再来吧",
        [1511] = "协助复仇任务已完成",

        [910] = "未被选择属性培养值已降为0，自动培养停止。",
        [911] =	"潜力点不足，保留属性不可全选",
        [912] =	"潜力点不满足最大消耗，保留属性不可全选",


        [2011] = "盛宴已结束",
        [2012] = "正在公会盛宴中",
        [2013] = "盛宴已被创建请刷新⻚面",
        [2014] = "篝火已结束",
        [2015] = "正在参与帮会篝火中",
        [2016] = "篝火已被创建请刷新⻚面", 
        [2017] = "正在参与篝火不能退出帮会", 
        [2018] = "参与人数已达上限",
        [2019] = "正在参与盛宴不能退出帮会",
        [2020] = "当前活动未开启，一会儿再来看看吧！",

        [180] = "金将升星等级已达上限",
        [181] = "伙伴不能升星",
        [182] = "伙伴飞升等级不足",

        [1530] = "共鸣洗练至少需要两个技能",
        [1531] = "没有可触发共鸣的技",
        [1532] = "请锁定至少一条可以触发共鸣的技能",
        [1533] = "没有共鸣技能可替换",

        [360] = "被幻化武将不能与幻化武将相同",
        [361] = "被幻化武将不能为魔王",
        [362] = "被幻化武将已拥有幻化关系",
        [363] = "幻化原武将已拥有幻化关系",
        [364] = "被幻化武将与幻化原武将不能同时在阵",
        [365] = "幻化道具已过期",
        [366] = "没有幻化关系",
        [367] = "所幻化武将没有金将",
        [368] = "所幻化武将没有红将",
        [999996] = "您的账号在此时间段无法游玩，还请您在周五，周六，周日晚上8点到9点间登陆游戏",
        [999997] = "服务器繁忙，请稍后再试",

        [369] = "心灵宝石数量不足",
        [370] = "伙伴觉醒等级不足",

        --封神赛
        [3000] = "当前区服暂未开启封神赛",
        [3001] = "未满足条件，无法参与封神赛",
        [3002] = "当前武将已在助阵位，无法再次上阵",
        [3003] = "",
        [3004] = "当前武将已上阵，无法再次上阵",
        [3005] = "当前武将已上阵，无法再次上阵",
        [3006] = "换将后有阵容为空，不可操作",
        [3007] = "当前武将已在助阵位，无法再次上阵",
        [3008] = "魔宠已在当前阵容",
        [3009] = "魔宠已在当前阵容",
        [3009] = "奖励已领取",
        [3010] = "阵容为空，无法上传阵容",
        [3011] = "BOSS战已结束",
        [3012] = "配置阵容为空，不能挑战BOSS",
        [3013] = "武将已在封神赛阵容中上阵",
        [3014] = "幻化武将已被使用",
        [3015] = "不在上传阵容时间内",

        [531] = "令牌已激活",

        [532] = "请先通关普通副本%s-%s-%s",
    },
    errorFunc = {
        [1] = userdataErr,
        [2] = userdataErr,
        [3] = userdataErr,
        [4] = userdataErr,
        [5] = sportdataErr,
        [6] = sportdataErr,
        [7] = sportdataErr,

    --    [8] = "数据有误,请退出游戏重新登录",
    --    [9] = "应用宝接口异常",

        [50] = userVipErr,
        [51] = userdataErr,

        [100] = userslotdataErr,
        [101] = userslotdataErr,
        [102] = userslotdataErr,
        [103] = userslotdataErr,
        [104] = userslotdataErr,
        [105] = userslotdataErr,
        [106] = userslotdataErr,
        [107] = userslotdataErr,
        [110] = userslotdataErr,

        [111] = userslotdataErr,
        [112] = userslotdataErr,
        [113] = userslotdataErr,
        [114] = userslotdataErr,
        [115] = userslotdataErr,
        [116] = userslotdataErr,
        [117] = userslotdataErr,

        [121] = userslotdataErr,
        [122] = userslotdataErr,
        [123] = userslotdataErr,
        [124] = userslotdataErr,
        [125] = userslotdataErr,
        [126] = userslotdataErr,
        [127] = userslotdataErr,

        [131] = userslotdataErr,
        [132] = userslotdataErr,
        [133] = userslotdataErr,
        [134] = userslotdataErr,
        [135] = userslotdataErr,
        [136] = userslotdataErr,

        [141] = userpetdataErr,
        [142] = userpetdataErr,
        [143] = userpetdataErr,
        [144] = userpetdataErr,
        [145] = userpetdataErr,
        [146] = userpetdataErr,
        [147] = userpetdataErr,

        [201] = userfrienddataErr,
        [202] = userfrienddataErr,

        [211] = usercupdataErr,
        [212] = usercupdataErr,

        [221] = usermieshendiandataErr,
        [222] = usermieshendiandataErr,

        [251] = usergangdataErr,
        [252] = usergangdataErr,
    --    [253] = "您刚退出公会，还不能加入其他公会",
        [254] = usergangdataErr,
        [255] = usergangdataErr,
    --    [256] = "不能直接踢公会管理层，请先将其降级",
    --    [257] = "会长不能直接退出公会，请先传位",
        [259] = usergangwardataErr,
        [260] = usergangdataErr,
        [262] = usergangwardataErr,
        [263] = usergangwardataErr,
        [264] = usergangwardataErr,

        [301] = userAuctionErr,
        [302] = userAuctionErr,
        [303] = userAuctionErr,

        [304] = userManorErr,
        [305] = userManorErr,
        [306] = userManorErr,
        [307] = userManorErr,
        [308] = userManorErr,
        [309] = userManorErr,

        [310] = userMessageErr,

        [311] = usergangbossdataErr,
        [312] = usergangbossdataErr,
        [313] = usergangbossdataErr,
        [314] = usergangbossdataErr,
        [315] = usergangbossdataErr,

        [331] = userHerobossErr,
        [332] = userHerobossErr,
        [333] = userHerobossErr,
        [334] = userHerobossErr,

        [901] = userrobselectdataErr,
        [902] = userrobselectdataErr,
        [903] = userrobselectdataErr,

        [987] = userMessageErr,
        [2009] = userWorldWardataErr,

        [1012] = userMessageErr,
        [1015] = userMessageErr,
        [999] = userMessageErr,
        [999996] = forceExit,
    },
    otherMsg = {
        [1] = "您的数据可能出现异常，退出游戏再重进可以解决！",
        [2] = "系统读取信息错误，请联系客服",
        [3] = "账号在其他地方登陆，请退出游戏重新登录并注意账号安全！",
        [4] = "您的数据可能出现异常",
        [5] = "操作太频繁，请稍后再试",
        [6] = "系统读取信息错误，请重新登录",
        [7] = "配置文件有更新，请重启游戏进行更新",
        [8] = "系统更新，请重启游戏",
    },
    
}

function logError.getStamina(self,stamina)
    return "获得体力"..stamina
end

function logError.getEnergy(self,energy)
    return "获得精力"..energy
end

function logError.getVipExp(self,num)
    return "获得VIP经验"..num
end

function logError.getGodStone(self,num)
    return "获得补天石"..num
end

function logError.notEnough( self ,name )
    return name.."不足！"
end

function logError.levelNotEnoughForStrengthen( self,level )
    return "等级不足，"..level.."级后可继续强化"
end
return logError












